jbuonagurio/fanboard/svd/CC32xxSF.svd
        <register>
          <name>PCTL</name>
          <addressOffset>0x52C</addressOffset>
          <size>32</size>
          <description>This register is not used in cc3xx. equivalant register exsist outside GPIO IP (refer PAD*_config register in the shared comn space) 0x4000 552C 0x4000 652C 0x4000 752C 0x4002 452C GPIO Port Control (GPIOPCTL)@@ offset 0x52C The GPIOPCTL register is used in conjunction with the GPIOAFSEL register and selects the specific peripheral signal for each GPIO pin when using the alternate function mode. Most bits in the GPIOAFSEL register are cleared on reset@@ therefore most GPIO pins are configured as GPIOs by default. When a bit is set in the GPIOAFSEL register@@ the corresponding GPIO signal is controlled by an associated peripheral. The GPIOPCTL register selects one out of a set of peripheral functions for each GPIO@@ providing additional flexibility in signal definition.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADCCTL</name>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <description>This register is not used in cc3xx. ADC trigger via GPIO is not supported. 0x4000 5530 0x4000 6530 0x4000 7530 0x4002 4530 GPIO ADC Control (GPIOADCCTL)@@ offset 0x530 This register is used to configure a GPIO pin as a source for the ADC trigger. Note that if the Port B GPIOADCCTL register is cleared@@ PB4 can still be used as an external trigger for the ADC. This is a legacy mode which allows code written for previous Stellaris devices to operate on this microcontroller.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMACTL</name>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <description>0x4000 5534 0x4000 6534 0x4000 7534 0x4002 4534 GPIO DMA Control (GPIODMACTL)@@ offset 0x534 This register is used to configure a GPIO pin as a source for the ?DMA trigger.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SI</name>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <description>0x4000 5538 0x4000 6538 0x4000 7538 0x4002 4538 GPIO Select Interrupt (GPIOSI)@@ offset 0x538 This register is used to enable individual interrupts for each pin. Note: This register is only available on Port P and Port Q.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PERIPHID4</name>
          <addressOffset>0xFD0</addressOffset>
          <size>32</size>
          <description>0x4000 5FD0 0x4000 6FD0 0x4000 7FD0 0x4002 4FD0 GPIO Peripheral Identification 4 (GPIOPeriphID4)@@ offset 0xFD0 The GPIOPeriphID4@@ GPIOPeriphID5@@ GPIOPeriphID6@@ and GPIOPeriphID7 registers can conceptually be treated as one 32-bit register; each register contains eight bits of the 32-bit register@@ used by software to identify the peripheral.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PERIPHID5</name>
          <addressOffset>0xFD4</addressOffset>
          <size>32</size>
          <description>0x4000 5FD4 0x4000 6FD4 0x4000 7FD4 0x4002 4FD4 GPIO Peripheral Identification 5 (GPIOPeriphID5)@@ offset 0xFD4 The GPIOPeriphID4@@ GPIOPeriphID5@@ GPIOPeriphID6@@ and GPIOPeriphID7 registers can conceptually be treated as one 32-bit register; each register contains eight bits of the 32-bit register@@ used by software to identify the peripheral.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PERIPHID6</name>
          <addressOffset>0xFD8</addressOffset>
          <size>32</size>
          <description>0x4000 5FD8 0x4000 6FD8 0x4000 7FD8 0x4002 4FD8 GPIO Peripheral Identification 6 (GPIOPeriphID6)@@ offset 0xFD8 The GPIOPeriphID4@@ GPIOPeriphID5@@ GPIOPeriphID6@@ and GPIOPeriphID7 registers can conceptually be treated as one 32-bit register; each register contains eight bits of the 32-bit register@@ used by software to identify the peripheral.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PERIPHID7</name>
          <addressOffset>0xFDC</addressOffset>
          <size>32</size>
          <description>0x4000 5FDC 0x4000 6FDC 0x4000 7FDC 0x4002 4FDC GPIO Peripheral Identification 7 (GPIOPeriphID7)@@ offset 0xFDC The GPIOPeriphID4@@ GPIOPeriphID5@@ GPIOPeriphID6@@ and GPIOPeriphID7 registers can conceptually be treated as one 32-bit register; each register contains eight bits of the 32-bit register@@ used by software to identify the peripheral.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PERIPHID0</name>
          <addressOffset>0xFE0</addressOffset>
          <size>32</size>
          <description>0x4000 5FE0 0x4000 6FE0 0x4000 7FE0 0x4002 4FE0 GPIO Peripheral Identification 0 (GPIOPeriphID0)@@ offset 0xFE0 The GPIOPeriphID0@@ GPIOPeriphID1@@ GPIOPeriphID2@@ and GPIOPeriphID3 registers can conceptually be treated as one 32-bit register; each register contains eight bits of the 32-bit register@@ used by software to identify the peripheral.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PERIPHID1</name>
          <addressOffset>0xFE4</addressOffset>
          <size>32</size>
          <description>0x4000 5FE4 0x4000 6FE4 0x4000 7FE4 0x4002 4FE4 GPIO Peripheral Identification 1 (GPIOPeriphID1)@@ offset 0xFE4 The GPIOPeriphID0@@ GPIOPeriphID1@@ GPIOPeriphID2@@ and GPIOPeriphID3 registers can conceptually be treated as one 32-bit register; each register contains eight bits of the 32-bit register@@ used by software to identify the peripheral.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PERIPHID2</name>
          <addressOffset>0xFE8</addressOffset>
          <size>32</size>
          <description>0x4000 5FE8 0x4000 6FE8 0x4000 7FE8 0x4002 4FE8 GPIO Peripheral Identification 2 (GPIOPeriphID2)@@ offset 0xFE8 The GPIOPeriphID0@@ GPIOPeriphID1@@ GPIOPeriphID2@@ and GPIOPeriphID3 registers can conceptually be treated as one 32-bit register; each register contains eight bits of the 32-bit register@@ used by software to identify the peripheral.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PERIPHID3</name>
          <addressOffset>0xFEC</addressOffset>
          <size>32</size>
          <description>0x4000 5FEC 0x4000 6FEC 0x4000 7FEC 0x4002 4FEC GPIO Peripheral Identification 3 (GPIOPeriphID3)@@ offset 0xFEC The GPIOPeriphID0@@ GPIOPeriphID1@@ GPIOPeriphID2@@ and GPIOPeriphID3 registers can conceptually be treated as one 32-bit register; each register contains eight bits of the 32-bit register@@ used by software to identify the peripheral.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PCELLID0</name>
          <addressOffset>0xFF0</addressOffset>
          <size>32</size>
          <description>0x4000 5FF0 0x4000 6FF0 0x4000 7FF0 0x4002 4FF0 GPIO PrimeCell Identification 0 (GPIOPCellID0)@@ offset 0xFF0 The GPIOPCellID0@@ GPIOPCellID1@@ GPIOPCellID2@@ and GPIOPCellID3 registers are four 8-bit wide registers@@ that can conceptually be treated as one 32-bit register. The register is used as a standard cross-peripheral identification system.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PCELLID1</name>
          <addressOffset>0xFF4</addressOffset>
          <size>32</size>
          <description>0x4000 5FF4 0x4000 6FF4 0x4000 7FF4 0x4002 4FF4 GPIO PrimeCell Identification 1 (GPIOPCellID1)@@ offset 0xFF4 The GPIOPCellID0@@ GPIOPCellID1@@ GPIOPCellID2@@ and GPIOPCellID3 registers are four 8-bit wide registers@@ that can conceptually be treated as one 32-bit register. The register is used as a standard cross-peripheral identification system.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PCELLID2</name>
          <addressOffset>0xFF8</addressOffset>
          <size>32</size>
          <description>0x4000 5FF8 0x4000 6FF8 0x4000 7FF8 0x4002 4FF8 GPIO PrimeCell Identification 2 (GPIOPCellID2)@@ offset 0xFF8 The GPIOPCellID0@@ GPIOPCellID1@@ GPIOPCellID2@@ and GPIOPCellID3 registers are four 8-bit wide registers@@ that can conceptually be treated as one 32-bit register. The register is used as a standard cross-peripheral identification system.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PCELLID3</name>
          <addressOffset>0xFFC</addressOffset>
          <size>32</size>
          <description>0x4000 5FFC 0x4000 6FFC 0x4000 7FFC 0x4002 4FFC GPIO PrimeCell Identification 3 (GPIOPCellID3)@@ offset 0xFFC The GPIOPCellID0@@ GPIOPCellID1@@ GPIOPCellID2@@ and GPIOPCellID3 registers are four 8-bit wide registers@@ that can conceptually be treated as one 32-bit register. The register is used as a standard cross-peripheral identification system.0xb1 ****************************************************************************</description>
          <resetValue>0</resetValue>
        </register>
