jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UARTA1</name>
      <baseAddress>0x4000D000</baseAddress>
      <registers>
        <register>
          <name>DR</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>DR</description>
          <fields>
            <field>
              <name>DATA</name>
              <description>[7:0] Data Transmitted or Received</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RSR_ECR</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>RSR_ECR</description>
          <fields>
            <field>
              <name>UART_ECR_DATA</name>
              <description>[7:0] Error Clear</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FR</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>FR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ILPR</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>ILPR</description>
          <fields>
            <field>
              <name>ILPDVSR</name>
              <description>[7:0] IrDA Low-Power Divisor</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IBRD</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>IBRD</description>
          <fields>
            <field>
              <name>DIVINT</name>
              <description>[15:0] Integer Baud-Rate Divisor</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FBRD</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>FBRD</description>
          <fields>
            <field>
              <name>DIVFRAC</name>
              <description>[5:0] Fractional Baud-Rate Divisor</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LCRH</name>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <description>LCRH</description>
          <fields>
            <field>
              <name>WLEN</name>
              <description>[6:5] UART Word Length 0x00000000 : UART_LCRH_WLEN_5 : 5 bits (default) 0x00000020 : UART_LCRH_WLEN_6 : 6 bits 0x00000040 : UART_LCRH_WLEN_7 : 7 bits 0x00000060 : UART_LCRH_WLEN_8 : 8 bits</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTL</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>CTL</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IFLS</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>IFLS</description>
          <fields>
            <field>
              <name>RX</name>
              <description>[5:3] UART Receive Interrupt FIFO Level Select</description>
              <bitWidth>3</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>TX</name>
              <description>[2:0] UART Transmit Interrupt FIFO Level Select</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IM</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>IM</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RIS</name>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <description>RIS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MIS</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>MIS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>ICR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMACTL</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>DMACTL</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LCTL</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>LCTL</description>
          <fields>
            <field>
              <name>BLEN</name>
              <description>[5:4] Sync Break Length 0x00000000 : UART_LCTL_BLEN_13T : Sync break length is 13T bits (default) 0x00000010 : UART_LCTL_BLEN_14T : Sync break length is 14T bits 0x00000020 : UART_LCTL_BLEN_15T : Sync break length is 15T bits 0x00000030 : UART_LCTL_BLEN_16T : Sync break length is 16T bits</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LSS</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>LSS</description>
          <fields>
            <field>
              <name>TSS</name>
              <description>[15:0] Timer Snap Shot</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LTIM</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>LTIM</description>
          <fields>
            <field>
              <name>TIMER</name>
              <description>[15:0] Timer Value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UART_9BITADDR</name>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <description>UART_9BITADDR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UART_9BITAMASK</name>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <description>UART_9BITAMASK</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PP</name>
          <addressOffset>0xFC0</addressOffset>
          <size>32</size>
          <description>PP</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC</name>
          <addressOffset>0xFC8</addressOffset>
          <size>32</size>
          <description>CC</description>
          <fields>
            <field>
              <name>CS</name>
              <description>[3:0] UART Baud Clock Source 0x00000005 : UART_CC_CS_PIOSC : PIOSC 0x00000000 : UART_CC_CS_SYSCLK : The system clock (default)</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
