jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I2CA0</name>
      <baseAddress>0x40020000</baseAddress>
      <registers>
        <register>
          <name>MSA</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>MSA</description>
          <fields>
            <field>
              <name>SA</name>
              <description>[7:1] I2C Slave Address</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCS</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>MCS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MDR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>MDR</description>
          <fields>
            <field>
              <name>DATA</name>
              <description>[7:0] Data Transferred</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MTPR</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>MTPR</description>
          <fields>
            <field>
              <name>TPR</name>
              <description>[6:0] SCL Clock Period</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MIMR</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>MIMR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MRIS</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>MRIS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MMIS</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>MMIS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MICR</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>MICR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCR</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>MCR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCLKOCNT</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>MCLKOCNT</description>
          <fields>
            <field>
              <name>CNTL</name>
              <description>[7:0] I2C Master Count</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MBMON</name>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <description>MBMON</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MBLEN</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>MBLEN</description>
          <fields>
            <field>
              <name>CNTL</name>
              <description>[7:0] I2C Burst Length</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MBCNT</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>MBCNT</description>
          <fields>
            <field>
              <name>CNTL</name>
              <description>[7:0] I2C Master Burst Count</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SOAR</name>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <description>SOAR</description>
          <fields>
            <field>
              <name>OAR</name>
              <description>[6:0] I2C Slave Own Address</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SCSR</name>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <description>SCSR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SDR</name>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <description>SDR</description>
          <fields>
            <field>
              <name>DATA</name>
              <description>[7:0] Data for Transfer</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SIMR</name>
          <addressOffset>0x80C</addressOffset>
          <size>32</size>
          <description>SIMR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRIS</name>
          <addressOffset>0x810</addressOffset>
          <size>32</size>
          <description>SRIS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SMIS</name>
          <addressOffset>0x814</addressOffset>
          <size>32</size>
          <description>SMIS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SICR</name>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <description>SICR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SOAR2</name>
          <addressOffset>0x81C</addressOffset>
          <size>32</size>
          <description>SOAR2</description>
          <fields>
            <field>
              <name>OAR2</name>
              <description>[6:0] I2C Slave Own Address 2</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SACKCTL</name>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <description>SACKCTL</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FIFODATA</name>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <description>FIFODATA</description>
          <fields>
            <field>
              <name>DATA</name>
              <description>[7:0] I2C FIFO Data Byte</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FIFOCTL</name>
          <addressOffset>0xF04</addressOffset>
          <size>32</size>
          <description>FIFOCTL</description>
          <fields>
            <field>
              <name>RXTRIG</name>
              <description>[18:16] RX FIFO Trigger</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TXTRIG</name>
              <description>[2:0] TX FIFO Trigger</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FIFOSTATUS</name>
          <addressOffset>0xF08</addressOffset>
          <size>32</size>
          <description>FIFOSTATUS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OBSMUXSEL0</name>
          <addressOffset>0xF80</addressOffset>
          <size>32</size>
          <description>OBSMUXSEL0</description>
          <fields>
            <field>
              <name>LN3</name>
              <description>[26:24] Observation Mux Lane 3</description>
              <bitWidth>3</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>LN2</name>
              <description>[18:16] Observation Mux Lane 2</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>LN1</name>
              <description>[10:8] Observation Mux Lane 1</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>LN0</name>
              <description>[2:0] Observation Mux Lane 0</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OBSMUXSEL1</name>
          <addressOffset>0xF84</addressOffset>
          <size>32</size>
          <description>OBSMUXSEL1</description>
          <fields>
            <field>
              <name>LN7</name>
              <description>[26:24] Observation Mux Lane 7</description>
              <bitWidth>3</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>LN6</name>
              <description>[18:16] Observation Mux Lane 6</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>LN5</name>
              <description>[10:8] Observation Mux Lane 5</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>LN4</name>
              <description>[2:0] Observation Mux Lane 4</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MUXROUTE</name>
          <addressOffset>0xF88</addressOffset>
          <size>32</size>
          <description>MUXROUTE</description>
          <fields>
            <field>
              <name>LN7ROUTE</name>
              <description>[30:28] Lane 7 output is routed to the lane pointed to by the offset in this bit field</description>
              <bitWidth>3</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>LN6ROUTE</name>
              <description>[26:24] Lane 6 output is routed to the lane pointed to by the offset in this bit field</description>
              <bitWidth>3</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>LN5ROUTE</name>
              <description>[22:20] Lane 5 output is routed to the lane pointed to by the offset in this bit field</description>
              <bitWidth>3</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>LN4ROUTE</name>
              <description>[18:16] Lane 4 output is routed to the lane pointed to by the offset in this bit field</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>LN3ROUTE</name>
              <description>[14:12] Lane 3 output is routed to the lane pointed to by the offset in this bit field</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>LN2ROUTE</name>
              <description>[10:8] Lane 2 output is routed to the lane pointed to by the offset in this bit field</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>LN1ROUTE</name>
              <description>[6:4] Lane 1 output is routed to the lane pointed to by the offset in this bit field</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>LN0ROUTE</name>
              <description>[2:0] Lane 0 output is routed to the lane pointed to by the offset in this bit field</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PV</name>
          <addressOffset>0xFB0</addressOffset>
          <size>32</size>
          <description>PV</description>
          <fields>
            <field>
              <name>MAJOR</name>
              <description>[15:8] Major Revision</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MINOR</name>
              <description>[7:0] Minor Revision</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PP</name>
          <addressOffset>0xFC0</addressOffset>
          <size>32</size>
          <description>PP</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC</name>
          <addressOffset>0xFC4</addressOffset>
          <size>32</size>
          <description>PC</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC</name>
          <addressOffset>0xFC8</addressOffset>
          <size>32</size>
          <description>CC</description>
          <resetValue>0</resetValue>
        </register>
