jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIMERA3</name>
      <baseAddress>0x40033000</baseAddress>
      <registers>
        <register>
          <name>CFG</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>GPTM Configuration</description>
          <fields>
            <field>
              <name>CFG</name>
              <description>[2:0] GPTM Configuration</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAMR</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>GPTM Timer A Mode</description>
          <fields>
            <field>
              <name>TAMR</name>
              <description>[1:0] GPTM Timer A Mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBMR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>GPTM Timer B Mode</description>
          <fields>
            <field>
              <name>TBMR</name>
              <description>[1:0] GPTM Timer B Mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTL</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>GPTM Control ##### GARNET BEGIN #####</description>
          <fields>
            <field>
              <name>TBEVENT</name>
              <description>[11:10] GPTM Timer B Event Mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>TAEVENT</name>
              <description>[3:2] GPTM Timer A Event Mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYNC</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>GPTM Synchronize ##### GARNET END #####</description>
          <fields>
            <field>
              <name>SYNC11</name>
              <description>[23:22] Synchronize GPTM Timer 11</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>SYNC10</name>
              <description>[21:20] Synchronize GPTM Timer 10</description>
              <bitWidth>2</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>SYNC9</name>
              <description>[19:18] Synchronize GPTM Timer 9</description>
              <bitWidth>2</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>SYNC8</name>
              <description>[17:16] Synchronize GPTM Timer 8</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>SYNC7</name>
              <description>[15:14] Synchronize GPTM Timer 7</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>SYNC6</name>
              <description>[13:12] Synchronize GPTM Timer 6</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>SYNC5</name>
              <description>[11:10] Synchronize GPTM Timer 5</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>SYNC4</name>
              <description>[9:8] Synchronize GPTM Timer 4</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SYNC3</name>
              <description>[7:6] Synchronize GPTM Timer 3</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SYNC2</name>
              <description>[5:4] Synchronize GPTM Timer 2</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SYNC1</name>
              <description>[3:2] Synchronize GPTM Timer 1</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SYNC0</name>
              <description>[1:0] Synchronize GPTM Timer 0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IMR</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>GPTM Interrupt Mask</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RIS</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>GPTM Raw Interrupt Status</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MIS</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>GPTM Masked Interrupt Status</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>GPTM Interrupt Clear</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAILR</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>GPTM Timer A Interval Load</description>
          <fields>
            <field>
              <name>TAILRH</name>
              <description>[31:16] GPTM Timer A Interval Load Register High</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TAILRL</name>
              <description>[15:0] GPTM Timer A Interval Load Register Low</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBILR</name>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <description>GPTM Timer B Interval Load</description>
          <fields>
            <field>
              <name>TBILRL</name>
              <description>[15:0] GPTM Timer B Interval Load Register</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAMATCHR</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>GPTM Timer A Match</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBMATCHR</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>GPTM Timer B Match</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAPR</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>GPTM Timer A Prescale</description>
          <fields>
            <field>
              <name>TAPSRH</name>
              <description>[15:8] GPTM Timer A Prescale High Byte ##### GARNET END #####</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TAPSR</name>
              <description>[7:0] GPTM Timer A Prescale ##### GARNET BEGIN #####</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBPR</name>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <description>GPTM Timer B Prescale</description>
          <fields>
            <field>
              <name>TBPSRH</name>
              <description>[15:8] GPTM Timer B Prescale High Byte ##### GARNET END #####</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TBPSR</name>
              <description>[7:0] GPTM Timer B Prescale ##### GARNET BEGIN #####</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAPMR</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>GPTM TimerA Prescale Match</description>
          <fields>
            <field>
              <name>TAPSMRH</name>
              <description>[15:8] GPTM Timer A Prescale Match High Byte ##### GARNET END #####</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TAPSMR</name>
              <description>[7:0] GPTM TimerA Prescale Match ##### GARNET BEGIN #####</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBPMR</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>GPTM TimerB Prescale Match</description>
          <fields>
            <field>
              <name>TBPSMRH</name>
              <description>[15:8] GPTM Timer B Prescale Match High Byte ##### GARNET END #####</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TBPSMR</name>
              <description>[7:0] GPTM TimerB Prescale Match ##### GARNET BEGIN #####</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAR</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>GPTM Timer A</description>
          <fields>
            <field>
              <name>TARH</name>
              <description>[31:16] GPTM Timer A Register High</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TARL</name>
              <description>[15:0] GPTM Timer A Register Low</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBR</name>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <description>GPTM Timer B</description>
          <fields>
            <field>
              <name>TBRL</name>
              <description>[23:0] GPTM Timer B</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAV</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>GPTM Timer A Value</description>
          <fields>
            <field>
              <name>TAVH</name>
              <description>[31:16] GPTM Timer A Value High</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TAVL</name>
              <description>[15:0] GPTM Timer A Register Low</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBV</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>GPTM Timer B Value</description>
          <fields>
            <field>
              <name>TBVL</name>
              <description>[15:0] GPTM Timer B Register</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RTCPD</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>GPTM RTC Predivide</description>
          <fields>
            <field>
              <name>RTCPD</name>
              <description>[15:0] RTC Predivide Counter Value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAPS</name>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <description>GPTM Timer A Prescale Snapshot</description>
          <fields>
            <field>
              <name>PSS</name>
              <description>[15:0] GPTM Timer A Prescaler Snapshot</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBPS</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>GPTM Timer B Prescale Snapshot</description>
          <fields>
            <field>
              <name>PSS</name>
              <description>[15:0] GPTM Timer A Prescaler Value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAPV</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>GPTM Timer A Prescale Value</description>
          <fields>
            <field>
              <name>PSV</name>
              <description>[15:0] GPTM Timer A Prescaler Value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBPV</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>GPTM Timer B Prescale Value</description>
          <fields>
            <field>
              <name>PSV</name>
              <description>[15:0] GPTM Timer B Prescaler Value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMAEV</name>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <description>GPTM DMA Event</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PP</name>
          <addressOffset>0xFC0</addressOffset>
          <size>32</size>
          <description>GPTM Peripheral Properties ***************************************************************************</description>
          <fields>
            <field>
              <name>SIZE</name>
              <description>[3:0] Count Size</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
