jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>STACKDIE_CTRL</name>
      <baseAddress>0x400F5000</baseAddress>
      <registers>
        <register>
          <name>STK_UP_RESET</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Can be written only by Base Processor. Writing to this register will reset the stack processor reset will be de-asserted upon clearing this register.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SR_MASTER_PRIORITY</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>This register defines who among base processor and stack processor have highest priority for Sram Access. Can be written only by Base Processor.</description>
          <fields>
            <field>
              <name>PRIORITY</name>
              <description>[1:0] 00 : Equal Priority 01 : Stack Processor have priority 10 : Base Processor have priority 11 : Unused</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STK_SR_ACC_CTL_BK2</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>In Spinlock mode this Register defines who among base processor and stack processor have access to Sram Bank2 right now. In Handshake mode this Register defines who among base processor and stack processor have access to Sram Bank2 and Bank3 right now. Its Clear only register and is set by hardware. Lower bit can be cleared only by Base Processor and Upper bit Cleared only by the Stack processor.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BASE_UP_ACC_REQ_BK2</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>In Spinlock mode whenever Base processor wants the access to Sram Bank2 it should request for it by writing into this register. It'll get interrupt whenever it is granted. In Handshake mode this bit will be set by Stack processor. Its a set only bit and is cleared by HW when the request is granted.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STK_UP_ACC_REQ_BK2</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>In Spinlock mode Whenever Stack processor wants the access to Sram Bank2 it should request for it by writing into this register. It'll get interrupt whenever it is granted. In Handshake mode this bit will be set by the Base processor. Its a set only bit and is cleared by HW when the request is granted.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STK_SR_ACC_CTL_BK3</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Register defines who among base processor and stack processor have access to Sram Bank3 right now. Its Clear only register and is set by hardware. Lower bit can be cleared only by Base Processor and Upper bit Cleared only by the Stack processor.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BASE_UP_ACC_REQ_BK3</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>In Spinlock mode whenever Base processor wants the access to Sram Bank3 it should request for it by writing into this register. It'll get interrupt whenever it is granted. In Handshake mode this bit will be set by Stack processor. Its a set only bit and is cleared by HW when the request is granted.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STK_UP_ACC_REQ_BK3</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>In Spinlock mode Whenever Stack processor wants the access to Sram Bank3 it should request for it by writing into this register. It'll get interrupt whenever it is granted. In Handshake mode this bit will be set by the Base processor. Its a set only bit and is cleared by HW when the request is granted.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RDSM_CFG_CPU</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Read State Machine timing configuration register. Generally Bit 4 and 3 will be identical. For stacked die always 43 are 0 and 6:5 == 1 for 120Mhz.</description>
          <fields>
            <field>
              <name>FLCLK_PULSE_WIDTH</name>
              <description>[7:6] Bank Clock Hi Time 00 : HCLK pulse 01 : 1 cycle of HCLK 10 : 1.5 cycles of HCLK 11 : 2 cycles of HCLK</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>READ_WAIT_STATE</name>
              <description>[3:0] Number of wait states inserted</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RDSM_CFG_EE</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Read State Machine timing configuration register. Generally Bit 4 and 3 will be identical. For stacked die always 43 are 0 and 6:5 == 1 for 120Mhz.</description>
          <fields>
            <field>
              <name>FLCLK_PULSE_WIDTH</name>
              <description>[7:6] Bank Clock Hi Time 00 : HCLK pulse 01 : 1 cycle of HCLK 10 : 1.5 cycles of HCLK 11 : 2 cycles of HCLK</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>READ_WAIT_STATE</name>
              <description>[3:0] Number of wait states inserted</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BASE_UP_IRQ_LOG</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Reading this register Base procesor will able to know the reason for the interrupt. This is clear only register - set by HW upon an interrupt to Base processor and can be cleared only by BASE processor.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STK_UP_IRQ_LOG</name>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <description>Reading this register Stack procesor will able to know the reason for the interrupt. This is clear only register - set by HW upon an interrupt to Stack processor and can be cleared only by Stack processor.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STK_CLK_EN</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Can be written only by base processor. Controls the enable pin of the cgcs for the clocks going to CM3 dft ctrl block and Sram.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SPIN_LOCK_MODE</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Can be written only by the base processor. Decides the ram sharing mode :: handshake or Spinlock mode.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BUS_FAULT_ADDR</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Stores the last bus fault address.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BUS_FAULT_CLR</name>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <description>write only registers on read returns 0.W Write 1 to clear the bust fault to store the new bus fault address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RESET_CAUSE</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Reset cause value captured from the ICR_CLKRST block.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WDOG_TIMER_EVENT</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Watchdog timer event value captured from the ICR_CLKRST block</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA_REQ</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>To send Dma Request to bottom die.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRAM_JUMP_OFFSET_ADDR</name>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <description>Address offset within SRAM to which CM3 should jump after reset.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SW_REG1</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>These are sw registers for topdie processor and bottom die processor to communicate. Both can set and read these registers. In case of write clash bottom die's processor wins and top die processor access is ignored.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SW_REG2</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>These are sw registers for topdie processor and bottom die processor to communicate. Both can set and read these registers. In case of write clash bottom die's processor wins and top die processor access is ignored.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FMC_SLEEP_CTL</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>By posting the request Flash can be put into low-power mode (Sleep) without powering down the Flash. Earlier (in Garnet) this was fully h/w controlled and the control for this was coming from SysCtl while entering into Cortex Deep-sleep mode. But for our device the D2D i/f doesnt support this. The Firmware has to program the register in the top-die for entering into this mode and wait for an interrupt.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MISC_CTL</name>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <description>Miscellanious control register.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SW_DFT_CTL</name>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <description>DFT control and status bits</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PADN_CTL_0</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>Mainly for For controlling the pads OEN pins. There are total 60 pads and hence 60 control registe i.e n value varies from 0 to 59. Here is the mapping for the pad_ctl register number and the functionality : 0 D2DPAD_DMAREQ1 1 D2DPAD_DMAREQ0 2 D2DPAD_INT2BASE 3 D2DPAD_PIOSC 4 D2DPAD_RST_N 5 D2DPAD_POR_RST_N 6 D2DPAD_HCLK 7 D2DPAD_JTAG_TDO 8 D2DPAD_JTAG_TCK 9 D2DPAD_JTAG_TMS 10 D2DPAD_JTAG_TDI 11-27 D2DPAD_FROMSTACK[D2D_FROMSTACK_SIZE -1:0] 28-56 D2DPAD_TOSTACK [D2D_TOSTACK_SIZE -1:0] 57-59 D2DPAD_SPARE [D2D_SPARE_PAD_SIZE -1:0] 0:00 ****************************************************************************</description>
          <resetValue>0</resetValue>
        </register>
