jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMMON_REG</name>
      <baseAddress>0x400F7000</baseAddress>
      <registers>
        <register>
          <name>I2C_PROPERTIES_REGISTER</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>I2C_PROPERTIES_REGISTER</description>
          <fields>
            <field>
              <name>COMMON_REG_I2C_Properties_Register_I2C_Properties_Register</name>
              <description>[1:0] Each semaphore register is of 2 bit.  When this register is set to 2b01  Apps have access and when set to 2b10  NW have access.  Ideally both the master can modify any of this 2 bit, but assumption apps will write only 2b01 or 2b00 to this register and nw will write only 2b10 or 2b00.  Implementation is when any of the bit of this register is set, only next write allowedvis 2b00  Again assumption is one master will not write 2b00 if other is already holding the semaphore.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SPI_PROPERTIES_REGISTER</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>SPI_PROPERTIES_REGISTER</description>
          <fields>
            <field>
              <name>COMMON_REG_SPI_Properties_Register_SPI_Properties_Register</name>
              <description>[1:0] Each semaphore register is of 2 bit.  When this register is set to 2b01  Apps have access and when set to 2b10  NW have access.  Ideally both the master can modify any of this 2 bit, but assumption apps will write only 2b01 or 2b00 to this register and nw will write only 2b10 or 2b00.  Implementation is when any of the bit of this register is set, only next write allowedvis 2b00  Again assumption is one master will not write 2b00 if other is already holding the semaphore.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_SH_RESOURCE_INTERRUPT_ENABLE</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>APPS_SH_RESOURCE_INTERRUPT_ENABLE</description>
          <fields>
            <field>
              <name>COMMON_REG_APPS_sh_resource_Interrupt_enable_APPS_sh_resource_Interrupt_enable</name>
              <description>[3:0] Interrupt enable APPS bit 0 -> when '1' enable I2C interrupt bit 1 -> when '1' enable SPI interrupt bit 3 -> when '1' enable GPIO interrupt</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_SH_RESOURCE_INTERRUPT_STATUS</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>APPS_SH_RESOURCE_INTERRUPT_STATUS</description>
          <fields>
            <field>
              <name>COMMON_REG_APPS_sh_resource_Interrupt_status_APPS_sh_resource_Interrupt_status</name>
              <description>[3:0] Interrupt enable APPS bit 0 -> when '1' enable I2C interrupt bit 1 -> when '1' enable SPI interrupt bit 3 -> when '1' enable GPIO interrupt</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_SH_RESOURCE_INTERRUPT_ENABLE</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>NWP_SH_RESOURCE_INTERRUPT_ENABLE</description>
          <fields>
            <field>
              <name>COMMON_REG_NWP_sh_resource_Interrupt_enable_NWP_sh_resource_Interrupt_enable</name>
              <description>[3:0] Interrupt enable NWP bit 0 -> when '1' enable I2C interrupt bit 1 -> when '1' enable SPI interrupt bit 3 -> when '1' enable GPIO interrupt</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_SH_RESOURCE_INTERRUPT_STATUS</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>NWP_SH_RESOURCE_INTERRUPT_STATUS</description>
          <fields>
            <field>
              <name>COMMON_REG_NWP_sh_resource_Interrupt_status_NWP_sh_resource_Interrupt_status</name>
              <description>[3:0] Interrupt enable NWP bit 0 -> when '1' enable I2C interrupt bit 1 -> when '1' enable SPI interrupt bit 3 -> when '1' enable GPIO interrupt</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FLASH_CTRL_REG</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>FLASH_CTRL_REG</description>
          <fields>
            <field>
              <name>COMMON_REG_Flash_ctrl_reg_Flash_ctrl_reg</name>
              <description>[1:0] Each semaphore register is of 2 bit.  When this register is set to 2b01  Apps have access and when set to 2b10  NW have access.  Ideally both the master can modify any of this 2 bit, but assumption apps will write only 2b01 or 2b00 to this register and nw will write only 2b10 or 2b00.  Implementation is when any of the bit of this register is set, only next write allowedvis 2b00  Again assumption is one master will not write 2b00 if other is already holding the semaphore.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BUS_MATRIX_M0_SEGMENT_ACCESS_CONFIG</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>BUS_MATRIX_M0_SEGMENT_ACCESS_CONFIG</description>
          <fields>
            <field>
              <name>COMMON_REG_Bus_matrix_M0_segment_access_config_Bus_matrix_M0_segment_access_config</name>
              <description>[17:0] Master 0 control word matrix to each segment. Tieoff. Bit value 1 indicates segment is accesable.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BUS_MATRIX_M1_SEGMENT_ACCESS_CONFIG</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>BUS_MATRIX_M1_SEGMENT_ACCESS_CONFIG</description>
          <fields>
            <field>
              <name>COMMON_REG_Bus_matrix_M1_segment_access_config_Bus_matrix_M1_segment_access_config</name>
              <description>[17:0] Master 1 control word matrix to each segment. Tieoff. Bit value 1 indicates segment is accesable.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BUS_MATRIX_M2_SEGMENT_ACCESS_CONFIG</name>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <description>BUS_MATRIX_M2_SEGMENT_ACCESS_CONFIG</description>
          <fields>
            <field>
              <name>COMMON_REG_Bus_matrix_M2_segment_access_config_Bus_matrix_M2_segment_access_config</name>
              <description>[17:0] Master 2 control word matrix to each segment. Tieoff. Bit value 1 indicates segment is accesable.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BUS_MATRIX_M3_SEGMENT_ACCESS_CONFIG</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>BUS_MATRIX_M3_SEGMENT_ACCESS_CONFIG</description>
          <fields>
            <field>
              <name>COMMON_REG_Bus_matrix_M3_segment_access_config_Bus_matrix_M3_segment_access_config</name>
              <description>[17:0] Master 3 control word matrix to each segment. Tieoff. Bit value 1 indicates segment is accesable.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BUS_MATRIX_M4_SEGMENT_ACCESS_CONFIG</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>BUS_MATRIX_M4_SEGMENT_ACCESS_CONFIG</description>
          <fields>
            <field>
              <name>COMMON_REG_Bus_matrix_M4_segment_access_config_Bus_matrix_M4_segment_access_config</name>
              <description>[17:0] Master 4 control word matrix to each segment. Tieoff. Bit value 1 indicates segment is accesable.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BUS_MATRIX_M5_SEGMENT_ACCESS_CONFIG</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>BUS_MATRIX_M5_SEGMENT_ACCESS_CONFIG</description>
          <fields>
            <field>
              <name>COMMON_REG_Bus_matrix_M5_segment_access_config_Bus_matrix_M5_segment_access_config</name>
              <description>[17:0] Master 5 control word matrix to each segment. Tieoff. Bit value 1 indicates segment is accesable.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_PROPERTIES_REGISTER</name>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <description>GPIO_PROPERTIES_REGISTER</description>
          <fields>
            <field>
              <name>COMMON_REG_GPIO_properties_register_GPIO_properties_register</name>
              <description>[9:0] Shared GPIO configuration register. Bit [1:0] to configure GPIO0 Bit [3:2] to configure GPIO1 Bit [5:4] to configure GPIO2 Bit [7:6] to configure GPIO3 Bit [9:8] to configure GPIO4 each GPIO can be individully selected. When 00? GPIO is free resource. When 01? GPIO is APPS resource. When 10? GPIO is NWP resource. Writing 11 doesnt have any affect, i.e. If one write only relevant gpio semaphore and other bits are 1s, it'll not disturb the other semaphore bits. For example : Say If NW wants to take control of gpio-1, one should write 10'b11_1111_1011 and if one wants to release it write 10'b11_1111_0011.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_NW_SEMAPHORE1</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>APPS_NW_SEMAPHORE1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_NW_SEMAPHORE2</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>APPS_NW_SEMAPHORE2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_NW_SEMAPHORE3</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>APPS_NW_SEMAPHORE3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_NW_SEMAPHORE4</name>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <description>APPS_NW_SEMAPHORE4</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_NW_SEMAPHORE5</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>APPS_NW_SEMAPHORE5</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_NW_SEMAPHORE6</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>APPS_NW_SEMAPHORE6</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_NW_SEMAPHORE7</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>APPS_NW_SEMAPHORE7</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_NW_SEMAPHORE8</name>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <description>APPS_NW_SEMAPHORE8</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_NW_SEMAPHORE9</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>APPS_NW_SEMAPHORE9</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_NW_SEMAPHORE10</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>APPS_NW_SEMAPHORE10</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_NW_SEMAPHORE11</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>APPS_NW_SEMAPHORE11</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_NW_SEMAPHORE12</name>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <description>APPS_NW_SEMAPHORE12</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_SEMAPPHORE_PEND</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>APPS_SEMAPPHORE_PEND</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NW_SEMAPPHORE_PEND</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>NW_SEMAPPHORE_PEND</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE_STATUS</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>SEMAPHORE_STATUS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IDMEM_TIM_UPDATE</name>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <description>IDMEM_TIM_UPDATE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FPGA_ROM_WR_EN</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>FPGA_ROM_WR_EN</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NW_INT_MASK</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>NW_INT_MASK</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NW_INT_MASK_SET</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>NW_INT_MASK_SET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NW_INT_MASK_CLR</name>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <description>NW_INT_MASK_CLR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NW_INT_STS_CLR</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>NW_INT_STS_CLR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NW_INT_ACK</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>NW_INT_ACK</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NW_INT_TRIG</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>NW_INT_TRIG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NW_INT_STS_MASKED</name>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <description>NW_INT_STS_MASKED</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NW_INT_STS_RAW</name>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <description>NW_INT_STS_RAW</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_INT_MASK</name>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <description>APPS_INT_MASK</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_INT_MASK_SET</name>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <description>APPS_INT_MASK_SET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_INT_MASK_CLR</name>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <description>APPS_INT_MASK_CLR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_INT_STS_CLR</name>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <description>APPS_INT_STS_CLR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_INT_ACK</name>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <description>APPS_INT_ACK</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_INT_TRIG</name>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <description>APPS_INT_TRIG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_INT_STS_MASKED</name>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <description>APPS_INT_STS_MASKED</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_INT_STS_RAW</name>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <description>APPS_INT_STS_RAW</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IDMEM_TIM_UPDATED</name>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <description>IDMEM_TIM_UPDATED</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_GPIO_TRIG_EN</name>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <description>APPS_GPIO_TRIG_EN</description>
          <fields>
            <field>
              <name>APPS_GPIO_TRIG_EN</name>
              <description>[4:0] APPS GPIO Trigger EN control. Bit 0: when '1' enable GPIO 0 trigger. This bit enables trigger for all GPIO 0 pins (GPIO 0 to GPIO7). Bit 1: when '1' enable GPIO 1 trigger. This bit enables trigger for all GPIO 1 pins ( GPIO8 to GPIO15). Bit 2: when '1' enable GPIO 2 trigger. This bit enables trigger for all GPIO 2 pins (GPIO16 to GPIO23). Bit 3: when '1' enable GPIO 3 trigger. This bit enables trigger for all GPIO 3 pins (GPIO24 to GPIO31). Bit 4: when '1' enable GPIO 4 trigger. This bit enables trigger for all GPIO 4 pins.(GPIO32 to GPIO39)</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EMU_DEBUG_REG</name>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <description>EMU_DEBUG_REG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE_STATUS2</name>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <description>SEMAPHORE_STATUS2</description>
          <fields>
            <field>
              <name>SEMPAPHORE_STATUS2</name>
              <description>[23:0] SEMAPHORE STATUS 23:22 :semaphore status of apps_nw_semaphore11 21:20 :semaphore status of apps_nw_semaphore11 19:18 :semaphore status of apps_nw_semaphore10 17:16 :semaphore status of apps_nw_semaphore9 15:14 :semaphore status of apps_nw_semaphore8 13:12 :semaphore status of apps_nw_semaphore7 11:10 :semaphore status of apps_nw_semaphore6 9:8 :semaphore status of apps_nw_semaphore5 7:6 :semaphore status of apps_nw_semaphore4 5:4 :semaphore status of apps_nw_semaphore3 3:2 :semaphore status of apps_nw_semaphore2 1:0 :semaphore status of apps_nw_semaphore1</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE_PREV_OWNER1</name>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <description>SEMAPHORE_PREV_OWNER1</description>
          <fields>
            <field>
              <name>SEMAPHORE_PREV_OWNER1</name>
              <description>[17:0] 1:0 : prvious owner of i2c_properties_reg[1:0] 3:2 : prvious owner of spi_properties_reg[1:0] 5:4 : prvious owner of gpio_properties_reg[1:0] 9:8 : prvious owner of gpio_properties_reg[3:2] 11:10 : prvious owner of gpio_properties_reg[5:4] 13:12 : prvious owner of gpio_properties_reg[7:6] 15:14 : prvious owner of gpio_properties_reg[9:8] 17:16 : prvious owner of flash_control_reg[1:0]</description>
              <bitWidth>18</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE_PREV_OWNER2</name>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <description>SEMAPHORE_PREV_OWNER2</description>
          <fields>
            <field>
              <name>SEMAPHORE_PREV_OWNER2</name>
              <description>[23:0] 1:0 : previous owner of apps_nw_semaphore1_reg[1:0] 3:2 : previous owner of apps_nw_semaphore2_reg[1:0] 5:4 : previous owner of apps_nw_semaphore3_reg[1:0] 7:6 : previous owner of apps_nw_semaphore4_reg[1:0] 9:8 : previous owner of apps_nw_semaphore5_reg[1:0] 11:10 : previous owner of apps_nw_semaphore6_reg[1:0] 13:12 : previous owner of apps_nw_semaphore7_reg[1:0] 15:14 : previous owner of apps_nw_semaphore8_reg[1:0] 17:16 : previous owner of apps_nw_semaphore9_reg[1:0] 19:18 : previous owner of apps_nw_semaphore10_reg[1:0] 21:20 : previous owner of apps_nw_semaphore11_reg[1:0] 23:22 : previous owner of apps_nw_semaphore12_reg[1:0]</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
