jbuonagurio/fanboard/svd/CC32xxSF.svd
        <register>
          <name>DATA</name>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <description>Data Register This register is the 32-bit entry point of the buffer for read or write data transfers. The buffer size is 32bits x256(1024 bytes). Bytes within a word are stored and read in little endian format. This buffer can be used as two 512 byte buffers to transfer data efficiently without reducing the throughput. Sequential and contiguous access is necessary to increment the pointer correctly. Random or skipped access is not allowed. In little endian if the local host accesses this register byte-wise or 16bit-wise the least significant byte (bits [7:0]) must always be written/read first. The update of the buffer address is done on the most significant byte write for full 32-bit DATA register or on the most significant byte of the last word of block transfer. Example 1: Byte or 16-bit access Mbyteen[3:0]=0001 (1-byte) => Mbyteen[3:0]=0010 (1-byte) => Mbyteen[3:0]=1100 (2-bytes) OK Mbyteen[3:0]=0001 (1-byte) => Mbyteen[3:0]=0010 (1-byte) => Mbyteen[3:0]=0100 (1-byte) OK Mbyteen[3:0]=0001 (1-byte) => Mbyteen[3:0]=0010 (1-byte) => Mbyteen[3:0]=1000 (1-byte) Bad</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PSTATE</name>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <description>Present state register The Host can get status of the Host Controller from this 32-bit read only register.</description>
          <fields>
            <field>
              <name>DLEV</name>
              <description>[23:20] DAT[3:0] line signal level DAT[3] => bit 23 DAT[2] => bit 22 DAT[1] => bit 21 DAT[0] => bit 20 This status is used to check DAT line level to recover from errors and for debugging. This is especially useful in detecting the busy signal level from DAT[0]. The value of these registers after reset depends on the DAT lines level at that time.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HCTL</name>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <description>Control register This register defines the host controls to set power wakeup and transfer parameters. MMCHS_HCTL[31:24] = Wakeup control MMCHS_HCTL[23:16] = Block gap control MMCHS_HCTL[15:8] = Power control MMCHS_HCTL[7:0] = Host control</description>
          <fields>
            <field>
              <name>SDVS</name>
              <description>[11:9] SD bus voltage select All cards. The host driver should set to these bits to select the voltage level for the card according to the voltage supported by the system (MMCHS_CAPA[VS18VS30VS33]) before starting a transfer. 0x5 1.8V (Typical) 0x6 3.0V (Typical) 0x7 3.3V (Typical)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DMAS</name>
              <description>[4:3] DMA Select Mode: One of supported DMA modes can be selected. The host driver shall check support of DMA modes by referring the Capabilities register. Use of selected DMA is determined by DMA Enable of the Transfer Mode register. This register is only meaningful when MADMA_EN is set to 1. When MADMA_EN is set to 0 the bit field is read only and returned value is 0. 0x0 Reserved 0x1 Reserved 0x2 32-bit Address ADMA2 is selected 0x3 Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSCTL</name>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <description>SD system control register This register defines the system controls to set software resets clock frequency management and data timeout. MMCHS_SYSCTL[31:24] = Software resets MMCHS_SYSCTL[23:16] = Timeout control MMCHS_SYSCTL[15:0] = Clock control</description>
          <fields>
            <field>
              <name>DTO</name>
              <description>[19:16] Data timeout counter value and busy timeout. This value determines the interval by which DAT lines timeouts are detected. The host driver needs to set this bitfield based on - the maximum read access time (NAC) (Refer to the SD Specification Part1 Physical Layer) - the data read access time values (TAAC and NSAC) in the card specific data register (CSD) of the card - the timeout clock base frequency (MMCHS_CAPA[TCF]). If the card does not respond within the specified number of cycles a data timeout error occurs (MMCHS_STA[DTO]). The MMCHS_SYSCTL[DTO] register is also used to check busy duration to generate busy timeout for commands with busy response or for busy programming during a write command. Timeout on CRC status is generated if no CRC token is present after a block write. 0x0 TCF x 2^13 0x1 TCF x 2^14 0xE TCF x 2^27 0xF Reserved</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>CLKD</name>
              <description>[15:6] Clock frequency select These bits define the ratio between a reference clock frequency (system dependant) and the output clock frequency on the CLK pin of either the memory card (MMC SD or SDIO). 0x000 Clock Ref bypass 0x001 Clock Ref bypass 0x002 Clock Ref / 2 0x003 Clock Ref / 3 0x3FF Clock Ref / 1023</description>
              <bitWidth>10</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>STAT</name>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <description>Interrupt status register The interrupt status regroups all the status of the module internal events that can generate an interrupt. MMCHS_STAT[31:16] = Error Interrupt Status MMCHS_STAT[15:0] = Normal Interrupt Status</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IE</name>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <description>Interrupt SD enable register This register allows to enable/disable the module to set status bits on an event-by-event basis. MMCHS_IE[31:16] = Error Interrupt Status Enable MMCHS_IE[15:0] = Normal Interrupt Status Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ISE</name>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <description>Interrupt signal enable register This register allows to enable/disable the module internal sources of status on an event-by-event basis. MMCHS_ISE[31:16] = Error Interrupt Signal Enable MMCHS_ISE[15:0] = Normal Interrupt Signal Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AC12</name>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <description>Auto CMD12 Error Status Register The host driver may determine which of the errors cases related to Auto CMD12 has occurred by checking this MMCHS_AC12 register when an Auto CMD12 Error interrupt occurs. This register is valid only when Auto CMD12 is enabled (MMCHS_CMD[ACEN]) and Auto CMD12Error (MMCHS_STAT[ACE]) is set to 1. Note: These bits are automatically reset when starting a new adtc command with data.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CAPA</name>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <description>Capabilities register This register lists the capabilities of the MMC/SD/SDIO host controller.</description>
          <fields>
            <field>
              <name>MBL</name>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>BCF</name>
              <bitWidth>6</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TCF</name>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CUR_CAPA</name>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <description>Maximum current capabilities Register This register indicates the maximum current capability for each voltage. The value is meaningful if the voltage support is set in the capabilities register (MMCHS_CAPA). Initialization of this register (via a write access to this register) depends on the system capabilities. The host driver shall not modify this register after the initilaization. This register is only reinitialized by a hard reset (via RESETN signal)</description>
          <fields>
            <field>
              <name>CUR_1V8</name>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>CUR_3V0</name>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CUR_3V3</name>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FE</name>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <description>Force Event Register for Error Interrupt status The force Event Register is not a physically implemented register. Rather it is an address at which the Error Interrupt Status register can be written. The effect of a write to this address will be reflected in the Error Interrupt Status Register if corresponding bit of the Error Interrupt Status Enable Register is set.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADMAES</name>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <description>ADMA Error Status Register When ADMA Error Interrupt is occurred the ADMA Error States field in this register holds the ADMA state and the ADMA System Address Register holds the address around the error descriptor. For recovering the error the Host Driver requires the ADMA state to identify the error descriptor address as follows: ST_STOP: Previous location set in the ADMA System Address register is the error descriptor address ST_FDS: Current location set in the ADMA System Address register is the error descriptor address ST_CADR: This sate is never set because do not generate ADMA error in this state. ST_TFR: Previous location set in the ADMA System Address register is the error descriptor address In case of write operation the Host Driver should use ACMD22 to get the number of written block rather than using this information since unwritten data may exist in the Host Controller. The Host Controller generates the ADMA Error Interrupt when it detects invalid descriptor data (Valid=0) at the ST_FDS state. In this case ADMA Error State indicates that an error occurs at ST_FDS state. The Host Driver may find that the Valid bit is not set in the error descriptor.</description>
          <fields>
            <field>
              <name>AES</name>
              <description>[1:0] ADMA Error State his field indicates the state of ADMA when error is occurred during ADMA data transfer. &amp;quot;This field never indicates &amp;quot;&amp;quot;10&amp;quot;&amp;quot; because ADMA never stops in this state.&amp;quot; 0x0 ST_STOP (Stop DMA)Contents of SYS_SDR register 0x1 ST_STOP (Stop DMA)Points the error descriptor 0x2 Never set this state(Not used) 0x3 ST_TFR (Transfer Data)Points the next of the error descriptor</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADMASAL</name>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <description>ADMA System address Low bits</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REV</name>
          <addressOffset>0x2FC</addressOffset>
          <size>32</size>
          <description>Versions Register This register contains the hard coded RTL vendor revision number the version number of SD specification compliancy and a slot status bit. MMCHS_REV[31:16] = Host controller version MMCHS_REV[15:0] = Slot Interrupt Status ****************************************************************************</description>
          <fields>
            <field>
              <name>VREV</name>
              <description>[31:24] Vendor Version Number: IP revision [7:4] Major revision [3:0] Minor revision Examples: 0x10 for 1.0 0x21 for 2.1</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>SREV</name>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
