jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UDMA</name>
      <baseAddress>0x400FF000</baseAddress>
      <registers>
        <register>
          <name>STAT</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>STAT</description>
          <fields>
            <field>
              <name>DMACHANS</name>
              <description>[20:16] Available uDMA Channels Minus 1</description>
              <bitWidth>5</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>STATE</name>
              <description>[7:4] Control State Machine Status 0x00000090 : UDMA_STAT_STATE_DONE : Done 0x00000000 : UDMA_STAT_STATE_IDLE : Idle 0x00000010 : UDMA_STAT_STATE_RD_CTRL : Reading channel controller data 0x00000030 : UDMA_STAT_STATE_RD_DSTENDP : Reading destination end pointer 0x00000040 : UDMA_STAT_STATE_RD_SRCDAT : Reading source data 0x00000020 : UDMA_STAT_STATE_RD_SRCENDP : Reading source end pointer 0x00000080 : UDMA_STAT_STATE_STALL : Stalled 0x000000A0 : UDMA_STAT_STATE_UNDEF : Undefined 0x00000060 : UDMA_STAT_STATE_WAIT : Waiting for uDMA request to clear 0x00000070 : UDMA_STAT_STATE_WR_CTRL : Writing channel controller data 0x00000050 : UDMA_STAT_STATE_WR_DSTDAT : Writing destination data</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CFG</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>CFG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTLBASE</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>CTLBASE</description>
          <fields>
            <field>
              <name>ADDR</name>
              <description>[31:10] Channel Control Base Address</description>
              <bitWidth>22</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ALTBASE</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>ALTBASE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WAITSTAT</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>WAITSTAT</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SWREQ</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>SWREQ</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>USEBURSTSET</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>USEBURSTSET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>USEBURSTCLR</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>USEBURSTCLR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REQMASKSET</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>REQMASKSET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REQMASKCLR</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>REQMASKCLR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ENASET</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>ENASET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ENACLR</name>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <description>ENACLR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ALTSET</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>ALTSET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ALTCLR</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>ALTCLR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRIOSET</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>PRIOSET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRIOCLR</name>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <description>PRIOCLR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ERRCLR</name>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <description>ERRCLR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHASGN</name>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <description>CHASGN</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHIS</name>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <description>CHIS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHMAP0</name>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <description>CHMAP0</description>
          <fields>
            <field>
              <name>CH7SEL</name>
              <description>[31:28] uDMA Channel 7 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>CH6SEL</name>
              <description>[27:24] uDMA Channel 6 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>CH5SEL</name>
              <description>[23:20] uDMA Channel 5 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>CH4SEL</name>
              <description>[19:16] uDMA Channel 4 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>CH3SEL</name>
              <description>[15:12] uDMA Channel 3 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>CH2SEL</name>
              <description>[11:8] uDMA Channel 2 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CH1SEL</name>
              <description>[7:4] uDMA Channel 1 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CH0SEL</name>
              <description>[3:0] uDMA Channel 0 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHMAP1</name>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <description>CHMAP1</description>
          <fields>
            <field>
              <name>CH15SEL</name>
              <description>[31:28] uDMA Channel 15 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>CH14SEL</name>
              <description>[27:24] uDMA Channel 14 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>CH13SEL</name>
              <description>[23:20] uDMA Channel 13 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>CH12SEL</name>
              <description>[19:16] uDMA Channel 12 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>CH11SEL</name>
              <description>[15:12] uDMA Channel 11 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>CH10SEL</name>
              <description>[11:8] uDMA Channel 10 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CH9SEL</name>
              <description>[7:4] uDMA Channel 9 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CH8SEL</name>
              <description>[3:0] uDMA Channel 8 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHMAP2</name>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <description>CHMAP2</description>
          <fields>
            <field>
              <name>CH23SEL</name>
              <description>[31:28] uDMA Channel 23 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>CH22SEL</name>
              <description>[27:24] uDMA Channel 22 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>CH21SEL</name>
              <description>[23:20] uDMA Channel 21 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>CH20SEL</name>
              <description>[19:16] uDMA Channel 20 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>CH19SEL</name>
              <description>[15:12] uDMA Channel 19 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>CH18SEL</name>
              <description>[11:8] uDMA Channel 18 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CH17SEL</name>
              <description>[7:4] uDMA Channel 17 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CH16SEL</name>
              <description>[3:0] uDMA Channel 16 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHMAP3</name>
          <addressOffset>0x51C</addressOffset>
          <size>32</size>
          <description>CHMAP3</description>
          <fields>
            <field>
              <name>CH31SEL</name>
              <description>[31:28] uDMA Channel 31 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>CH30SEL</name>
              <description>[27:24] uDMA Channel 30 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>CH29SEL</name>
              <description>[23:20] uDMA Channel 29 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>CH28SEL</name>
              <description>[19:16] uDMA Channel 28 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>CH27SEL</name>
              <description>[15:12] uDMA Channel 27 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>CH26SEL</name>
              <description>[11:8] uDMA Channel 26 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CH25SEL</name>
              <description>[7:4] uDMA Channel 25 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CH24SEL</name>
              <description>[3:0] uDMA Channel 24 Source Select</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PV</name>
          <addressOffset>0xFB0</addressOffset>
          <size>32</size>
          <description>PV</description>
          <fields>
            <field>
              <name>MAJOR</name>
              <description>[15:8] Major Revision</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MINOR</name>
              <description>[7:0] Minor Revision</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
