jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CAMERA</name>
      <baseAddress>0x44018000</baseAddress>
      <registers>
        <register>
          <name>CC_REVISION</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>This register contains the IP revision code ( Parallel Mode)</description>
          <fields>
            <field>
              <name>REV</name>
              <description>[7:0] IP revision [7:4] Major revision [3:0] Minor revision Examples: 0x10 for 1.0 0x21 for 2.1</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC_SYSCONFIG</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>This register controls the various parameters of the OCP interface (CCP and Parallel Mode)</description>
          <fields>
            <field>
              <name>S_IDLE_MODE</name>
              <description>[4:3] Slave interface power management req/ack control &amp;quot;&amp;quot;&amp;quot;00&amp;quot;&amp;quot; Force-idle. An idle request is acknoledged unconditionally&amp;quot; &amp;quot;&amp;quot;&amp;quot;01&amp;quot;&amp;quot; No-idle. An idle request is never acknowledged&amp;quot; &amp;quot;&amp;quot;&amp;quot;10&amp;quot;&amp;quot; reserved (Smart-idle not implemented)&amp;quot;</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC_SYSSTATUS</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>This register provides status information about the module excluding the interrupt status information (CCP and Parallel Mode)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC_IRQSTATUS</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>The interrupt status regroups all the status of the module internal events that can generate an interrupt (CCP &amp; Parallel Mode)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC_IRQENABLE</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>The interrupt enable register allows to enable/disable the module internal sources of interrupt on an event-by-event basis (CCP &amp; Parallel Mode)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC_CTRL</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>This register controls the various parameters of the Camera Core block (CCP &amp; Parallel Mode)</description>
          <fields>
            <field>
              <name>PAR_MODE</name>
              <description>[3:1] Sets the Protocol Mode of the Camera Core module in parallel mode (when CCP_MODE = 0) &amp;quot;&amp;quot;&amp;quot;000&amp;quot;&amp;quot; Parallel NOBT 8-bit&amp;quot; &amp;quot;&amp;quot;&amp;quot;001&amp;quot;&amp;quot; Parallel NOBT 10-bit&amp;quot; &amp;quot;&amp;quot;&amp;quot;010&amp;quot;&amp;quot; Parallel NOBT 12-bit&amp;quot; &amp;quot;&amp;quot;&amp;quot;011&amp;quot;&amp;quot; reserved&amp;quot; &amp;quot;&amp;quot;&amp;quot;100&amp;quot;&amp;quot; Parallet BT 8-bit&amp;quot; &amp;quot;&amp;quot;&amp;quot;101&amp;quot;&amp;quot; Parallel BT 10-bit&amp;quot; &amp;quot;&amp;quot;&amp;quot;110&amp;quot;&amp;quot; reserved&amp;quot; &amp;quot;&amp;quot;&amp;quot;111&amp;quot;&amp;quot; FIFO test mode. Refer to Table 12 - FIFO Write and Read access&amp;quot;</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC_CTRL_DMA</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>This register controls the DMA interface of the Camera Core block (CCP &amp; Parallel Mode)</description>
          <fields>
            <field>
              <name>FIFO_THRESHOLD</name>
              <description>[6:0] Sets the threshold of the FIFO the assertion of the dmarequest line takes place when the threshold is reached. &amp;quot;&amp;quot;&amp;quot;0000000&amp;quot;&amp;quot; threshold set to 1&amp;quot; &amp;quot;&amp;quot;&amp;quot;0000001&amp;quot;&amp;quot; threshold set to 2&amp;quot;  &amp;quot;&amp;quot;&amp;quot;1111111&amp;quot;&amp;quot; threshold set to 128&amp;quot;</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC_CTRL_XCLK</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>This register control the value of the clock divisor used to generate the external clock (Parallel Mode)</description>
          <fields>
            <field>
              <name>XCLK_DIV</name>
              <description>[4:0] Sets the clock divisor value for CAM_XCLK generation. based on CAM_MCK (value of CAM_MCLK is 96MHz) &amp;quot;&amp;quot;&amp;quot;00000&amp;quot;&amp;quot; CAM_XCLK Stable Low Level&amp;quot; Divider not enabled &amp;quot;&amp;quot;&amp;quot;00001&amp;quot;&amp;quot; CAM_XCLK Stable High Level&amp;quot; Divider not enabled from 2 to 30 CAM_XCLK = CAM_MCLK / XCLK_DIV &amp;quot;&amp;quot;&amp;quot;11111&amp;quot;&amp;quot; Bypass - CAM_XCLK = CAM_MCLK&amp;quot;</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC_FIFO_DATA</name>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <description>This register allows to write to the FIFO and read from the FIFO (CCP &amp; Parallel Mode)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC_TEST</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>This register shows the status of some important variables of the camera core module (CCP &amp; Parallel Mode)</description>
          <fields>
            <field>
              <name>FIFO_RD_POINTER</name>
              <description>[31:24] FIFO READ Pointer This field shows the value of the FIFO read pointer Expected value ranges from 0 to 127</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>FIFO_WR_POINTER</name>
              <description>[23:16] FIFO WRITE pointer This field shows the value of the FIFO write pointer Expected value ranges from 0 to 127</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>FIFO_LEVEL</name>
              <description>[15:8] FIFO level (how many 32-bit words the FIFO contains) This field shows the value of the FIFO level and can assume values from 0 to 128</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>FIFO_LEVEL_PEAK</name>
              <description>[7:0] FIFO level peak This field shows the max value of the FIFO level and can assume values from 0 to 128</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC_GEN_PAR</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>This register shows the values of the generic parameters of the module ****************************************************************************</description>
          <fields>
            <field>
              <name>CC_FIFO_DEPTH</name>
              <description>[2:0] Camera Core FIFO DEPTH generic parameter</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
