jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I2S</name>
      <baseAddress>0x4401C000</baseAddress>
      <registers>
        <register>
          <name>PID</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>PID</description>
          <fields>
            <field>
              <name>SCHEME</name>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>RESV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>FUNCTION</name>
              <description>[27:16] McASP</description>
              <bitWidth>12</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RTL</name>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>REVMAJOR</name>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CUSTOM</name>
              <description>[7:6] non-custom</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>REVMINOR</name>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ESYSCONFIG</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Power Idle SYSCONFIG register.</description>
          <fields>
            <field>
              <name>RSV</name>
              <description>[31:6] Reserved as per PDR 3.5</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>OTHER</name>
              <description>[5:2] Reserved for future expansion</description>
              <bitWidth>4</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>IDLE_MODE</name>
              <description>[1:0] Idle Mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PFUNC</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>PFUNC</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PDIR</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>PDIR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PDOUT</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>PDOUT</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PDIN_PDSET</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>The pin data input register (PDIN) holds the I/O pin state of each of the McASP pins. PDIN allows the actual value of the pin to be read regardless of the state of PFUNC and PDIR. The pin data set register (PDSET) is an alias of the pin data output register (PDOUT) for writes only. Writing a 1 to the PDSET bit sets the corresponding bit in PDOUT and if PFUNC = 1 (GPIO function) and PDIR = 1 (output) drives a logic high on the pin.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PDCLR</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>The pin data clear register (PDCLR) is an alias of the pin data output register (PDOUT) for writes only. Writing a 1 to the PDCLR bit clears the corresponding bit in PDOUT and if PFUNC = 1 (GPIO function) and PDIR = 1 (output) drives a logic low on the pin.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TLGC</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>for IODFT</description>
          <fields>
            <field>
              <name>MT</name>
              <description>[15:14] MISR on/off trigger command 0x0 0x1 0x2 0x3</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>MC</name>
              <description>[5:4] States of MISR 0x0 0x1 0x2 0x3</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PC</name>
              <description>[3:1] Pattern code 0x0 0x1 0x2 0x3 0x4 0x5 0x6 0x7</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TLMR</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>for IODFT</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TLEC</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>for IODFT</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GBLCTL</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>GBLCTL</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AMUTE</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>AMUTE</description>
          <fields>
            <field>
              <name>MUTEN</name>
              <description>[1:0] AMUTE pin enable 0x0 0x1 0x2</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LBCTL</name>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <description>LBCTL</description>
          <fields>
            <field>
              <name>MODE</name>
              <description>[3:2] Loop back clock source generator 0x0 0x1 0x2 0x3</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXDITCTL</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>TXDITCTL</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GBLCTLR</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>GBLCTLR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXMASK</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>RXMASK</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXFMT</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>RXFMT</description>
          <fields>
            <field>
              <name>RDATDLY</name>
              <description>[17:16] RCV Frame sync delay 0x0 0 Bit delay 0x1 1 Bit delay 0x2 2 Bit delay</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RPAD</name>
              <description>[14:13] Pad value 0x0 0x1 0x2</description>
              <bitWidth>2</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>RPBIT</name>
              <description>[12:8] Pad bit position</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RSSZ</name>
              <description>[7:4] RCV slot Size 0x0 0x1 0x2 0x3 0x4 0x5 0x6 0x7 0x8 0x9 0xA 0xB 0xC 0xD 0xE 0xF</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RROT</name>
              <description>[2:0] Right Rotate Value 0x0 0x1 0x2 0x3 0x4 0x5 0x6 0x7</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXFMCTL</name>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <description>RXFMCTL</description>
          <fields>
            <field>
              <name>RMOD</name>
              <description>[15:7] RCV Frame sync mode</description>
              <bitWidth>9</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ACLKRCTL</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>ACLKRCTL</description>
          <fields>
            <field>
              <name>CLKRADJ</name>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>CLKRDIV</name>
              <description>[4:0] RCV clock devide ratio</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AHCLKRCTL</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>AHCLKRCTL</description>
          <fields>
            <field>
              <name>HCLKRADJ</name>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>HCLKRDIV</name>
              <description>[11:0] RCV clock Divide Ratio</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXTDM</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>RXTDM</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EVTCTLR</name>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <description>EVTCTLR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXSTAT</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>RXSTAT</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXTDMSLOT</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>RXTDMSLOT</description>
          <fields>
            <field>
              <name>RSLOTCNT</name>
              <description>[9:0] Current RCV time slot count</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXCLKCHK</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>RXCLKCHK</description>
          <fields>
            <field>
              <name>RCNT</name>
              <description>[31:24] RCV clock count value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RMAX</name>
              <description>[23:16] RCV clock maximum boundary</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RMIN</name>
              <description>[15:8] RCV clock minimum boundary</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RPS</name>
              <description>[3:0] RCV clock check prescaler 0x0 0x1 0x2 0x3 0x4 0x5 0x6 0x7 0x8</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REVTCTL</name>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <description>REVTCTL</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GBLCTLX</name>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <description>GBLCTLX</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXMASK</name>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <description>TXMASK</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXFMT</name>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <description>TXFMT</description>
          <fields>
            <field>
              <name>XDATDLY</name>
              <description>[17:16] XMT Frame sync delay 0x0 0 Bit delay 0x1 1 Bit delay 0x2 2 Bit delay</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>XPAD</name>
              <description>[14:13] Pad value 0x0 0x1 0x2</description>
              <bitWidth>2</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>XPBIT</name>
              <description>[12:8] Pad bit position</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>XSSZ</name>
              <description>[7:4] XMT slot Size 0x0 0x1 0x2 0x3 0x4 0x5 0x6 0x7 0x8 0x9 0xA 0xB 0xC 0xD 0xE 0xF</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>XROT</name>
              <description>[2:0] Right Rotate Value 0x0 0x1 0x2 0x3 0x4 0x5 0x6 0x7</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXFMCTL</name>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <description>TXFMCTL</description>
          <fields>
            <field>
              <name>XMOD</name>
              <description>[15:7] XMT Frame sync mode</description>
              <bitWidth>9</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ACLKXCTL</name>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <description>ACLKXCTL</description>
          <fields>
            <field>
              <name>CLKXADJ</name>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>CLKXDIV</name>
              <description>[4:0] XMT clock devide ratio</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AHCLKXCTL</name>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <description>AHCLKXCTL</description>
          <fields>
            <field>
              <name>HCLKXADJ</name>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>HCLKXDIV</name>
              <description>[11:0] XMT clock Divide Ratio</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXTDM</name>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <description>TXTDM</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EVTCTLX</name>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <description>EVTCTLX</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXSTAT</name>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <description>TXSTAT</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXTDMSLOT</name>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <description>TXTDMSLOT</description>
          <fields>
            <field>
              <name>XSLOTCNT</name>
              <description>[9:0] Current XMT time slot count during reset the value of this register is 0b0101111111 (0x17f) and after reset 0</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXCLKCHK</name>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <description>TXCLKCHK</description>
          <fields>
            <field>
              <name>XCNT</name>
              <description>[31:24] XMT clock count value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>XMAX</name>
              <description>[23:16] XMT clock maximum boundary</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>XMIN</name>
              <description>[15:8] XMT clock minimum boundary</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>XPS</name>
              <description>[3:0] XMT clock check prescaler 0x0 0x1 0x2 0x3 0x4 0x5 0x6 0x7 0x8</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XEVTCTL</name>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <description>XEVTCTL</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CLKADJEN</name>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <description>CLKADJEN</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITCSRA0</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>DITCSRA0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITCSRA1</name>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <description>DITCSRA1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITCSRA2</name>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <description>DITCSRA2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITCSRA3</name>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <description>DITCSRA3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITCSRA4</name>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <description>DITCSRA4</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITCSRA5</name>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <description>DITCSRA5</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITCSRB0</name>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <description>DITCSRB0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITCSRB1</name>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <description>DITCSRB1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITCSRB2</name>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <description>DITCSRB2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITCSRB3</name>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <description>DITCSRB3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITCSRB4</name>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <description>DITCSRB4</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITCSRB5</name>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <description>DITCSRB5</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITUDRA0</name>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <description>DITUDRA0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITUDRA1</name>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <description>DITUDRA1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITUDRA2</name>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <description>DITUDRA2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITUDRA3</name>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <description>DITUDRA3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITUDRA4</name>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <description>DITUDRA4</description>
          <resetValue>0</resetValue>
        </register>
