jbuonagurio/fanboard/svd/CC32xxSF.svd
        <register>
          <name>DITUDRA5</name>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <description>DITUDRA5</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITUDRB0</name>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <description>DITUDRB0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITUDRB1</name>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <description>DITUDRB1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITUDRB2</name>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <description>DITUDRB2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITUDRB3</name>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <description>DITUDRB3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITUDRB4</name>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <description>DITUDRB4</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DITUDRB5</name>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <description>DITUDRB5</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL0</name>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <description>XRSRCTL0</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL1</name>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <description>XRSRCTL1</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL2</name>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <description>XRSRCTL2</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL3</name>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <description>XRSRCTL3</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL4</name>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <description>XRSRCTL4</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL5</name>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <description>XRSRCTL5</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL6</name>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <description>XRSRCTL6</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL7</name>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <description>XRSRCTL7</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL8</name>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <description>XRSRCTL8</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL9</name>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <description>XRSRCTL9</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL10</name>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <description>XRSRCTL10</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL11</name>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <description>XRSRCTL11</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL12</name>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <description>XRSRCTL12</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL13</name>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <description>XRSRCTL13</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL14</name>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <description>XRSRCTL14</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XRSRCTL15</name>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <description>XRSRCTL15</description>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>[3:2] Serializer drive state 0x0 Tri state 0x1 Reserved 0x2 Drive pin low 0x3 Drive pin high</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SRMOD</name>
              <description>[1:0] Serializer Mode 0x0 InActive mode 0x1 Transmit mode 0x2 Receive mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF0</name>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <description>TXBUF0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF1</name>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <description>TXBUF1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF2</name>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <description>TXBUF2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF3</name>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <description>TXBUF3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF4</name>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <description>TXBUF4</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF5</name>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <description>TXBUF5</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF6</name>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <description>TXBUF6</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF7</name>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <description>TXBUF7</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF8</name>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <description>TXBUF8</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF9</name>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <description>TXBUF9</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF10</name>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <description>TXBUF10</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF11</name>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <description>TXBUF11</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF12</name>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <description>TXBUF12</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF13</name>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <description>TXBUF13</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF14</name>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <description>TXBUF14</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXBUF15</name>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <description>TXBUF15</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF0</name>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <description>RXBUF0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF1</name>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <description>RXBUF1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF2</name>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <description>RXBUF2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF3</name>
          <addressOffset>0x28C</addressOffset>
          <size>32</size>
          <description>RXBUF3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF4</name>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <description>RXBUF4</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF5</name>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <description>RXBUF5</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF6</name>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <description>RXBUF6</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF7</name>
          <addressOffset>0x29C</addressOffset>
          <size>32</size>
          <description>RXBUF7</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF8</name>
          <addressOffset>0x2A0</addressOffset>
          <size>32</size>
          <description>RXBUF8</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF9</name>
          <addressOffset>0x2A4</addressOffset>
          <size>32</size>
          <description>RXBUF9</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF10</name>
          <addressOffset>0x2A8</addressOffset>
          <size>32</size>
          <description>RXBUF10</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF11</name>
          <addressOffset>0x2AC</addressOffset>
          <size>32</size>
          <description>RXBUF11</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF12</name>
          <addressOffset>0x2B0</addressOffset>
          <size>32</size>
          <description>RXBUF12</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF13</name>
          <addressOffset>0x2B4</addressOffset>
          <size>32</size>
          <description>RXBUF13</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF14</name>
          <addressOffset>0x2B8</addressOffset>
          <size>32</size>
          <description>RXBUF14</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RXBUF15</name>
          <addressOffset>0x2BC</addressOffset>
          <size>32</size>
          <description>RXBUF15</description>
          <resetValue>0</resetValue>
        </register>
