jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SSPI</name>
      <baseAddress>0x44020000</baseAddress>
      <registers>
        <register>
          <name>HL_REV</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>IP Revision Identifier (X.Y.R) Used by software to track features bugs and compatibility</description>
          <fields>
            <field>
              <name>SCHEME</name>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>RSVD</name>
              <description>[29:28] Reserved These bits are initialized to zero and writes to them are ignored.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>FUNC</name>
              <description>[27:16] Function indicates a software compatible module family. If there is no level of software compatibility a new Func number (and hence REVISION) should be assigned.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>R_RTL</name>
              <description>[15:11] RTL Version (R) maintained by IP design owner. RTL follows a numbering such as X.Y.R.Z which are explained in this table. R changes ONLY when: (1) PDS uploads occur which may have been due to spec changes (2) Bug fixes occur (3) Resets to '0' when X or Y changes. Design team has an internal 'Z' (customer invisible) number which increments on every drop that happens due to DV and RTL updates. Z resets to 0 when R increments.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>X_MAJOR</name>
              <description>[10:8] Major Revision (X) maintained by IP specification owner. X changes ONLY when: (1) There is a major feature addition. An example would be adding Master Mode to Utopia Level2. The Func field (or Class/Type in old PID format) will remain the same. X does NOT change due to: (1) Bug fixes (2) Change in feature parameters.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CUSTOM</name>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>Y_MINOR</name>
              <description>[5:0] Minor Revision (Y) maintained by IP specification owner. Y changes ONLY when: (1) Features are scaled (up or down). Flexibility exists in that this feature scalability may either be represented in the Y change or a specific register in the IP that indicates which features are exactly available. (2) When feature creeps from Is-Not list to Is list. But this may not be the case once it sees silicon; in which case X will change. Y does NOT change due to: (1) Bug fixes (2) Typos or clarifications (3) major functional/feature change/addition/deletion. Instead these changes may be reflected via R S X as applicable. Spec owner maintains a customer-invisible number 'S' which changes due to: (1) Typos/clarifications (2) Bug documentation. Note that this bug is not due to a spec change but due to implementation. Nevertheless the spec tracks the IP bugs. An RTL release (say for silicon PG1.1) that occurs due to bug fix should document the corresponding spec number (X.Y.S) in its release notes.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HL_HWINFO</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Information about the IP module's hardware configuration i.e. typically the module's HDL generics (if any). Actual field format and encoding is up to the module's designer to decide.</description>
          <fields>
            <field>
              <name>FFNBYTE</name>
              <bitWidth>5</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HL_SYSCONFIG</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>0x4402 1010 0x4402 2010 Clock management configuration</description>
          <fields>
            <field>
              <name>IDLEMODE</name>
              <description>[3:2] Configuration of the local target state management mode. By definition target can handle read/write transaction as long as it is out of IDLE state. 0x0 Force-idle mode: local target's idle state follows (acknowledges) the system's idle requests unconditionally i.e. regardless of the IP module's internal requirements.Backup mode for debug only. 0x1 No-idle mode: local target never enters idle state.Backup mode for debug only. 0x2 Smart-idle mode: local target's idle state eventually follows (acknowledges) the system's idle requests depending on the IP module's internal requirements.IP module shall not generate (IRQ- or DMA-request-related) wakeup events. 0x3 &amp;quot;Smart-idle wakeup-capable mode: local target's idle state eventually follows (acknowledges) the system's idle requests depending on the IP module's internal requirements.IP module may generate (IRQ- or DMA-request-related) wakeup events when in idle state.Mode is only relevant if the appropriate IP module &amp;quot;&amp;quot;swakeup&amp;quot;&amp;quot; output(s) is (are) implemented.&amp;quot;</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REVISION</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>0x4402 1100 0x4402 2100 This register contains the hard coded RTL revision number.</description>
          <fields>
            <field>
              <name>REV</name>
              <description>[7:0] IP revision [7:4] Major revision [3:0] Minor revision Examples: 0x10 for 1.0 0x21 for 2.1</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSCONFIG</name>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <description>0x4402 1110 0x4402 2110 This register allows controlling various parameters of the OCP interface.</description>
          <fields>
            <field>
              <name>CLOCKACTIVITY</name>
              <description>[9:8] Clocks activity during wake up mode period 0x0 OCP and Functional clocks may be switched off. 0x1 OCP clock is maintained. Functional clock may be switched-off. 0x2 Functional clock is maintained. OCP clock may be switched-off. 0x3 OCP and Functional clocks are maintained.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SIDLEMODE</name>
              <description>[4:3] Power management 0x0 If an idle request is detected the McSPI acknowledges it unconditionally and goes in Inactive mode. Interrupt DMA requests and wake up lines are unconditionally de-asserted and the module wakeup capability is deactivated even if the bit MCSPI_SYSCONFIG[EnaWakeUp] is set. 0x1 If an idle request is detected the request is ignored and the module does not switch to wake up mode and keeps on behaving normally. 0x2 If an idle request is detected the module will switch to idle mode based on its internal activity. The wake up capability cannot be used. 0x3 If an idle request is detected the module will switch to idle mode based on its internal activity and the wake up capability can be used if the bit MCSPI_SYSCONFIG[EnaWakeUp] is set.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSSTATUS</name>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <description>0x4402 1114 0x4402 2114 This register provides status information about the module excluding the interrupt status information</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IRQSTATUS</name>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <description>0x4402 1118 0x4402 2118 The interrupt status regroups all the status of the module internal events that can generate an interrupt</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IRQENABLE</name>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <description>0x4402 111C 0x4402 211C This register allows to enable/disable the module internal sources of interrupt on an event-by-event basis.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WAKEUPENABLE</name>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <description>0x4402 1120 0x4402 2120 The wakeup enable register allows to enable/disable the module internal sources of wakeup on event-by-event basis.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYST</name>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <description>0x4402 1124 0x4402 2124 This register is used to check the correctness of the system interconnect either internally to peripheral bus or externally to device IO pads when the module is configured in system test (SYSTEST) mode.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MODULCTRL</name>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <description>0x4402 1128 0x4402 2128 This register is dedicated to the configuration of the serial port interface.</description>
          <fields>
            <field>
              <name>INITDLY</name>
              <description>[6:4] Initial spi delay for first transfer: This register is an option only available in SINGLE master mode The controller waits for a delay to transmit the first spi word after channel enabled and corresponding TX register filled. This Delay is based on SPI output frequency clock No clock output provided to the boundary and chip select is not active in 4 pin mode within this period. 0x0 No delay for first spi transfer. 0x1 The controller wait 4 spi bus clock 0x2 The controller wait 8 spi bus clock 0x3 The controller wait 16 spi bus clock 0x4 The controller wait 32 spi bus clock</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH0CONF</name>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <description>0x4402 112C 0x4402 212C This register is dedicated to the configuration of the channel 0</description>
          <fields>
            <field>
              <name>TCS0</name>
              <description>[26:25] Chip Select Time Control This 2-bits field defines the number of interface clock cycles between CS toggling and first or last edge of SPI clock. 0x0 0.5 clock cycle 0x1 1.5 clock cycle 0x2 2.5 clock cycle 0x3 3.5 clock cycle</description>
              <bitWidth>2</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>SPIENSLV</name>
              <description>[22:21] Channel 0 only and slave mode only: SPI slave select signal detection. Reserved bits for other cases. 0x0 Detection enabled only on SPIEN[0] 0x1 Detection enabled only on SPIEN[1] 0x2 Detection enabled only on SPIEN[2] 0x3 Detection enabled only on SPIEN[3]</description>
              <bitWidth>2</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>TRM</name>
              <description>[13:12] Transmit/Receive modes 0x0 Transmit and Receive mode 0x1 Receive only mode 0x2 Transmit only mode 0x3 Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>WL</name>
              <description>[11:7] SPI word length 0x00 Reserved 0x01 Reserved 0x02 Reserved 0x03 The SPI word is 4-bits long 0x04 The SPI word is 5-bits long 0x05 The SPI word is 6-bits long 0x06 The SPI word is 7-bits long 0x07 The SPI word is 8-bits long 0x08 The SPI word is 9-bits long 0x09 The SPI word is 10-bits long 0x0A The SPI word is 11-bits long 0x0B The SPI word is 12-bits long 0x0C The SPI word is 13-bits long 0x0D The SPI word is 14-bits long 0x0E The SPI word is 15-bits long 0x0F The SPI word is 16-bits long 0x10 The SPI word is 17-bits long 0x11 The SPI word is 18-bits long 0x12 The SPI word is 19-bits long 0x13 The SPI word is 20-bits long 0x14 The SPI word is 21-bits long 0x15 The SPI word is 22-bits long 0x16 The SPI word is 23-bits long 0x17 The SPI word is 24-bits long 0x18 The SPI word is 25-bits long 0x19 The SPI word is 26-bits long 0x1A The SPI word is 27-bits long 0x1B The SPI word is 28-bits long 0x1C The SPI word is 29-bits long 0x1D The SPI word is 30-bits long 0x1E The SPI word is 31-bits long 0x1F The SPI word is 32-bits long</description>
              <bitWidth>5</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>CLKD</name>
              <description>[5:2] Frequency divider for SPICLK. (only when the module is a Master SPI device). A programmable clock divider divides the SPI reference clock (CLKSPIREF) with a 4-bit value and results in a new clock SPICLK available to shift-in and shift-out data. By default the clock divider ratio has a power of two granularity when MCSPI_CHCONF[CLKG] is cleared Otherwise this register is the 4 LSB bit of a 12-bit register concatenated with clock divider extension MCSPI_CHCTRL[EXTCLK] register.The value description below defines the clock ratio when MCSPI_CHCONF[CLKG] is set to 0. 0x0 1 0x1 2 0x2 4 0x3 8 0x4 16 0x5 32 0x6 64 0x7 128 0x8 256 0x9 512 0xA 1024 0xB 2048 0xC 4096 0xD 8192 0xE 16384 0xF 32768</description>
              <bitWidth>4</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH0STAT</name>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <description>0x4402 1130 0x4402 2130 This register provides status information about transmitter and receiver registers of channel 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH0CTRL</name>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <description>0x4402 1134 0x4402 2134 This register is dedicated to enable the channel 0</description>
          <fields>
            <field>
              <name>EXTCLK</name>
              <description>[15:8] Clock ratio extension: This register is used to concatenate with MCSPI_CHCONF[CLKD] register for clock ratio only when granularity is one clock cycle (MCSPI_CHCONF[CLKG] set to 1). Then the max value reached is 4096 clock divider ratio. 0x00 Clock ratio is CLKD + 1 0x01 Clock ratio is CLKD + 1 + 16 0xFF Clock ratio is CLKD + 1 + 4080</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TX0</name>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <description>0x4402 1138 0x4402 2138 This register contains a single SPI word to transmit on the serial link what ever SPI word length is.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RX0</name>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <description>0x4402 113C 0x4402 213C This register contains a single SPI word received through the serial link what ever SPI word length is.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH1CONF</name>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <description>0x4402 1140 0x4402 2140 This register is dedicated to the configuration of the channel.</description>
          <fields>
            <field>
              <name>TCS1</name>
              <description>[26:25] Chip Select Time Control This 2-bits field defines the number of interface clock cycles between CS toggling and first or last edge of SPI clock. 0x0 0.5 clock cycle 0x1 1.5 clock cycle 0x2 2.5 clock cycle 0x3 3.5 clock cycle</description>
              <bitWidth>2</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>TRM</name>
              <description>[13:12] Transmit/Receive modes 0x0 Transmit and Receive mode 0x1 Receive only mode 0x2 Transmit only mode 0x3 Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>WL</name>
              <description>[11:7] SPI word length 0x00 Reserved 0x01 Reserved 0x02 Reserved 0x03 The SPI word is 4-bits long 0x04 The SPI word is 5-bits long 0x05 The SPI word is 6-bits long 0x06 The SPI word is 7-bits long 0x07 The SPI word is 8-bits long 0x08 The SPI word is 9-bits long 0x09 The SPI word is 10-bits long 0x0A The SPI word is 11-bits long 0x0B The SPI word is 12-bits long 0x0C The SPI word is 13-bits long 0x0D The SPI word is 14-bits long 0x0E The SPI word is 15-bits long 0x0F The SPI word is 16-bits long 0x10 The SPI word is 17-bits long 0x11 The SPI word is 18-bits long 0x12 The SPI word is 19-bits long 0x13 The SPI word is 20-bits long 0x14 The SPI word is 21-bits long 0x15 The SPI word is 22-bits long 0x16 The SPI word is 23-bits long 0x17 The SPI word is 24-bits long 0x18 The SPI word is 25-bits long 0x19 The SPI word is 26-bits long 0x1A The SPI word is 27-bits long 0x1B The SPI word is 28-bits long 0x1C The SPI word is 29-bits long 0x1D The SPI word is 30-bits long 0x1E The SPI word is 31-bits long 0x1F The SPI word is 32-bits long</description>
              <bitWidth>5</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>CLKD</name>
              <description>[5:2] Frequency divider for SPICLK. (only when the module is a Master SPI device). A programmable clock divider divides the SPI reference clock (CLKSPIREF) with a 4-bit value and results in a new clock SPICLK available to shift-in and shift-out data. By default the clock divider ratio has a power of two granularity when MCSPI_CHCONF[CLKG] is cleared Otherwise this register is the 4 LSB bit of a 12-bit register concatenated with clock divider extension MCSPI_CHCTRL[EXTCLK] register.The value description below defines the clock ratio when MCSPI_CHCONF[CLKG] is set to 0. 0x0 1 0x1 2 0x2 4 0x3 8 0x4 16 0x5 32 0x6 64 0x7 128 0x8 256 0x9 512 0xA 1024 0xB 2048 0xC 4096 0xD 8192 0xE 16384 0xF 32768</description>
              <bitWidth>4</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH1STAT</name>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <description>0x4402 1144 0x4402 2144 This register provides status information about transmitter and receiver registers of channel 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH1CTRL</name>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <description>0x4402 1148 0x4402 2148 This register is dedicated to enable the channel 1</description>
          <fields>
            <field>
              <name>EXTCLK</name>
              <description>[15:8] Clock ratio extension: This register is used to concatenate with MCSPI_CHCONF[CLKD] register for clock ratio only when granularity is one clock cycle (MCSPI_CHCONF[CLKG] set to 1). Then the max value reached is 4096 clock divider ratio. 0x00 Clock ratio is CLKD + 1 0x01 Clock ratio is CLKD + 1 + 16 0xFF Clock ratio is CLKD + 1 + 4080</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TX1</name>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <description>0x4402 114C 0x4402 214C This register contains a single SPI word to transmit on the serial link what ever SPI word length is.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RX1</name>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <description>0x4402 1150 0x4402 2150 This register contains a single SPI word received through the serial link what ever SPI word length is.</description>
          <resetValue>0</resetValue>
        </register>
