jbuonagurio/fanboard/svd/CC32xxSF.svd
        <register>
          <name>CH2CONF</name>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <description>0x4402 1154 0x4402 2154 This register is dedicated to the configuration of the channel 2</description>
          <fields>
            <field>
              <name>TCS2</name>
              <description>[26:25] Chip Select Time Control This 2-bits field defines the number of interface clock cycles between CS toggling and first or last edge of SPI clock. 0x0 0.5 clock cycle 0x1 1.5 clock cycle 0x2 2.5 clock cycle 0x3 3.5 clock cycle</description>
              <bitWidth>2</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>TRM</name>
              <description>[13:12] Transmit/Receive modes 0x0 Transmit and Receive mode 0x1 Receive only mode 0x2 Transmit only mode 0x3 Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>WL</name>
              <description>[11:7] SPI word length 0x00 Reserved 0x01 Reserved 0x02 Reserved 0x03 The SPI word is 4-bits long 0x04 The SPI word is 5-bits long 0x05 The SPI word is 6-bits long 0x06 The SPI word is 7-bits long 0x07 The SPI word is 8-bits long 0x08 The SPI word is 9-bits long 0x09 The SPI word is 10-bits long 0x0A The SPI word is 11-bits long 0x0B The SPI word is 12-bits long 0x0C The SPI word is 13-bits long 0x0D The SPI word is 14-bits long 0x0E The SPI word is 15-bits long 0x0F The SPI word is 16-bits long 0x10 The SPI word is 17-bits long 0x11 The SPI word is 18-bits long 0x12 The SPI word is 19-bits long 0x13 The SPI word is 20-bits long 0x14 The SPI word is 21-bits long 0x15 The SPI word is 22-bits long 0x16 The SPI word is 23-bits long 0x17 The SPI word is 24-bits long 0x18 The SPI word is 25-bits long 0x19 The SPI word is 26-bits long 0x1A The SPI word is 27-bits long 0x1B The SPI word is 28-bits long 0x1C The SPI word is 29-bits long 0x1D The SPI word is 30-bits long 0x1E The SPI word is 31-bits long 0x1F The SPI word is 32-bits long</description>
              <bitWidth>5</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>CLKD</name>
              <description>[5:2] Frequency divider for SPICLK. (only when the module is a Master SPI device). A programmable clock divider divides the SPI reference clock (CLKSPIREF) with a 4-bit value and results in a new clock SPICLK available to shift-in and shift-out data. By default the clock divider ratio has a power of two granularity when MCSPI_CHCONF[CLKG] is cleared Otherwise this register is the 4 LSB bit of a 12-bit register concatenated with clock divider extension MCSPI_CHCTRL[EXTCLK] register.The value description below defines the clock ratio when MCSPI_CHCONF[CLKG] is set to 0. 0x0 1 0x1 2 0x2 4 0x3 8 0x4 16 0x5 32 0x6 64 0x7 128 0x8 256 0x9 512 0xA 1024 0xB 2048 0xC 4096 0xD 8192 0xE 16384 0xF 32768</description>
              <bitWidth>4</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH2STAT</name>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <description>0x4402 1158 0x4402 2158 This register provides status information about transmitter and receiver registers of channel 2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH2CTRL</name>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <description>0x4402 115C 0x4402 215C This register is dedicated to enable the channel 2</description>
          <fields>
            <field>
              <name>EXTCLK</name>
              <description>[15:8] Clock ratio extension: This register is used to concatenate with MCSPI_CHCONF[CLKD] register for clock ratio only when granularity is one clock cycle (MCSPI_CHCONF[CLKG] set to 1). Then the max value reached is 4096 clock divider ratio. 0x00 Clock ratio is CLKD + 1 0x01 Clock ratio is CLKD + 1 + 16 0xFF Clock ratio is CLKD + 1 + 4080</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TX2</name>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <description>0x4402 1160 0x4402 2160 This register contains a single SPI word to transmit on the serial link what ever SPI word length is.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RX2</name>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <description>0x4402 1164 0x4402 2164 This register contains a single SPI word received through the serial link what ever SPI word length is.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH3CONF</name>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <description>0x4402 1168 0x4402 2168 This register is dedicated to the configuration of the channel 3</description>
          <fields>
            <field>
              <name>TCS3</name>
              <description>[26:25] Chip Select Time Control This 2-bits field defines the number of interface clock cycles between CS toggling and first or last edge of SPI clock. 0x0 0.5 clock cycle 0x1 1.5 clock cycle 0x2 2.5 clock cycle 0x3 3.5 clock cycle</description>
              <bitWidth>2</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>TRM</name>
              <description>[13:12] Transmit/Receive modes 0x0 Transmit and Receive mode 0x1 Receive only mode 0x2 Transmit only mode 0x3 Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>WL</name>
              <description>[11:7] SPI word length 0x00 Reserved 0x01 Reserved 0x02 Reserved 0x03 The SPI word is 4-bits long 0x04 The SPI word is 5-bits long 0x05 The SPI word is 6-bits long 0x06 The SPI word is 7-bits long 0x07 The SPI word is 8-bits long 0x08 The SPI word is 9-bits long 0x09 The SPI word is 10-bits long 0x0A The SPI word is 11-bits long 0x0B The SPI word is 12-bits long 0x0C The SPI word is 13-bits long 0x0D The SPI word is 14-bits long 0x0E The SPI word is 15-bits long 0x0F The SPI word is 16-bits long 0x10 The SPI word is 17-bits long 0x11 The SPI word is 18-bits long 0x12 The SPI word is 19-bits long 0x13 The SPI word is 20-bits long 0x14 The SPI word is 21-bits long 0x15 The SPI word is 22-bits long 0x16 The SPI word is 23-bits long 0x17 The SPI word is 24-bits long 0x18 The SPI word is 25-bits long 0x19 The SPI word is 26-bits long 0x1A The SPI word is 27-bits long 0x1B The SPI word is 28-bits long 0x1C The SPI word is 29-bits long 0x1D The SPI word is 30-bits long 0x1E The SPI word is 31-bits long 0x1F The SPI word is 32-bits long</description>
              <bitWidth>5</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>CLKD</name>
              <description>[5:2] Frequency divider for SPICLK. (only when the module is a Master SPI device). A programmable clock divider divides the SPI reference clock (CLKSPIREF) with a 4-bit value and results in a new clock SPICLK available to shift-in and shift-out data. By default the clock divider ratio has a power of two granularity when MCSPI_CHCONF[CLKG] is cleared Otherwise this register is the 4 LSB bit of a 12-bit register concatenated with clock divider extension MCSPI_CHCTRL[EXTCLK] register.The value description below defines the clock ratio when MCSPI_CHCONF[CLKG] is set to 0. 0x0 1 0x1 2 0x2 4 0x3 8 0x4 16 0x5 32 0x6 64 0x7 128 0x8 256 0x9 512 0xA 1024 0xB 2048 0xC 4096 0xD 8192 0xE 16384 0xF 32768</description>
              <bitWidth>4</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH3STAT</name>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <description>0x4402 116C 0x4402 216C This register provides status information about transmitter and receiver registers of channel 3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH3CTRL</name>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <description>0x4402 1170 0x4402 2170 This register is dedicated to enable the channel 3</description>
          <fields>
            <field>
              <name>EXTCLK</name>
              <description>[15:8] Clock ratio extension: This register is used to concatenate with MCSPI_CHCONF[CLKD] register for clock ratio only when granularity is one clock cycle (MCSPI_CHCONF[CLKG] set to 1). Then the max value reached is 4096 clock divider ratio. 0x00 Clock ratio is CLKD + 1 0x01 Clock ratio is CLKD + 1 + 16 0xFF Clock ratio is CLKD + 1 + 4080</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TX3</name>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <description>0x4402 1174 0x4402 2174 This register contains a single SPI word to transmit on the serial link what ever SPI word length is.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RX3</name>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <description>0x4402 1178 0x4402 2178 This register contains a single SPI word received through the serial link what ever SPI word length is.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>XFERLEVEL</name>
          <addressOffset>0x17C</addressOffset>
          <size>32</size>
          <description>0x4402 117C 0x4402 217C This register provides transfer levels needed while using FIFO buffer during transfer.</description>
          <fields>
            <field>
              <name>WCNT</name>
              <description>[31:16] Spi word counterThis register holds the programmable value of number of SPI word to be transferred on channel which is using the FIFO buffer.When transfer had started a read back in this register returns the current SPI word transfer index. 0x0000 Counter not used 0x0001 one word 0xFFFE 65534 spi word 0xFFFF 65535 spi word</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>AFL</name>
              <description>[15:8] Buffer Almost Full This register holds the programmable almost full level value used to determine almost full buffer condition. If the user wants an interrupt or a DMA read request to be issued during a receive operation when the data buffer holds at least n bytes then the buffer MCSPI_MODULCTRL[AFL] must be set with n-1.The size of this register is defined by the generic parameter FFNBYTE. 0x00 one byte 0x01 2 bytes 0xFE 255bytes 0xFF 256bytes</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AEL</name>
              <description>[7:0] Buffer Almost EmptyThis register holds the programmable almost empty level value used to determine almost empty buffer condition. If the user wants an interrupt or a DMA write request to be issued during a transmit operation when the data buffer is able to receive n bytes then the buffer MCSPI_MODULCTRL[AEL] must be set with n-1. 0x00 one byte 0x01 2 bytes 0xFE 255 bytes 0xFF 256bytes</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DAFTX</name>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <description>0x4402 1180 0x4402 2180 This register contains the SPI words to transmit on the serial link when FIFO used and DMA address is aligned on 256 bit.This register is an image of one of MCSPI_TX(i) register corresponding to the channel which have its FIFO enabled.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DAFRX</name>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <description>0x4402 11A0 0x4402 21A0 This register contains the SPI words to received on the serial link when FIFO used and DMA address is aligned on 256 bit.This register is an image of one of MCSPI_RX(i) register corresponding to the channel which have its FIFO enabled. ****************************************************************************</description>
          <resetValue>0</resetValue>
        </register>
