jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ARCM</name>
      <baseAddress>0x44025000</baseAddress>
      <registers>
        <register>
          <name>CAMERA_CLK_GEN</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>CAMERA_CLK_GEN</description>
          <fields>
            <field>
              <name>CAMERA_PLLCKDIV_OFF_TIME</name>
              <description>[10:8] Configuration of OFF-TIME for dividing PLL clk (240 MHz) in generation of Camera func-clk : &amp;quot;000&amp;quot; - 1 &amp;quot;001&amp;quot; - 2 &amp;quot;010&amp;quot; - 3 &amp;quot;011&amp;quot; - 4 &amp;quot;100&amp;quot; - 5 &amp;quot;101&amp;quot; - 6 &amp;quot;110&amp;quot; - 7 &amp;quot;111&amp;quot; - 8</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>NU1</name>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CAMERA_PLLCKDIV_ON_TIME</name>
              <description>[2:0] Configuration of ON-TIME for dividing PLL clk (240 MHz) in generation of Camera func-clk : &amp;quot;000&amp;quot; - 1 &amp;quot;001&amp;quot; - 2 &amp;quot;010&amp;quot; - 3 &amp;quot;011&amp;quot; - 4 &amp;quot;100&amp;quot; - 5 &amp;quot;101&amp;quot; - 6 &amp;quot;110&amp;quot; - 7 &amp;quot;111&amp;quot; - 8</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CAMERA_CLK_GATING</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>CAMERA_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU3</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CAMERA_SOFT_RESET</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>CAMERA_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCASP_CLK_GATING</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>MCASP_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU3</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCASP_SOFT_RESET</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>MCASP_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MMCHS_CLK_GEN</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>MMCHS_CLK_GEN</description>
          <fields>
            <field>
              <name>MMCHS_PLLCKDIV_OFF_TIME</name>
              <description>[10:8] Configuration of OFF-TIME for dividing PLL clk (240 MHz) in generation of MMCHS func-clk : &amp;quot;000&amp;quot; - 1 &amp;quot;001&amp;quot; - 2 &amp;quot;010&amp;quot; - 3 &amp;quot;011&amp;quot; - 4 &amp;quot;100&amp;quot; - 5 &amp;quot;101&amp;quot; - 6 &amp;quot;110&amp;quot; - 7 &amp;quot;111&amp;quot; - 8</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>NU1</name>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MMCHS_PLLCKDIV_ON_TIME</name>
              <description>[2:0] Configuration of ON-TIME for dividing PLL clk (240 MHz) in generation of MMCHS func-clk : &amp;quot;000&amp;quot; - 1 &amp;quot;001&amp;quot; - 2 &amp;quot;010&amp;quot; - 3 &amp;quot;011&amp;quot; - 4 &amp;quot;100&amp;quot; - 5 &amp;quot;101&amp;quot; - 6 &amp;quot;110&amp;quot; - 7 &amp;quot;111&amp;quot; - 8</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MMCHS_CLK_GATING</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>MMCHS_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU3</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MMCHS_SOFT_RESET</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>MMCHS_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCSPI_A1_CLK_GEN</name>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <description>MCSPI_A1_CLK_GEN</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MCSPI_A1_PLLCLKDIV_OFF_TIME</name>
              <description>[10:8] Configuration of OFF-TIME for dividing PLL clk (240 MHz) in generation of MCSPI_A1 func-clk : &amp;quot;000&amp;quot; - 1 &amp;quot;001&amp;quot; - 2 &amp;quot;010&amp;quot; - 3 &amp;quot;011&amp;quot; - 4 &amp;quot;100&amp;quot; - 5 &amp;quot;101&amp;quot; - 6 &amp;quot;110&amp;quot; - 7 &amp;quot;111&amp;quot; - 8</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MCSPI_A1_PLLCLKDIV_ON_TIME</name>
              <description>[2:0] Configuration of ON-TIME for dividing PLL clk (240 MHz) in generation of MCSPI_A1 func-clk : &amp;quot;000&amp;quot; - 1 &amp;quot;001&amp;quot; - 2 &amp;quot;010&amp;quot; - 3 &amp;quot;011&amp;quot; - 4 &amp;quot;100&amp;quot; - 5 &amp;quot;101&amp;quot; - 6 &amp;quot;110&amp;quot; - 7 &amp;quot;111&amp;quot; - 8</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCSPI_A1_CLK_GATING</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>MCSPI_A1_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU3</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCSPI_A1_SOFT_RESET</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>MCSPI_A1_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCSPI_A2_CLK_GEN</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>MCSPI_A2_CLK_GEN</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MCSPI_A2_PLLCKDIV_OFF_TIME</name>
              <description>[10:8] Configuration of OFF-TIME for dividing PLL clk (240 MHz) in generation of MCSPI_A2 func-clk : &amp;quot;000&amp;quot; - 1 &amp;quot;001&amp;quot; - 2 &amp;quot;010&amp;quot; - 3 &amp;quot;011&amp;quot; - 4 &amp;quot;100&amp;quot; - 5 &amp;quot;101&amp;quot; - 6 &amp;quot;110&amp;quot; - 7 &amp;quot;111&amp;quot; - 8</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MCSPI_A2_PLLCKDIV_ON_TIME</name>
              <description>[2:0] Configuration of OFF-TIME for dividing PLL clk (240 MHz) in generation of MCSPI_A2 func-clk : &amp;quot;000&amp;quot; - 1 &amp;quot;001&amp;quot; - 2 &amp;quot;010&amp;quot; - 3 &amp;quot;011&amp;quot; - 4 &amp;quot;100&amp;quot; - 5 &amp;quot;101&amp;quot; - 6 &amp;quot;110&amp;quot; - 7 &amp;quot;111&amp;quot; - 8</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCSPI_A2_CLK_GATING</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>MCSPI_A2_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU3</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCSPI_A2_SOFT_RESET</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>MCSPI_A2_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UDMA_A_CLK_GATING</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>UDMA_A_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UDMA_A_SOFT_RESET</name>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <description>UDMA_A_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_A_CLK_GATING</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>GPIO_A_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_A_SOFT_RESET</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>GPIO_A_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_B_CLK_GATING</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>GPIO_B_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_B_SOFT_RESET</name>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <description>GPIO_B_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_C_CLK_GATING</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>GPIO_C_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_C_SOFT_RESET</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>GPIO_C_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_D_CLK_GATING</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>GPIO_D_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_D_SOFT_RESET</name>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <description>GPIO_D_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_E_CLK_GATING</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>GPIO_E_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_E_SOFT_RESET</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>GPIO_E_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WDOG_A_CLK_GATING</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>WDOG_A_CLK_GATING</description>
          <fields>
            <field>
              <name>WDOG_A_BAUD_CLK_SEL</name>
              <description>[25:24] &amp;quot;00&amp;quot; - Sysclk ; &amp;quot;01&amp;quot; - REF_CLK (38.4 MHz) ; &amp;quot;10/11&amp;quot; - Slow_clk</description>
              <bitWidth>2</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WDOG_A_SOFT_RESET</name>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <description>WDOG_A_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UART_A0_CLK_GATING</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>UART_A0_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UART_A0_SOFT_RESET</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>UART_A0_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UART_A1_CLK_GATING</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>UART_A1_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UART_A1_SOFT_RESET</name>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <description>UART_A1_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT_A0_CLK_GATING</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>GPT_A0_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT_A0_SOFT_RESET</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>GPT_A0_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT_A1_CLK_GATING</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>GPT_A1_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT_A1_SOFT_RESET</name>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <description>GPT_A1_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT_A2_CLK_GATING</name>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <description>GPT_A2_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT_A2_SOFT_RESET</name>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <description>GPT_A2_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT_A3_CLK_GATING</name>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <description>GPT_A3_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT_A3_SOFT_RESET</name>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <description>GPT_A3_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCASP_FRAC_CLK_CONFIG0</name>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <description>MCASP_FRAC_CLK_CONFIG0</description>
          <fields>
            <field>
              <name>MCASP_FRAC_DIV_DIVISOR</name>
              <bitWidth>10</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MCASP_FRAC_DIV_FRACTION</name>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCASP_FRAC_CLK_CONFIG1</name>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <description>MCASP_FRAC_CLK_CONFIG1</description>
          <fields>
            <field>
              <name>MCASP_FRAC_DIV_PERIOD</name>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRYPTO_CLK_GATING</name>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <description>CRYPTO_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
