jbuonagurio/fanboard/svd/CC32xxSF.svd
        <register>
          <name>CRYPTO_SOFT_RESET</name>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <description>CRYPTO_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCSPI_S0_CLK_GATING</name>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <description>MCSPI_S0_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCSPI_S0_SOFT_RESET</name>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <description>MCSPI_S0_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCSPI_S0_CLKDIV_CFG</name>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <description>MCSPI_S0_CLKDIV_CFG</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MCSPI_S0_PLLCLKDIV_OFF_TIME</name>
              <description>[10:8] Configuration of OFF-TIME for dividing PLL clk (240 MHz) in generation of MCSPI_S0 func-clk : &amp;quot;000&amp;quot; - 1 &amp;quot;001&amp;quot; - 2 &amp;quot;010&amp;quot; - 3 &amp;quot;011&amp;quot; - 4 &amp;quot;100&amp;quot; - 5 &amp;quot;101&amp;quot; - 6 &amp;quot;110&amp;quot; - 7 &amp;quot;111&amp;quot; - 8</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MCSPI_S0_PLLCLKDIV_ON_TIME</name>
              <description>[2:0] Configuration of ON-TIME for dividing PLL clk (240 MHz) in generation of MCSPI_S0 func-clk : &amp;quot;000&amp;quot; - 1 &amp;quot;001&amp;quot; - 2 &amp;quot;010&amp;quot; - 3 &amp;quot;011&amp;quot; - 4 &amp;quot;100&amp;quot; - 5 &amp;quot;101&amp;quot; - 6 &amp;quot;110&amp;quot; - 7 &amp;quot;111&amp;quot; - 8</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>I2C_CLK_GATING</name>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <description>I2C_CLK_GATING</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>NU2</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>I2C_SOFT_RESET</name>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <description>I2C_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_LPDS_REQ</name>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <description>APPS_LPDS_REQ</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_TURBO_REQ</name>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <description>APPS_TURBO_REQ</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_DSLP_WAKE_CONFIG</name>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <description>APPS_DSLP_WAKE_CONFIG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_DSLP_WAKE_TIMER_CFG</name>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <description>APPS_DSLP_WAKE_TIMER_CFG</description>
          <fields>
            <field>
              <name>DSLP_WAKE_TIMER_OPP_CFG</name>
              <description>[31:16] Configuration (in slow_clks) which says when to request for OPP during deep-sleep exit</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DSLP_WAKE_TIMER_WAKE_CFG</name>
              <description>[15:0] Configuration (in slow_clks) which says when to request for WAKE during deep-sleep exit</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SLP_WAKE_ENABLE</name>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <description>SLP_WAKE_ENABLE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_SLP_WAKETIMER_CFG</name>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <description>APPS_SLP_WAKETIMER_CFG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_TO_NWP_WAKE_REQUEST</name>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <description>APPS_TO_NWP_WAKE_REQUEST</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>INTERRUPT_STATUS</name>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <description>INTERRUPT_STATUS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>INTERRUPT_ENABLE</name>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <description>INTERRUPT_ENABLE</description>
          <resetValue>0</resetValue>
        </register>
