jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>APPS_CONFIG</name>
      <baseAddress>0x44026000</baseAddress>
      <registers>
        <register>
          <name>PATCH_TRAP_ADDR_REG</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Patch trap address Register array</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PATCH_TRAP_EN_REG</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>PATCH_TRAP_EN_REG</description>
          <fields>
            <field>
              <name>PATCH_TRAP_EN</name>
              <description>[29:0] When PATCH_TRAP_EN[n] is set bus fault is generated for the address PATCH_TRAP_ADD[n][31:0] from Idcode bus. The exception routine should take care to jump to the location where the patch correspond to this address is kept.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FAULT_STATUS_REG</name>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <description>FAULT_STATUS_REG</description>
          <fields>
            <field>
              <name>PATCH_ERR_INDEX</name>
              <description>[5:1] This field shows because of which patch trap address the bus_fault is generated. If the PATCH_ERR bit is set, then it means the bus fault is generated because of PATCH_TRAP_ADDR_REG[2^PATCH_ERR_INDEX]</description>
              <bitWidth>5</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEMSS_WR_ERR_CLR_REG</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>MEMSS_WR_ERR_CLR_REG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEMSS_WR_ERR_ADDR_REG</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>MEMSS_WR_ERR_ADDR_REG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA_DONE_INT_MASK</name>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <description>DMA_DONE_INT_MASK</description>
          <fields>
            <field>
              <name>ADC_WR_DMA_DONE_INT_MASK</name>
              <description>[15:12] 1= disable corresponding interrupt;0 = interrupt enabled bit 14: ADC channel 7 interrupt enable/disable bit 13: ADC channel 5 interrupt enable/disable bit 12: ADC channel 3 interrupt enable/disable bit 11: ADC channel 1 interrupt enable/disable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA_DONE_INT_MASK_SET</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>DMA_DONE_INT_MASK_SET</description>
          <fields>
            <field>
              <name>ADC_WR_DMA_DONE_INT_MASK_SET</name>
              <description>[15:12] write 1 to set mask of the corresponding DMA DONE IRQ;0 = no effect bit 14: ADC channel 7 DMA Done IRQ bit 13: ADC channel 5 DMA Done IRQ bit 12: ADC channel 3 DMA Done IRQ bit 11: ADC channel 1 DMA Done IRQ</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA_DONE_INT_MASK_CLR</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>DMA_DONE_INT_MASK_CLR</description>
          <fields>
            <field>
              <name>ADC_WR_DMA_DONE_INT_MASK_CLR</name>
              <description>[15:12] write 1 to clear mask of the corresponding DMA DONE IRQ;0 = no effect bit 14: ADC channel 7 DMA Done IRQ mask bit 13: ADC channel 5 DMA Done IRQ mask bit 12: ADC channel 3 DMA Done IRQ mask bit 11: ADC channel 1 DMA Done IRQ mask</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA_DONE_INT_STS_CLR</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>DMA_DONE_INT_STS_CLR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA_DONE_INT_ACK</name>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <description>DMA_DONE_INT_ACK</description>
          <fields>
            <field>
              <name>ADC_WR_DMA_DONE_INT_ACK</name>
              <description>[15:12] write 1 to clear corresponding interrupt; 0 = no effect; bit 14: ADC channel 7 DMA Done IRQ bit 13: ADC channel 5 DMA Done IRQ bit 12: ADC channel 3 DMA Done IRQ bit 11: ADC channel 1 DMA Done IRQ</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA_DONE_INT_STS_MASKED</name>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <description>DMA_DONE_INT_STS_MASKED</description>
          <fields>
            <field>
              <name>ADC_WR_DMA_DONE_INT_STS_MASKED</name>
              <description>[15:12] 1= corresponding interrupt is active and not masked. read is non-destructive;0 = corresponding interrupt is inactive or masked by DMA_DONE_INT mask bit 14: ADC channel 7 DMA Done IRQ bit 13: ADC channel 5 DMA Done IRQ bit 12: ADC channel 3 DMA Done IRQ bit 11: ADC channel 1 DMA Done IRQ</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA_DONE_INT_STS_RAW</name>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <description>DMA_DONE_INT_STS_RAW</description>
          <fields>
            <field>
              <name>ADC_WR_DMA_DONE_INT_STS_RAW</name>
              <description>[15:12] 1= corresponding interrupt is active. read is non-destructive;0 = corresponding interrupt is inactive bit 14: ADC channel 7 DMA Done IRQ bit 13: ADC channel 5 DMA Done IRQ bit 12: ADC channel 3 DMA Done IRQ bit 11: ADC channel 1 DMA Done IRQ</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FAULT_STATUS_CLR_REG</name>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <description>FAULT_STATUS_CLR_REG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RESERVD_REG_0</name>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <description>RESERVD_REG_0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT_TRIG_SEL</name>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <description>GPT_TRIG_SEL</description>
          <fields>
            <field>
              <name>GPT_TRIG_SEL</name>
              <description>[7:0] This bit is implemented for GPT trigger mode select. GPT IP support 2 modes: RTC mode and external trigger. When this bit is set to logic '1': enable external trigger mode for APPS GPT CP0 and CP1 pin. bit 0: when set '1' enable external GPT trigger 0 on GPIO0 CP0 pin else RTC mode is selected. bit 1: when set '1' enable external GPT trigger 1 on GPIO0 CP1 pin else RTC mode is selected. bit 2: when set '1' enable external GPT trigger 2 on GPIO1 CP0 pin else RTC mode is selected. bit 3: when set '1' enable external GPT trigger 3 on GPIO1 CP1 pin else RTC mode is selected. bit 4: when set '1' enable external GPT trigger 4 on GPIO2 CP0 pin else RTC mode is selected. bit 5: when set '1' enable external GPT trigger 5 on GPIO2 CP1 pin else RTC mode is selected. bit 6: when set '1' enable external GPT trigger 6 on GPIO3 CP0 pin else RTC mode is selected. bit 7: when set '1' enable external GPT trigger 7 on GPIO3 CP1 pin else RTC mode is selected.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TOP_DIE_SPARE_DIN_REG</name>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <description>TOP_DIE_SPARE_DIN_REG</description>
          <fields>
            <field>
              <name>D2D_SPARE_DIN</name>
              <description>[2:0] Capture data from d2d_spare pads</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TOP_DIE_SPARE_DOUT_REG</name>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <description>TOP_DIE_SPARE_DOUT_REG</description>
          <fields>
            <field>
              <name>D2D_SPARE_DOUT</name>
              <description>[2:0] Send data to d2d_spare pads - eventually this will get registered in top die</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
