jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPRCM</name>
      <baseAddress>0x4402D000</baseAddress>
      <registers>
        <register>
          <name>APPS_SOFT_RESET</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>APPS_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_LPDS_WAKEUP_CFG</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>APPS_LPDS_WAKEUP_CFG</description>
          <fields>
            <field>
              <name>APPS_LPDS_WAKEUP_CFG</name>
              <description>[7:0] Mask for LPDS Wakeup interrupt : [7] - Host IRQ from NWP [6] - NWP_LPDS_Wake_irq (TRUE_LPDS) [5] - NWP Wake-request to APPS [4] - GPIO [3:1] - Reserved [0] - LPDS Wakeup-timer</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_LPDS_WAKEUP_SRC</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>APPS_LPDS_WAKEUP_SRC</description>
          <fields>
            <field>
              <name>APPS_LPDS_WAKEUP_SRC</name>
              <description>[7:0] Indicates the cause for wakeup from LPDS : [7] - Host IRQ from NWP [6] - NWP_LPDS_Wake_irq (TRUE_LPDS) [5] - NWP Wake-request to APPS [4] - GPIO [3:1] - Reserved [0] - LPDS Wakeup-timer</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_RESET_CAUSE</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>APPS_RESET_CAUSE</description>
          <fields>
            <field>
              <name>APPS_RESET_CAUSE</name>
              <description>[7:0] Indicates the reset cause for APPS : &amp;quot;0000&amp;quot; - Wake from HIB/OFF mode; &amp;quot;0001&amp;quot; - Wake from LPDS ; &amp;quot;0010&amp;quot; - Reserved ; &amp;quot;0011&amp;quot; - Soft-reset0 (Only APPS Cortex-sysrstn is asserted); &amp;quot;0100&amp;quot; - Soft-reset1 (APPS Cortex-sysrstn and APPS peripherals are reset); &amp;quot;0101&amp;quot; - WDOG0 (APPS Cortex-sysrstn and APPS peripherals are reset); &amp;quot;0110&amp;quot; - MCU Soft-reset (APPS + NWP Cortex-sysrstn + Peripherals are reset); &amp;quot;0111&amp;quot; - Secure Init done (Indication that reset has happened after DevInit); &amp;quot;1000&amp;quot; - Dev Mode Patch Init done (During development mode, patch downloading and Cortex re-vectoring is completed)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_LPDS_WAKETIME_OPP_CFG</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>APPS_LPDS_WAKETIME_OPP_CFG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_SRAM_DSLP_CFG</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>APPS_SRAM_DSLP_CFG</description>
          <fields>
            <field>
              <name>APPS_SRAM_DSLP_CFG</name>
              <description>[19:0] Configuration of APPS Memories during Deep-sleep : 0 - SRAMs are OFF ; 1 - SRAMs are Retained. APPS SRAM Cluster information : [0] - 1st column in MEMSS (Applicable only when owned by APPS); [1] - 2nd column in MEMSS (Applicable only when owned by APPS); [2] - 3rd column in MEMSS (Applicable only when owned by APPS) ; [3] - 4th column in MEMSS (Applicable only when owned by APPS) ; [16] - MCU-PD - Apps cluster 0 (TBD); [19:18] - Reserved.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_SRAM_LPDS_CFG</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>APPS_SRAM_LPDS_CFG</description>
          <fields>
            <field>
              <name>APPS_SRAM_LPDS_CFG</name>
              <description>[19:0] Configuration of APPS Memories during LPDS : 0 - SRAMs are OFF ; 1 - SRAMs are Retained. APPS SRAM Cluster information : [0] - 1st column in MEMSS (Applicable only when owned by APPS); [1] - 2nd column in MEMSS (Applicable only when owned by APPS); [2] - 3rd column in MEMSS (Applicable only when owned by APPS) ; [3] - 4th column in MEMSS (Applicable only when owned by APPS) ; [16] - MCU-PD - Apps cluster 0 (TBD); [19:18] - Reserved.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_LPDS_WAKETIME_WAKE_CFG</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>APPS_LPDS_WAKETIME_WAKE_CFG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TOP_DIE_ENABLE</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>TOP_DIE_ENABLE</description>
          <fields>
            <field>
              <name>TOP_DIE_PWR_PS</name>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TOP_DIE_ENABLE_PARAMETERS</name>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <description>TOP_DIE_ENABLE_PARAMETERS</description>
          <fields>
            <field>
              <name>FLASH_3P3_RSTN2D2D_POR_RSTN</name>
              <description>[31:28] Configuration (in slow_clks) for number of clks between Flash-3p3-rstn to D2D POR Resetn.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>TOP_DIE_SW_EN2TOP_DIE_FLASH_3P3_RSTN</name>
              <description>[23:16] Configuration (in slow_clks) for number of clks between Top-die Switch-Enable and Top-die Flash 3p3 Reset removal</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TOP_DIE_POR_RSTN2BOTT_DIE_FMC_RSTN</name>
              <description>[7:0] Configuration (in slow_clks) for number of clks between D2D POR Reset removal and bottom die FMC reset removal</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCU_GLOBAL_SOFT_RESET</name>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <description>MCU_GLOBAL_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ADC_CLK_CONFIG</name>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <description>ADC_CLK_CONFIG</description>
          <fields>
            <field>
              <name>ADC_CLKGEN_OFF_TIME</name>
              <description>[10:6] Configuration (in number of 38.4 MHz clks) for the OFF-Time in generation of ADC_CLK</description>
              <bitWidth>5</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>ADC_CLKGEN_ON_TIME</name>
              <description>[5:1] Configuration (in number of 38.4 MHz clks) for the ON-Time in generation of ADC_CLK</description>
              <bitWidth>5</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_GPIO_WAKE_CONF</name>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <description>APPS_GPIO_WAKE_CONF</description>
          <fields>
            <field>
              <name>APPS_GPIO_WAKE_CONF</name>
              <description>[1:0] &amp;quot;00&amp;quot; - Wake on Level0 on selected GPIO pin (GPIO is selected inside the HIB3p3 module); &amp;quot;01&amp;quot; - Wakeup on fall-edge of GPIO pin.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EN_NWP_BOOT_WO_DEVINIT</name>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <description>EN_NWP_BOOT_WO_DEVINIT</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HCLK_DIV_CFG</name>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <description>MEM_HCLK_DIV_CFG</description>
          <fields>
            <field>
              <name>MEM_HCLK_DIV_CFG</name>
              <description>[2:0] Division configuration for HCLKDIVOUT : &amp;quot;000&amp;quot; - Divide by 1 ; &amp;quot;001&amp;quot; - Divide by 2 ; &amp;quot;010&amp;quot; - Divide by 3 ; &amp;quot;011&amp;quot; - Divide by 4 ; &amp;quot;100&amp;quot; - Divide by 5 ; &amp;quot;101&amp;quot; - Divide by 6 ; &amp;quot;110&amp;quot; - Divide by 7 ; &amp;quot;111&amp;quot; - Divide by 8</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_SYSCLK_DIV_CFG</name>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <description>MEM_SYSCLK_DIV_CFG</description>
          <fields>
            <field>
              <name>MEM_SYSCLK_DIV_OFF_TIME</name>
              <bitWidth>3</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MEM_SYSCLK_DIV_ON_TIME</name>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APLLMCS_LOCK_TIME_CONF</name>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <description>APLLMCS_LOCK_TIME_CONF</description>
          <fields>
            <field>
              <name>MEM_APLLMCS_WLAN_LOCK_TIME</name>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MEM_APLLMCS_MCU_LOCK_TIME</name>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_SOFT_RESET</name>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <description>NWP_SOFT_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_LPDS_WAKEUP_CFG</name>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <description>NWP_LPDS_WAKEUP_CFG</description>
          <fields>
            <field>
              <name>NWP_LPDS_WAKEUP_CFG</name>
              <description>[7:0] Mask for LPDS Wakeup interrupt : 7 - WLAN Host Interrupt ; 6 - WLAN to NWP Wake request ; 5 - APPS to NWP Wake request; 4 - GPIO Wakeup ; 3 - Autonomous UART Wakeup ; 2 - SSDIO Wakeup ; 1 - Autonomous SPI Wakeup ; 0 - LPDS Wakeup-timer</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_LPDS_WAKEUP_SRC</name>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <description>NWP_LPDS_WAKEUP_SRC</description>
          <fields>
            <field>
              <name>NWP_LPDS_WAKEUP_SRC</name>
              <description>[7:0] Indicates the cause for NWP LPDS-Wakeup : 7 - WLAN Host Interrupt ; 6 - WLAN to NWP Wake request ; 5 - APPS to NWP Wake request; 4 - GPIO Wakeup ; 3 - Autonomous UART Wakeup ; 2 - SSDIO Wakeup ; 1 - Autonomous SPI Wakeup ; 0 - LPDS Wakeup-timer</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_RESET_CAUSE</name>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <description>NWP_RESET_CAUSE</description>
          <fields>
            <field>
              <name>NWP_RESET_CAUSE</name>
              <description>[7:0] Indicates the reset cause for NWP : &amp;quot;0000&amp;quot; - Wake from HIB/OFF mode; &amp;quot;0001&amp;quot; - Wake from LPDS ; &amp;quot;0010&amp;quot; - Reserved ; &amp;quot;0011&amp;quot; - Soft-reset0 (Only NWP Cortex-sysrstn is asserted); &amp;quot;0100&amp;quot; - Soft-reset1 (NWP Cortex-sysrstn and NWP peripherals are reset); &amp;quot;0101&amp;quot; - WDOG0 (NWP Cortex-sysrstn and NWP peripherals are reset); &amp;quot;0110&amp;quot; - MCU Soft-reset (APPS + NWP Cortex-sysrstn + Peripherals are reset); &amp;quot;0111&amp;quot; - SSDIO Function2 reset (Only Cortex-sysrstn is asserted) ; &amp;quot;1000&amp;quot; - Reset due to WDOG of APPS (NWP Cortex-sysrstn and NWP peripherals are reset);</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_LPDS_WAKETIME_OPP_CFG</name>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <description>NWP_LPDS_WAKETIME_OPP_CFG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_SRAM_DSLP_CFG</name>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <description>NWP_SRAM_DSLP_CFG</description>
          <fields>
            <field>
              <name>NWP_SRAM_DSLP_CFG</name>
              <description>[19:0] Configuration of NWP Memories during DSLP : 0 - SRAMs are OFF ; 1 - SRAMs are Retained. NWP SRAM Cluster information : [2] - 3rd column in MEMSS (Applicable only when owned by NWP) ; [3] - 4th column in MEMSS (Applicable only when owned by NWP) ; [4] - 5th column in MEMSS (Applicable only when owned by NWP) ; [5] - 6th column in MEMSS (Applicable only when owned by NWP) ; [6] - 7th column in MEMSS (Applicable only when owned by NWP) ; [7] - 8th column in MEMSS (Applicable only when owned by NWP) ; [8] - 9th column in MEMSS (Applicable only when owned by NWP) ; [9] - 10th column in MEMSS (Applicable only when owned by NWP) ; [10] - 11th column in MEMSS (Applicable only when owned by NWP) ; [11] - 12th column in MEMSS (Applicable only when owned by NWP) ; [12] - 13th column in MEMSS (Applicable only when owned by NWP) ; [13] - 14th column in MEMSS (Applicable only when owned by NWP) ; [14] - 15th column in MEMSS (Applicable only when owned by NWP) ; [19:18] - Reserved.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_SRAM_LPDS_CFG</name>
          <addressOffset>0x41C</addressOffset>
          <size>32</size>
          <description>NWP_SRAM_LPDS_CFG</description>
          <fields>
            <field>
              <name>NWP_SRAM_LPDS_CFG</name>
              <description>[19:0] Configuration of NWP Memories during LPDS : 0 - SRAMs are OFF ; 1 - SRAMs are Retained. NWP SRAM Cluster information : [2] - 3rd column in MEMSS (Applicable only when owned by NWP) ; [3] - 4th column in MEMSS (Applicable only when owned by NWP) ; [4] - 5th column in MEMSS (Applicable only when owned by NWP) ; [5] - 6th column in MEMSS (Applicable only when owned by NWP) ; [6] - 7th column in MEMSS (Applicable only when owned by NWP) ; [7] - 8th column in MEMSS (Applicable only when owned by NWP) ; [8] - 9th column in MEMSS (Applicable only when owned by NWP) ; [9] - 10th column in MEMSS (Applicable only when owned by NWP) ; [10] - 11th column in MEMSS (Applicable only when owned by NWP) ; [11] - 12th column in MEMSS (Applicable only when owned by NWP) ; [12] - 13th column in MEMSS (Applicable only when owned by NWP) ; [13] - 14th column in MEMSS (Applicable only when owned by NWP) ; [14] - 15th column in MEMSS (Applicable only when owned by NWP) ; [19:18] - Reserved.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_LPDS_WAKETIME_WAKE_CFG</name>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <description>NWP_LPDS_WAKETIME_WAKE_CFG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_AUTONMS_SPI_MASTER_SEL</name>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <description>NWP_AUTONMS_SPI_MASTER_SEL</description>
          <fields>
            <field>
              <name>F</name>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_AUTONMS_SPI_IDLE_REQ</name>
          <addressOffset>0x428</addressOffset>
          <size>32</size>
          <description>NWP_AUTONMS_SPI_IDLE_REQ</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WLAN_TO_NWP_WAKE_REQUEST</name>
          <addressOffset>0x42C</addressOffset>
          <size>32</size>
          <description>WLAN_TO_NWP_WAKE_REQUEST</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_TO_WLAN_WAKE_REQUEST</name>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <description>NWP_TO_WLAN_WAKE_REQUEST</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_GPIO_WAKE_CONF</name>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <description>NWP_GPIO_WAKE_CONF</description>
          <fields>
            <field>
              <name>NWP_GPIO_WAKE_CONF</name>
              <description>[1:0] &amp;quot;00&amp;quot; - Wakeup on level0 of the selected GPIO (GPIO gets selected inside HIB3P3-module); &amp;quot;01&amp;quot; - Wakeup on fall-edge of selected GPIO.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG12</name>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG12</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIEID_READ_REG5</name>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <description>DIEID_READ_REG5</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIEID_READ_REG6</name>
          <addressOffset>0x44C</addressOffset>
          <size>32</size>
          <description>DIEID_READ_REG6</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REF_FSM_CFG0</name>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <description>REF_FSM_CFG0</description>
          <fields>
            <field>
              <name>BGAP_SETTLING_TIME</name>
              <description>[23:16] ANA-BGAP Settling time (In number of slow_clks)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>FREF_LDO_SETTLING_TIME</name>
              <description>[15:8] Slicer LDO settling time (In number of slow clks)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DIG_BUF_SETTLING_TIME</name>
              <description>[7:0] Dig-buffer settling time (In number of slow clks)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REF_FSM_CFG1</name>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <description>REF_FSM_CFG1</description>
          <fields>
            <field>
              <name>XTAL_SETTLING_TIME</name>
              <description>[31:24] XTAL settling time (In number of slow clks)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>SLICER_LV_SETTLING_TIME</name>
              <description>[23:16] LV Slicer settling time</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>SLICER_HV_PD_SETTLING_TIME</name>
              <description>[15:8] HV Slicer Pull-down settling time</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SLICER_HV_SETTLING_TIME</name>
              <description>[7:0] HV Slicer settling time</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APLLMCS_WLAN_CONFIG0_40</name>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <description>APLLMCS_WLAN_CONFIG0_40</description>
          <fields>
            <field>
              <name>APLLMCS_WLAN_N_40</name>
              <description>[14:8] Configuration for WLAN APLLMCS - N[6:0], if the XTAL frequency is 40 MHz (Selected by efuse)</description>
              <bitWidth>7</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>APLLMCS_WLAN_M_40</name>
              <description>[7:0] Configuration for WLAN APLLMCS - M[7:0], if the XTAL frequency is 40 MHz (Selected by efuse)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
