jbuonagurio/fanboard/svd/CC32xxSF.svd
        <register>
          <name>APLLMCS_WLAN_CONFIG1_40</name>
          <addressOffset>0x80C</addressOffset>
          <size>32</size>
          <description>APLLMCS_WLAN_CONFIG1_40</description>
          <fields>
            <field>
              <name>APLLMCS_SELINPFREQ_40</name>
              <description>[2:0] Configuration for WLAN APLLMCS - Selinpfreq, if the XTAL frequency is 40 MHz (Selected by Efuse)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APLLMCS_WLAN_CONFIG0_26</name>
          <addressOffset>0x810</addressOffset>
          <size>32</size>
          <description>APLLMCS_WLAN_CONFIG0_26</description>
          <fields>
            <field>
              <name>APLLMCS_WLAN_N_26</name>
              <description>[14:8] Configuration for WLAN APLLMCS - N[6:0], if the XTAL frequency is 26 MHz (Selected by efuse)</description>
              <bitWidth>7</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>APLLMCS_WLAN_M_26</name>
              <description>[7:0] Configuration for WLAN APLLMCS - M[7:0], if the XTAL frequency is 26 MHz (Selected by efuse)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APLLMCS_WLAN_CONFIG1_26</name>
          <addressOffset>0x814</addressOffset>
          <size>32</size>
          <description>APLLMCS_WLAN_CONFIG1_26</description>
          <fields>
            <field>
              <name>APLLMCS_SELINPFREQ_26</name>
              <description>[2:0] Configuration for WLAN APLLMCS - Selinpfreq, if the XTAL frequency is 26 MHz (Selected by Efuse)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APLLMCS_WLAN_OVERRIDES</name>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <description>APLLMCS_WLAN_OVERRIDES</description>
          <fields>
            <field>
              <name>APLLMCS_WLAN_POSTDIV_OVERRIDE</name>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>APLLMCS_WLAN_SPARE</name>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>APLLMCS_WLAN_N_7_8_OVERRIDE</name>
              <description>[1:0] Override value for WLAN_APLLMCS_N[8:7] bits. Applicable only when bit [1] is set to 1. (Else controlled from WTOP)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APLLMCS_MCU_RUN_CONFIG0_38P4</name>
          <addressOffset>0x81C</addressOffset>
          <size>32</size>
          <description>APLLMCS_MCU_RUN_CONFIG0_38P4</description>
          <fields>
            <field>
              <name>APLLMCS_MCU_POSTDIV</name>
              <bitWidth>3</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>APLLMCS_MCU_SPARE</name>
              <bitWidth>3</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>APLLMCS_MCU_RUN_N_38P4</name>
              <description>[22:16] Configuration for MCU-APLLMCS : N during RUN mode. Selected if the XTAL frequency is 38.4 MHz (from Efuse)</description>
              <bitWidth>7</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>APLLMCS_MCU_RUN_M_38P4</name>
              <description>[15:8] Configuration for MCU-APLLMCS : M during RUN mode. Selected if the XTAL frequency is 38.4 MHz (from Efuse)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>APLLMCS_MCU_RUN_N_7_8_38P4</name>
              <description>[1:0] Configuration for MCU-APLLMCS : N[8:7] during RUN mode. Selected if the XTAL frequency is 38.4 MHz (From Efuse)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APLLMCS_MCU_RUN_CONFIG1_38P4</name>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <description>APLLMCS_MCU_RUN_CONFIG1_38P4</description>
          <fields>
            <field>
              <name>APLLMCS_MCU_RUN_SELINPFREQ_38P4</name>
              <description>[2:0] Configuration for MCU-APLLMCS : SELINPFREQ during RUN mode. Selected if the XTAL frequency is 38.4 MHz (from Efuse)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APLLMCS_MCU_RUN_CONFIG0_26</name>
          <addressOffset>0x824</addressOffset>
          <size>32</size>
          <description>APLLMCS_MCU_RUN_CONFIG0_26</description>
          <fields>
            <field>
              <name>APLLMCS_MCU_RUN_N_26</name>
              <description>[22:16] Configuration for MCU-APLLMCS : N during RUN mode. Selected if the XTAL frequency is 26 MHz (from Efuse)</description>
              <bitWidth>7</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>APLLMCS_MCU_RUN_M_26</name>
              <description>[15:8] Configuration for MCU-APLLMCS : M during RUN mode. Selected if the XTAL frequency is 26 MHz (from Efuse)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>APLLMCS_MCU_RUN_N_7_8_26</name>
              <description>[1:0] Configuration for MCU-APLLMCS : N[8:7] during RUN mode. Selected if the XTAL frequency is 26 MHz (From Efuse)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APLLMCS_MCU_RUN_CONFIG1_26</name>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <description>APLLMCS_MCU_RUN_CONFIG1_26</description>
          <fields>
            <field>
              <name>APLLMCS_MCU_RUN_SELINPFREQ_26</name>
              <description>[2:0] Configuration for MCU-APLLMCS : SELINPFREQ during RUN mode. Selected if the XTAL frequency is 26 MHz (from Efuse)</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SPARE_RW0</name>
          <addressOffset>0x82C</addressOffset>
          <size>32</size>
          <description>SPARE_RW0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SPARE_RW1</name>
          <addressOffset>0x830</addressOffset>
          <size>32</size>
          <description>SPARE_RW1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APLLMCS_MCU_OVERRIDES</name>
          <addressOffset>0x834</addressOffset>
          <size>32</size>
          <description>APLLMCS_MCU_OVERRIDES</description>
          <fields>
            <field>
              <name>SYSCLK_SRC_OVERRIDE</name>
              <description>[2:1] Override for sysclk src (applicable only if bit [0] is set to 1. &amp;quot;00&amp;quot;- SLOW_CLK &amp;quot;01&amp;quot;- XTAL_CLK &amp;quot;10&amp;quot;- PLL_CLK</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSCLK_SWITCH_STATUS</name>
          <addressOffset>0x838</addressOffset>
          <size>32</size>
          <description>SYSCLK_SWITCH_STATUS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REF_LDO_CONTROLS</name>
          <addressOffset>0x83C</addressOffset>
          <size>32</size>
          <description>REF_LDO_CONTROLS</description>
          <fields>
            <field>
              <name>REF_SPARE_CONTROL</name>
              <description>[15:14] Spare bits for REF_CTRL_FSM. Reaches directly on port TOP_PM_REG2[15:14] of gprcm.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>REF_TLOAD_ENABLE</name>
              <description>[13:11] REF TLOAD Enable. Reaches directly on port TOP_PM_REG2[13:11] of gprcm.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>REF_LDO_TMUX_CONTROL</name>
              <description>[10:8] REF_LDO Test-mux control. Reaches directly on port TOP_PM_REG2[10:8] of gprcm.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>REF_BW_CONTROL</name>
              <description>[7:6] REF BW Control. Reaches directly on port TOP_PM_REG2[7:6] of gprcm.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>REF_VTRIM_CONTROL</name>
              <description>[5:2] REF VTRIM Control. Reaches directly on port TOP_PM_REG2[5:2] of gprcm.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REF_RTRIM_CONTROL</name>
          <addressOffset>0x840</addressOffset>
          <size>32</size>
          <description>REF_RTRIM_CONTROL</description>
          <fields>
            <field>
              <name>TOP_PM_REG0_5_4</name>
              <description>[28:27] This is [5:4] bits of TOP_PM_REG0</description>
              <bitWidth>2</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>TOP_CLKM_REG0_15_5</name>
              <description>[26:16] This is [15:5] bits of TOP_CLKM_REG0</description>
              <bitWidth>11</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>REF_CLKM_RTRIM</name>
              <description>[4:0] CLKM_TRIM Override. Applicable when efuse_done = 0 or bit[8] is set to 1.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REF_SLICER_CONTROLS0</name>
          <addressOffset>0x844</addressOffset>
          <size>32</size>
          <description>REF_SLICER_CONTROLS0</description>
          <fields>
            <field>
              <name>CM_TMUX_SEL_LOWV</name>
              <description>[9:6] CM Test-mux select. Reaches on TOP_CLMM_REG1_IN[9:6] port of gprcm</description>
              <bitWidth>4</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SLICER_SPARE0</name>
              <description>[5:4] Slicer spare0 control. Reaches on TOP_CLKM_REG1_IN[5:4] port of gprcm</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REF_SLICER_CONTROLS1</name>
          <addressOffset>0x848</addressOffset>
          <size>32</size>
          <description>REF_SLICER_CONTROLS1</description>
          <fields>
            <field>
              <name>SLICER_SPARE1</name>
              <description>[15:10] Slicer spare1. Reaches on port TOP_CLKM_REG2_IN[15:10] of gprcm.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>XOSC_TRIM</name>
              <description>[9:4] XOSC Trim. Reaches on port TOP_CLKM_REG2_IN[9:4] of gprcm</description>
              <bitWidth>6</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SLICER_LV_TRIM</name>
              <description>[2:0] LV Slicer trim. Reaches on port TOP_CLKM_REG2_IN[2:0] of gprcm.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REF_ANA_BGAP_CONTROLS0</name>
          <addressOffset>0x84C</addressOffset>
          <size>32</size>
          <description>REF_ANA_BGAP_CONTROLS0</description>
          <fields>
            <field>
              <name>MEM_REF_TEMP_TRIM</name>
              <description>[15:10] REF_TEMP_TRIM override. Applicable when bit [20] of this register set to 1. (or efc_done = 0) Note : Final REF_TEMP_TRIM reaches on port TOP_PM_REG0[15:10] of gprcm.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>MEM_REF_V2I_TRIM</name>
              <description>[9:6] REF_V2I_TRIM Override. Applicable when bit [21] of this register set to 1 . (of efc_done = 0) Note : Final REF_V2I_TRIM reaches on port TOP_PM_REG0[9:6] of gprcm.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>NU1</name>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REF_ANA_BGAP_CONTROLS1</name>
          <addressOffset>0x850</addressOffset>
          <size>32</size>
          <description>REF_ANA_BGAP_CONTROLS1</description>
          <fields>
            <field>
              <name>MEM_REF_BG_SPARE</name>
              <description>[15:14] REF_BGAP_SPARE. Reaches on port TOP_PM_REG1[15:14] of gprcm.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>MEM_REF_BGAP_TMUX_CTRL</name>
              <description>[13:9] REF_BGAP_TMUX_CTRL. Reaches on port TOP_PM_REG1[13:9] of gprcm.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>MEM_REF_FILT_TRIM</name>
              <description>[8:5] REF_FILT_TRIM. Reaches on port TOP_PM_REG1[8:5] of gprcm.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MEM_REF_MAG_TRIM</name>
              <description>[4:0] REF_MAG_TRIM Override. Applicable when bit[22] of REF_ANA_BGAP_CONTROLS0 [0x084C] set to 1 (of efc_done = 0). Note : Final REF_MAG_TRIM reaches on port TOP_PM_REG1[4:0] of gprcm</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REF_ANA_SPARE_CONTROLS0</name>
          <addressOffset>0x854</addressOffset>
          <size>32</size>
          <description>REF_ANA_SPARE_CONTROLS0</description>
          <fields>
            <field>
              <name>MEM_TOP_PM_REG3</name>
              <description>[15:0] Spare control. Reaches on TOP_PM_REG3 [15:0] of gprcm.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REF_ANA_SPARE_CONTROLS1</name>
          <addressOffset>0x858</addressOffset>
          <size>32</size>
          <description>REF_ANA_SPARE_CONTROLS1</description>
          <fields>
            <field>
              <name>MEM_TOP_CLKM_REG3</name>
              <description>[31:16] Spare control. Reaches on TOP_CLKM_REG3 [15:0] of gprcm.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MEM_TOP_CLKM_REG4</name>
              <description>[15:0] Spare control. Reaches on TOP_CLKM_REG4 [15:0] of gprcm.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEMSS_PSCON_OVERRIDES0</name>
          <addressOffset>0x85C</addressOffset>
          <size>32</size>
          <description>MEMSS_PSCON_OVERRIDES0</description>
          <fields>
            <field>
              <name>MEM_MEMSS_PSCON_MEM_OFF_OVERRIDE</name>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MEM_MEMSS_PSCON_MEM_RETAIN_OVERRIDE</name>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEMSS_PSCON_OVERRIDES1</name>
          <addressOffset>0x860</addressOffset>
          <size>32</size>
          <description>MEMSS_PSCON_OVERRIDES1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PLL_REF_LOCK_OVERRIDES</name>
          <addressOffset>0x864</addressOffset>
          <size>32</size>
          <description>PLL_REF_LOCK_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCU_PSCON_DEBUG</name>
          <addressOffset>0x868</addressOffset>
          <size>32</size>
          <description>MCU_PSCON_DEBUG</description>
          <fields>
            <field>
              <name>MCU_PSCON_RTC_PS</name>
              <description>[5:3] MCU_PSCON_RTC_ON = &amp;quot;0000&amp;quot;; MCU_PSCON_RTC_OFF = &amp;quot;0001&amp;quot;; MCU_PSCON_RTC_RET = &amp;quot;0010&amp;quot;; MCU_PSCON_RTC_OFF_TO_ON = &amp;quot;0011&amp;quot;; MCU_PSCON_RTC_RET_TO_ON = &amp;quot;0100&amp;quot;; MCU_PSCON_RTC_ON_TO_RET = &amp;quot;0101&amp;quot;; MCU_PSCON_RTC_ON_TO_OFF = &amp;quot;0110&amp;quot;; MCU_PSCON_RTC_RET_TO_ON_WAIT_OPP = &amp;quot;0111&amp;quot;; MCU_PSCON_RTC_OFF_TO_ON_WAIT_OPP = &amp;quot;1000&amp;quot;;</description>
              <bitWidth>3</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MCU_PSCON_SYS_PS</name>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEMSS_PWR_PS</name>
          <addressOffset>0x86C</addressOffset>
          <size>32</size>
          <description>MEMSS_PWR_PS</description>
          <fields>
            <field>
              <name>PWR_PS_MEMSS</name>
              <description>[2:0] MEMSS_PM_SLEEP = &amp;quot;000&amp;quot;; MEMSS_PM_WAIT_OPP = &amp;quot;010&amp;quot;; MEMSS_PM_ACTIVE = &amp;quot;011&amp;quot;; MEMSS_PM_SLEEP_TO_ACTIVE = &amp;quot;100&amp;quot;; MEMSS_PM_ACTIVE_TO_SLEEP = &amp;quot;101&amp;quot;;</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REF_FSM_DEBUG</name>
          <addressOffset>0x870</addressOffset>
          <size>32</size>
          <description>REF_FSM_DEBUG</description>
          <fields>
            <field>
              <name>FREF_MODE</name>
              <description>[5:4] 01 - HV Mode ; 10 - LV Mode ; 11 - XTAL Mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>REF_FSM_PS</name>
              <description>[3:0] constant FREF_CLK_OFF = &amp;quot;00000&amp;quot;; constant FREF_EN_BGAP = &amp;quot;00001&amp;quot;; constant FREF_EN_LDO = &amp;quot;00010&amp;quot;; constant FREF_EN_SLI_HV = &amp;quot;00011&amp;quot;; constant FREF_EN_SLI_HV_PD = &amp;quot;00100&amp;quot;; constant FREF_EN_DIG_BUF = &amp;quot;00101&amp;quot;; constant FREF_EN_OSC = &amp;quot;00110&amp;quot;; constant FREF_EN_SLI_LV = &amp;quot;00111&amp;quot;; constant FREF_EN_CLK_REQ = &amp;quot;01000&amp;quot;; constant FREF_CLK_VALID = &amp;quot;01001&amp;quot;; constant FREF_MODE_DET0 = &amp;quot;01010&amp;quot;; constant FREF_MODE_DET1 = &amp;quot;01011&amp;quot;; constant FREF_MODE_DET2 = &amp;quot;10010&amp;quot;; constant FREF_MODE_DET3 = &amp;quot;10011&amp;quot;; constant FREF_VALID = &amp;quot;01100&amp;quot;; constant FREF_VALID0 = &amp;quot;01101&amp;quot;; constant FREF_VALID1 = &amp;quot;01110&amp;quot;; constant FREF_VALID2 = &amp;quot;01111&amp;quot;; constant FREF_WAIT_EXT_TCXO0 = &amp;quot;10000&amp;quot;; constant FREF_WAIT_EXT_TCXO1 = &amp;quot;10001&amp;quot;;</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_SYS_OPP_REQ_OVERRIDE</name>
          <addressOffset>0x874</addressOffset>
          <size>32</size>
          <description>MEM_SYS_OPP_REQ_OVERRIDE</description>
          <fields>
            <field>
              <name>MEM_SYS_OPP_REQ_OVERRIDE</name>
              <description>[3:0] &amp;quot;0001&amp;quot; - RUN ; &amp;quot;0010&amp;quot; - DSLP ; &amp;quot;0100&amp;quot; - LPDS ; Others - NA</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_TESTCTRL_PD_OPP_CONFIG</name>
          <addressOffset>0x878</addressOffset>
          <size>32</size>
          <description>MEM_TESTCTRL_PD_OPP_CONFIG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_WL_FAST_CLK_REQ_OVERRIDES</name>
          <addressOffset>0x87C</addressOffset>
          <size>32</size>
          <description>MEM_WL_FAST_CLK_REQ_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_MCU_PD_MODE_REQ_OVERRIDES</name>
          <addressOffset>0x880</addressOffset>
          <size>32</size>
          <description>MEM_MCU_PD_MODE_REQ_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_MCSPI_SRAM_OFF_REQ_OVERRIDES</name>
          <addressOffset>0x884</addressOffset>
          <size>32</size>
          <description>MEM_MCSPI_SRAM_OFF_REQ_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
