jbuonagurio/fanboard/svd/CC32xxSF.svd
        <register>
          <name>MEM_WLAN_APLLMCS_OVERRIDES</name>
          <addressOffset>0x888</addressOffset>
          <size>32</size>
          <description>MEM_WLAN_APLLMCS_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_REF_FSM_CFG2</name>
          <addressOffset>0x88C</addressOffset>
          <size>32</size>
          <description>MEM_REF_FSM_CFG2</description>
          <fields>
            <field>
              <name>MEM_FC_DEASSERT_DELAY</name>
              <description>[21:19] Number of RTC clocks for keeping the FC_EN asserted high</description>
              <bitWidth>3</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>MEM_STARTUP_DEASSERT_DELAY</name>
              <description>[18:16] Number of RTC clocks for keeping the STARTUP_EN asserted high</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MEM_EXT_TCXO_SETTLING_TIME</name>
              <description>[15:0] Number of RTC clocks for waiting for clock to settle.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TESTCTRL_POWER_CTRL</name>
          <addressOffset>0xC10</addressOffset>
          <size>32</size>
          <description>TESTCTRL_POWER_CTRL</description>
          <fields>
            <field>
              <name>TESTCTRL_PD_STATUS</name>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SSDIO_POWER_CTRL</name>
          <addressOffset>0xC14</addressOffset>
          <size>32</size>
          <description>SSDIO_POWER_CTRL</description>
          <fields>
            <field>
              <name>SSDIO_PD_STATUS</name>
              <description>[2:1] 1 - SSDIO-PD is ON ; 0 - SSDIO-PD is OFF</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCSPI_N1_POWER_CTRL</name>
          <addressOffset>0xC18</addressOffset>
          <size>32</size>
          <description>MCSPI_N1_POWER_CTRL</description>
          <fields>
            <field>
              <name>MCSPI_N1_PD_STATUS</name>
              <description>[2:1] 1 - MCSPI_N1-PD is ON ; 0 - MCSPI_N1-PD if OFF</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WELP_POWER_CTRL</name>
          <addressOffset>0xC1C</addressOffset>
          <size>32</size>
          <description>WELP_POWER_CTRL</description>
          <fields>
            <field>
              <name>WTOP_PD_STATUS</name>
              <bitWidth>3</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>WELP_PD_STATUS</name>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WL_SDIO_POWER_CTRL</name>
          <addressOffset>0xC20</addressOffset>
          <size>32</size>
          <description>WL_SDIO_POWER_CTRL</description>
          <fields>
            <field>
              <name>WL_SDIO_PD_STATUS</name>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WLAN_SRAM_ACTIVE_PWR_CFG</name>
          <addressOffset>0xC24</addressOffset>
          <size>32</size>
          <description>WLAN_SRAM_ACTIVE_PWR_CFG</description>
          <fields>
            <field>
              <name>WLAN_SRAM_ACTIVE_PWR_CFG</name>
              <description>[23:0] SRAM (WTOP+DRP) state during Active-mode : 1 - SRAMs are ON ; 0 - SRAMs are OFF. Cluster information : [0] - 1st column of MEMSS (Applicable only when owned by WTOP/PHY) [1] - 2nd column of MEMSS (Applicable only when owned by WTOP/PHY) ; [2] - 3rd column of MEMSS (Applicable only when owned by WTOP/PHY) ; [3] - 4th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [4] - 5th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [5] - 6th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [6] - 7th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [7] - 8th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [8] - 9th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [9] - 10th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [10] - 11th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [11] - 12th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [12] - 13th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [13] - 14th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [14] - 15th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [15] - 16th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [23:16] - Internal to WTOP Cluster</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WLAN_SRAM_SLEEP_PWR_CFG</name>
          <addressOffset>0xC28</addressOffset>
          <size>32</size>
          <description>WLAN_SRAM_SLEEP_PWR_CFG</description>
          <fields>
            <field>
              <name>WLAN_SRAM_SLEEP_PWR_CFG</name>
              <description>[23:0] SRAM (WTOP+DRP) state during Sleep-mode : 1 - SRAMs are RET ; 0 - SRAMs are OFF. Cluster information : [0] - 1st column of MEMSS (Applicable only when owned by WTOP/PHY) [1] - 2nd column of MEMSS (Applicable only when owned by WTOP/PHY) ; [2] - 3rd column of MEMSS (Applicable only when owned by WTOP/PHY) ; [3] - 4th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [4] - 5th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [5] - 6th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [6] - 7th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [7] - 8th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [8] - 9th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [9] - 10th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [10] - 11th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [11] - 12th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [12] - 13th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [13] - 14th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [14] - 15th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [15] - 16th column of MEMSS (Applicable only when owned by WTOP/PHY) ; [23:16] - Internal to WTOP Cluster</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_SECURE_INIT_DONE</name>
          <addressOffset>0xC30</addressOffset>
          <size>32</size>
          <description>APPS_SECURE_INIT_DONE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_DEV_MODE_INIT_DONE</name>
          <addressOffset>0xC34</addressOffset>
          <size>32</size>
          <description>APPS_DEV_MODE_INIT_DONE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EN_APPS_REBOOT</name>
          <addressOffset>0xC38</addressOffset>
          <size>32</size>
          <description>EN_APPS_REBOOT</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_APPS_PERIPH_PRESENT</name>
          <addressOffset>0xC3C</addressOffset>
          <size>32</size>
          <description>MEM_APPS_PERIPH_PRESENT</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_NWP_PERIPH_PRESENT</name>
          <addressOffset>0xC40</addressOffset>
          <size>32</size>
          <description>MEM_NWP_PERIPH_PRESENT</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_SHARED_PERIPH_PRESENT</name>
          <addressOffset>0xC44</addressOffset>
          <size>32</size>
          <description>MEM_SHARED_PERIPH_PRESENT</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_PWR_STATE</name>
          <addressOffset>0xC48</addressOffset>
          <size>32</size>
          <description>NWP_PWR_STATE</description>
          <fields>
            <field>
              <name>NWP_PWR_STATE_PS</name>
              <description>[11:8] &amp;quot;0000&amp;quot;- PORZ :- NWP is yet to be enabled by APPS during powerup (from HIB/OFF) ; &amp;quot;0011&amp;quot;- ACTIVE :- NWP is enabled, clocks and resets to NWP-SubSystem are enabled ; &amp;quot;0010&amp;quot;- LPDS :- NWP is in LPDS-mode ; Clocks and reset to NWP-SubSystem are gated ; &amp;quot;0101&amp;quot;- WAIT_FOR_OPP :- NWP is in transition from LPDS to ACTIVE, where it is waiting for OPP to be stable ; &amp;quot;1000&amp;quot;- WAKE_TIMER_OPP_REQ :- NWP is in transition from LPDS, where the wakeup cause is LPDS_Wake timer OTHERS : NA</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>NWP_RCM_PS</name>
              <description>[2:0] &amp;quot;000&amp;quot; - NWP_RUN : NWP is in RUN state (default) - Applicable only when NWP_PWR_STATE_PS = ACTIVE ; &amp;quot;001&amp;quot; - NWP_SLP : NWP is in SLEEP state (default) - Applicable only when NWP_PWR_STATE_PS = ACTIVE ; &amp;quot;010&amp;quot; - NWP_DSLP : NWP is in Deep-Sleep state (default) - Applicable only when NWP_PWR_STATE_PS = ACTIVE ; &amp;quot;011&amp;quot; - WAIT_FOR_ACTIVE : NWP is in transition from Deep-sleep to Run, where it is waiting for OPP to be stable ; &amp;quot;100&amp;quot; - WAIT_FOR_DSLP_TIMER_WAKE_REQ : NWP is in transition from Deep-sleep to Run, where the wakeup cause is deep-sleep wake-timer</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_PWR_STATE</name>
          <addressOffset>0xC4C</addressOffset>
          <size>32</size>
          <description>APPS_PWR_STATE</description>
          <fields>
            <field>
              <name>APPS_PWR_STATE_PS</name>
              <description>[11:8] &amp;quot;0000&amp;quot;- PORZ :- APPS is waiting for PLL_clock during powerup (from HIB/OFF) ; &amp;quot;0011&amp;quot;- ACTIVE :- APPS is enabled, clocks and resets to APPS-SubSystem are enabled ; APPS might be either in Secure or Un-secure mode during this state. &amp;quot;1001&amp;quot; - SECURE_MODE_LPDS :- While in ACTIVE (Secure-mode), APPS had to program the DevInit_done bit at the end, after which it enters into this state, where the reset to APPS will be asserted. From this state APPS might either re-boot itself or enter into LPDS depending upon whether the device is 3200 or 3100. &amp;quot;0010&amp;quot;- LPDS :- APPS is in LPDS-mode ; Clocks and reset to APPS-SubSystem are gated ; &amp;quot;0101&amp;quot;- WAIT_FOR_OPP :- APPS is in transition from LPDS to ACTIVE, where it is waiting for OPP to be stable ; &amp;quot;1000&amp;quot; - WAKE_TIMER_OPP_REQ : APPS is in transition from LPDS, where the wakeup cause is LPDS_Wake timer ; &amp;quot;1010&amp;quot; - WAIT_FOR_PATCH_INIT : APPS enters into this state during development-mode #3 (SOP = 3), where it is waiting for patch download to complete and 0x4 hack is programmed. OTHERS : NA</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>APPS_RCM_PS</name>
              <description>[2:0] &amp;quot;000&amp;quot; - APPS_RUN : APPS is in RUN state (default) - Applicable only when APPS_PWR_STATE_PS = ACTIVE ; &amp;quot;001&amp;quot; - APPS_SLP : APPS is in SLEEP state (default) - Applicable only when APPS_PWR_STATE_PS = ACTIVE ; &amp;quot;010&amp;quot; - APPS_DSLP : APPS is in Deep-Sleep state (default) - Applicable only when APPS_PWR_STATE_PS = ACTIVE ; &amp;quot;011&amp;quot; - WAIT_FOR_ACTIVE : APPS is in transition from Deep-sleep to Run, where it is waiting for OPP to be stable ; &amp;quot;100&amp;quot; - WAIT_FOR_DSLP_TIMER_WAKE_REQ : APPS is in transition from Deep-sleep to Run, where the wakeup cause is deep-sleep wake-timer</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCU_PWR_STATE</name>
          <addressOffset>0xC50</addressOffset>
          <size>32</size>
          <description>MCU_PWR_STATE</description>
          <fields>
            <field>
              <name>MCU_OPP_PS</name>
              <description>[4:0] TBD</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WTOP_PM_PS</name>
          <addressOffset>0xC54</addressOffset>
          <size>32</size>
          <description>WTOP_PM_PS</description>
          <fields>
            <field>
              <name>WTOP_PM_PS</name>
              <description>[2:0] &amp;quot;011&amp;quot; - WTOP_PM_ACTIVE (Default) :- WTOP_Pd is in ACTIVE mode; &amp;quot;100&amp;quot; - WTOP_PM_ACTIVE_TO_SLEEP :- WTOP_Pd is in transition from ACTIVE to SLEEP ; &amp;quot;000&amp;quot; - WTOP_PM_SLEEP : WTOP-Pd is in Sleep-state ; &amp;quot;100&amp;quot; - WTOP_PM_SLEEP_TO_ACTIVE : WTOP_Pd is in transition from SLEEP to ACTIVE ; &amp;quot;000&amp;quot; - WTOP_PM_WAIT_FOR_OPP : Wait for OPP to be stable ;</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WTOP_PD_RESETZ_OVERRIDE_REG</name>
          <addressOffset>0xC58</addressOffset>
          <size>32</size>
          <description>WTOP_PD_RESETZ_OVERRIDE_REG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WELP_PD_RESETZ_OVERRIDE_REG</name>
          <addressOffset>0xC5C</addressOffset>
          <size>32</size>
          <description>WELP_PD_RESETZ_OVERRIDE_REG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WL_SDIO_PD_RESETZ_OVERRIDE_REG</name>
          <addressOffset>0xC60</addressOffset>
          <size>32</size>
          <description>WL_SDIO_PD_RESETZ_OVERRIDE_REG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SSDIO_PD_RESETZ_OVERRIDE_REG</name>
          <addressOffset>0xC64</addressOffset>
          <size>32</size>
          <description>SSDIO_PD_RESETZ_OVERRIDE_REG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCSPI_N1_PD_RESETZ_OVERRIDE_REG</name>
          <addressOffset>0xC68</addressOffset>
          <size>32</size>
          <description>MCSPI_N1_PD_RESETZ_OVERRIDE_REG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TESTCTRL_PD_RESETZ_OVERRIDE_REG</name>
          <addressOffset>0xC6C</addressOffset>
          <size>32</size>
          <description>TESTCTRL_PD_RESETZ_OVERRIDE_REG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCU_PD_RESETZ_OVERRIDE_REG</name>
          <addressOffset>0xC70</addressOffset>
          <size>32</size>
          <description>MCU_PD_RESETZ_OVERRIDE_REG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG0</name>
          <addressOffset>0xC78</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG1</name>
          <addressOffset>0xC7C</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG2</name>
          <addressOffset>0xC80</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG3</name>
          <addressOffset>0xC84</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WTOP_MEM_RET_CFG</name>
          <addressOffset>0xC88</addressOffset>
          <size>32</size>
          <description>WTOP_MEM_RET_CFG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>COEX_CLK_SWALLOW_CFG0</name>
          <addressOffset>0xC8C</addressOffset>
          <size>32</size>
          <description>COEX_CLK_SWALLOW_CFG0</description>
          <fields>
            <field>
              <name>Q_FACTOR</name>
              <description>[22:0] TBD</description>
              <bitWidth>23</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>COEX_CLK_SWALLOW_CFG1</name>
          <addressOffset>0xC90</addressOffset>
          <size>32</size>
          <description>COEX_CLK_SWALLOW_CFG1</description>
          <fields>
            <field>
              <name>P_FACTOR</name>
              <description>[19:0] TBD</description>
              <bitWidth>20</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>COEX_CLK_SWALLOW_CFG2</name>
          <addressOffset>0xC94</addressOffset>
          <size>32</size>
          <description>COEX_CLK_SWALLOW_CFG2</description>
          <fields>
            <field>
              <name>CONSECUTIVE_SWALLOW</name>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>COEX_CLK_SWALLOW_ENABLE</name>
          <addressOffset>0xC98</addressOffset>
          <size>32</size>
          <description>COEX_CLK_SWALLOW_ENABLE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DCDC_CLK_GEN_CONFIG</name>
          <addressOffset>0xC9C</addressOffset>
          <size>32</size>
          <description>DCDC_CLK_GEN_CONFIG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG4</name>
          <addressOffset>0xCA0</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG4</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG5</name>
          <addressOffset>0xCA4</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG5</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG6</name>
          <addressOffset>0xCA8</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG6</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG7</name>
          <addressOffset>0xCAC</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG7</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG8</name>
          <addressOffset>0xCB0</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG8</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG9</name>
          <addressOffset>0xCB4</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG9</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG10</name>
          <addressOffset>0xCB8</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG10</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG11</name>
          <addressOffset>0xCBC</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG11</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIEID_READ_REG0</name>
          <addressOffset>0xCC0</addressOffset>
          <size>32</size>
          <description>DIEID_READ_REG0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIEID_READ_REG1</name>
          <addressOffset>0xCC4</addressOffset>
          <size>32</size>
          <description>DIEID_READ_REG1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIEID_READ_REG2</name>
          <addressOffset>0xCC8</addressOffset>
          <size>32</size>
          <description>DIEID_READ_REG2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIEID_READ_REG3</name>
          <addressOffset>0xCCC</addressOffset>
          <size>32</size>
          <description>DIEID_READ_REG3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIEID_READ_REG4</name>
          <addressOffset>0xCD0</addressOffset>
          <size>32</size>
          <description>DIEID_READ_REG4</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_SS_OVERRIDES</name>
          <addressOffset>0xCD4</addressOffset>
          <size>32</size>
          <description>APPS_SS_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NWP_SS_OVERRIDES</name>
          <addressOffset>0xCD8</addressOffset>
          <size>32</size>
          <description>NWP_SS_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SHARED_SS_OVERRIDES</name>
          <addressOffset>0xCDC</addressOffset>
          <size>32</size>
          <description>SHARED_SS_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IDMEM_CORE_RST_OVERRIDES</name>
          <addressOffset>0xCE0</addressOffset>
          <size>32</size>
          <description>IDMEM_CORE_RST_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
