jbuonagurio/fanboard/svd/CC32xxSF.svd
        <register>
          <name>TOP_DIE_FSM_OVERRIDES</name>
          <addressOffset>0xCE4</addressOffset>
          <size>32</size>
          <description>TOP_DIE_FSM_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCU_PSCON_OVERRIDES</name>
          <addressOffset>0xCE8</addressOffset>
          <size>32</size>
          <description>MCU_PSCON_OVERRIDES</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>MEM_MCU_PSCON_MEM_OFF_OVERRIDE</name>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MEM_MCU_PSCON_MEM_RETAIN_OVERRIDE</name>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WTOP_PSCON_OVERRIDES</name>
          <addressOffset>0xCEC</addressOffset>
          <size>32</size>
          <description>WTOP_PSCON_OVERRIDES</description>
          <fields>
            <field>
              <name>MEM_WTOP_PSCON_MEM_OFF_OVERRIDE</name>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MEM_WTOP_PSCON_MEM_RETAIN_OVERRIDE</name>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WELP_PSCON_OVERRIDES</name>
          <addressOffset>0xCF0</addressOffset>
          <size>32</size>
          <description>WELP_PSCON_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WL_SDIO_PSCON_OVERRIDES</name>
          <addressOffset>0xCF4</addressOffset>
          <size>32</size>
          <description>WL_SDIO_PSCON_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCSPI_PSCON_OVERRIDES</name>
          <addressOffset>0xCF8</addressOffset>
          <size>32</size>
          <description>MCSPI_PSCON_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SSDIO_PSCON_OVERRIDES</name>
          <addressOffset>0xCFC</addressOffset>
          <size>32</size>
          <description>SSDIO_PSCON_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OCP_SHARED</name>
      <baseAddress>0x4402E000</baseAddress>
      <registers>
        <register>
          <name>SEMAPHORE1</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>SEMAPHORE1</description>
          <fields>
            <field>
              <name>MEM_SEMAPHORE1</name>
              <description>[1:0] General Purpose Semaphore for SW Usage. If any of the 2 bits of a given register is set to 1, it means that the semaphore is locked by one of the masters. Each bit represents a master IP as follows: {WLAN,NWP}. The JTAG cannot capture the semaphore but it can release it. As a master IP reads the semaphore, it will be caputed and the masters correlating bit will be set to 1 (set upon read). As any IP writes to this address (independent of the written data) the semaphore will be set to 2'b00.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE2</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>SEMAPHORE2</description>
          <fields>
            <field>
              <name>MEM_SEMAPHORE2</name>
              <description>[1:0] General Purpose Semaphore for SW Usage. If any of the 2 bits of a given register is set to 1, it means that the semaphore is locked by one of the masters. Each bit represents a master IP as follows: {WLAN,NWP}. The JTAG cannot capture the semaphore but it can release it. As a master IP reads the semaphore, it will be caputed and the masters correlating bit will be set to 1 (set upon read). As any IP writes to this address (independent of the written data) the semaphore will be set to 2'b00.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE3</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>SEMAPHORE3</description>
          <fields>
            <field>
              <name>MEM_SEMAPHORE3</name>
              <description>[1:0] General Purpose Semaphore for SW Usage. If any of the 2 bits of a given register is set to 1, it means that the semaphore is locked by one of the masters. Each bit represents a master IP as follows: {WLAN,NWP}. The JTAG cannot capture the semaphore but it can release it. As a master IP reads the semaphore, it will be caputed and the masters correlating bit will be set to 1 (set upon read). As any IP writes to this address (independent of the written data) the semaphore will be set to 2'b00.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE4</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>SEMAPHORE4</description>
          <fields>
            <field>
              <name>MEM_SEMAPHORE4</name>
              <description>[1:0] General Purpose Semaphore for SW Usage. If any of the 2 bits of a given register is set to 1, it means that the semaphore is locked by one of the masters. Each bit represents a master IP as follows: {WLAN,NWP}. The JTAG cannot capture the semaphore but it can release it. As a master IP reads the semaphore, it will be caputed and the masters correlating bit will be set to 1 (set upon read). As any IP writes to this address (independent of the written data) the semaphore will be set to 2'b00.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE5</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>SEMAPHORE5</description>
          <fields>
            <field>
              <name>MEM_SEMAPHORE5</name>
              <description>[1:0] General Purpose Semaphore for SW Usage. If any of the 2 bits of a given register is set to 1, it means that the semaphore is locked by one of the masters. Each bit represents a master IP as follows: {WLAN,NWP}. The JTAG cannot capture the semaphore but it can release it. As a master IP reads the semaphore, it will be caputed and the masters correlating bit will be set to 1 (set upon read). As any IP writes to this address (independent of the written data) the semaphore will be set to 2'b00.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE6</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>SEMAPHORE6</description>
          <fields>
            <field>
              <name>MEM_SEMAPHORE6</name>
              <description>[1:0] General Purpose Semaphore for SW Usage. If any of the 2 bits of a given register is set to 1, it means that the semaphore is locked by one of the masters. Each bit represents a master IP as follows: {WLAN,NWP}. The JTAG cannot capture the semaphore but it can release it. As a master IP reads the semaphore, it will be caputed and the masters correlating bit will be set to 1 (set upon read). As any IP writes to this address (independent of the written data) the semaphore will be set to 2'b00.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE7</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>SEMAPHORE7</description>
          <fields>
            <field>
              <name>MEM_SEMAPHORE7</name>
              <description>[1:0] General Purpose Semaphore for SW Usage. If any of the 2 bits of a given register is set to 1, it means that the semaphore is locked by one of the masters. Each bit represents a master IP as follows: {WLAN,NWP}. The JTAG cannot capture the semaphore but it can release it. As a master IP reads the semaphore, it will be caputed and the masters correlating bit will be set to 1 (set upon read). As any IP writes to this address (independent of the written data) the semaphore will be set to 2'b00.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE8</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>SEMAPHORE8</description>
          <fields>
            <field>
              <name>MEM_SEMAPHORE8</name>
              <description>[1:0] General Purpose Semaphore for SW Usage. If any of the 2 bits of a given register is set to 1, it means that the semaphore is locked by one of the masters. Each bit represents a master IP as follows: {WLAN,NWP}. The JTAG cannot capture the semaphore but it can release it. As a master IP reads the semaphore, it will be caputed and the masters correlating bit will be set to 1 (set upon read). As any IP writes to this address (independent of the written data) the semaphore will be set to 2'b00.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE9</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>SEMAPHORE9</description>
          <fields>
            <field>
              <name>MEM_SEMAPHORE9</name>
              <description>[1:0] General Purpose Semaphore for SW Usage. If any of the 2 bits of a given register is set to 1, it means that the semaphore is locked by one of the masters. Each bit represents a master IP as follows: {WLAN,NWP}. The JTAG cannot capture the semaphore but it can release it. As a master IP reads the semaphore, it will be caputed and the masters correlating bit will be set to 1 (set upon read). As any IP writes to this address (independent of the written data) the semaphore will be set to 2'b00.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE10</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>SEMAPHORE10</description>
          <fields>
            <field>
              <name>MEM_SEMAPHORE10</name>
              <description>[1:0] General Purpose Semaphore for SW Usage. If any of the 2 bits of a given register is set to 1, it means that the semaphore is locked by one of the masters. Each bit represents a master IP as follows: {WLAN,NWP}. The JTAG cannot capture the semaphore but it can release it. As a master IP reads the semaphore, it will be caputed and the masters correlating bit will be set to 1 (set upon read). As any IP writes to this address (independent of the written data) the semaphore will be set to 2'b00.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE11</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>SEMAPHORE11</description>
          <fields>
            <field>
              <name>MEM_SEMAPHORE11</name>
              <description>[1:0] General Purpose Semaphore for SW Usage. If any of the 2 bits of a given register is set to 1, it means that the semaphore is locked by one of the masters. Each bit represents a master IP as follows: {WLAN,NWP}. The JTAG cannot capture the semaphore but it can release it. As a master IP reads the semaphore, it will be caputed and the masters correlating bit will be set to 1 (set upon read). As any IP writes to this address (independent of the written data) the semaphore will be set to 2'b00.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORE12</name>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <description>SEMAPHORE12</description>
          <fields>
            <field>
              <name>MEM_SEMAPHORE12</name>
              <description>[1:0] General Purpose Semaphore for SW Usage. If any of the 2 bits of a given register is set to 1, it means that the semaphore is locked by one of the masters. Each bit represents a master IP as follows: {WLAN,NWP}. The JTAG cannot capture the semaphore but it can release it. As a master IP reads the semaphore, it will be caputed and the masters correlating bit will be set to 1 (set upon read). As any IP writes to this address (independent of the written data) the semaphore will be set to 2'b00.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IC_LOCKER_ID</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>IC_LOCKER_ID</description>
          <fields>
            <field>
              <name>MEM_IC_LOCKER_ID</name>
              <description>[2:0] This register is used for allowing only one master OCP to perform write transactions to the OCP slaves. Each bit represents an IP in the following format: { JTAG,WLAN, NWP mcu}. As any of the bits is set to one, the correlating IP is preventing the other IP's from performing write transactions to the slaves. As the Inter Connect is locked, the only the locking IP can write to the register and by that releasing the lock. 3'b000 => IC is not locked. 3'b001 => IC is locked by NWP mcu. 3'b010 => IC is locked by WLAN. 3'b100 => IC is locked by JTAG.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MCU_SEMAPHORE_PEND</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>MCU_SEMAPHORE_PEND</description>
          <fields>
            <field>
              <name>MEM_MCU_SEMAPHORE_PEND</name>
              <description>[15:0] This register specifies the semaphore for which the NWP mcu is waiting to be released. It is set to the serial number of a given locked semaphore after it was read by the NWP mcu. Only [11:0] is used.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WL_SEMAPHORE_PEND</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>WL_SEMAPHORE_PEND</description>
          <fields>
            <field>
              <name>MEM_WL_SEMAPHORE_PEND</name>
              <description>[15:0] This register specifies the semaphore for which the WLAN is waiting to be released. It is set to the serial number of a given locked semaphore after it was read by the WLAN. Only [11:0] is used.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PLATFORM_DETECTION_RD_ONLY</name>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <description>PLATFORM_DETECTION_RD_ONLY</description>
          <fields>
            <field>
              <name>PLATFORM_DETECTION</name>
              <description>[15:0] This information serves the IPs for knowing in which platform are they integrated at: 0 = CC31XX.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SEMAPHORES_STATUS_RD_ONLY</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>SEMAPHORES_STATUS_RD_ONLY</description>
          <fields>
            <field>
              <name>SEMAPHORES_STATUS</name>
              <description>[11:0] Captured/released semaphores status for the 12 semaphores. Each bit of the 12 bits represents a semaphore. 0 => Semaphore Free. 1 => Semaphore Captured.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC3XX_CONFIG_CTRL</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>CC3XX_CONFIG_CTRL</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC3XX_SHARED_MEM_SEL_LSB</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>CC3XX_SHARED_MEM_SEL_LSB</description>
          <fields>
            <field>
              <name>MEM_SHARED_MEM_SEL_LSB</name>
              <description>[29:0] This register provides memss RAM column configuration for column 0 to 9. 3 bits are allocated per column. This register is required to be configured before starting RAM access. Changing register setting while code is running will result into unpredictable memory behaviour. Register is supported to configured ones after core is booted up. 3 bit encoding per column is as follows: when 000 : WLAN, 001: NWP, 010: APPS, 011: PHY, 100: OCLA column 0 select: bit [2:0] :when 000 -> WLAN,001 -> NWP,010 -> APPS, 011 -> PHY, 100 -> OCLA column 1 select: bit [5:3] :column 2 select: bit [8 : 6]: column 3 select : bit [11: 9] column 4 select : bit [14:12] column 5 select : bit [17:15] column 6 select : bit [20:18] column 7 select : bit [23:21] column 8 select : bit [26:24] column 9 select : bit [29:27] column 10 select</description>
              <bitWidth>30</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC3XX_SHARED_MEM_SEL_MSB</name>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <description>CC3XX_SHARED_MEM_SEL_MSB</description>
          <fields>
            <field>
              <name>MEM_SHARED_MEM_SEL_MSB</name>
              <description>[11:0] This register provides memss RAM column configuration for column 10 to 15. 3 bits are allocated per column. This register is required to be configured before starting RAM access. Changing register setting while code is running will result into unpredictable memory behaviour. Register is supported to configured ones after core is booted up. 3 bit encoding per column is as follows: when 000 : WLAN, 001: NWP, 010: APPS, 011: PHY, 100: OCLA column 11 select : bit [2:0] column 12 select : bit [5:3] column 13 select : bit [8 : 6] column 14 select :</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>WLAN_ELP_WAKE_EN</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>WLAN_ELP_WAKE_EN</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DEVINIT_ROM_START_ADDR</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>DEVINIT_ROM_START_ADDR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DEVINIT_ROM_END_ADDR</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>DEVINIT_ROM_END_ADDR</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SSBD_SEED</name>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <description>SSBD_SEED</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SSBD_CHK</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>SSBD_CHK</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SSBD_POLY_SEL</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>SSBD_POLY_SEL</description>
          <fields>
            <field>
              <name>MEM_SSBD_POLY_SEL</name>
              <description>[1:0] 2 bit, Writable only during devinit, and whole 2 bit should be output of the config register module.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SPARE_REG_0</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>SPARE_REG_0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SPARE_REG_1</name>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <description>SPARE_REG_1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SPARE_REG_2</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>SPARE_REG_2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SPARE_REG_3</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>SPARE_REG_3</description>
          <resetValue>0</resetValue>
        </register>
