jbuonagurio/fanboard/svd/CC32xxSF.svd
        <register>
          <name>GPIO_PAD_CONFIG_21</name>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <description>GPIO_PAD_CONFIG_21</description>
          <fields>
            <field>
              <name>MEM_GPIO_PAD_CONFIG_21</name>
              <description>[11:0] GPIO 0 register: &amp;quot;Bit 0 - 3 is used for PAD IO mode selection. io_register={ &amp;quot;&amp;quot; 0 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[0]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 1 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[1]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 2 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[2]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 3 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[3]&amp;quot;&amp;quot;&amp;quot;&amp;quot; 4 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IODEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> When level 1 this disables the PMOS xtors of the output stages making them open-drain type.&amp;quot; it can be used for I2C type of peripherals. 5 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I2MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 2mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 6 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I4MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 4mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 7 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I8MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 8mA output stage. Note: any drive strength between 2mA and 14mA can be obtained with combination of 2mA 4mA and 8mA.&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 8 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPUEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull up (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 9 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPDEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull down (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 10 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IOE_N&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable value. level 0 enables the IDO to PAD path. Else PAD is tristated (except for the PU/PD which are independent).&amp;quot; &amp;quot;Value gets latched at rising edge of RET33&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 11 =>&amp;quot;&amp;quot;&amp;quot;&amp;quot; IOE_N_OV&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable overirde. when bit is set to logic '1' IOE_N (bit 4) value will control IO IOE_N signal else IOE_N is control via selected HW logic. strong PULL UP and PULL Down control is disabled for all IO's. both controls are tied to logic level '0'.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_22</name>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <description>GPIO_PAD_CONFIG_22</description>
          <fields>
            <field>
              <name>MEM_GPIO_PAD_CONFIG_22</name>
              <description>[11:0] GPIO 0 register: &amp;quot;Bit 0 - 3 is used for PAD IO mode selection. io_register={ &amp;quot;&amp;quot; 0 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[0]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 1 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[1]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 2 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[2]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 3 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[3]&amp;quot;&amp;quot;&amp;quot;&amp;quot; 4 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IODEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> When level 1 this disables the PMOS xtors of the output stages making them open-drain type.&amp;quot; it can be used for I2C type of peripherals. 5 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I2MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 2mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 6 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I4MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 4mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 7 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I8MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 8mA output stage. Note: any drive strength between 2mA and 14mA can be obtained with combination of 2mA 4mA and 8mA.&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 8 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPUEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull up (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 9 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPDEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull down (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 10 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IOE_N&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable value. level 0 enables the IDO to PAD path. Else PAD is tristated (except for the PU/PD which are independent).&amp;quot; &amp;quot;Value gets latched at rising edge of RET33&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 11 =>&amp;quot;&amp;quot;&amp;quot;&amp;quot; IOE_N_OV&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable overirde. when bit is set to logic '1' IOE_N (bit 4) value will control IO IOE_N signal else IOE_N is control via selected HW logic. strong PULL UP and PULL Down control is disabled for all IO's. both controls are tied to logic level '0'.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_23</name>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <description>GPIO_PAD_CONFIG_23</description>
          <fields>
            <field>
              <name>MEM_GPIO_PAD_CONFIG_23</name>
              <description>[11:0] GPIO 0 register: &amp;quot;Bit 0 - 3 is used for PAD IO mode selection. io_register={ &amp;quot;&amp;quot; 0 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[0]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 1 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[1]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 2 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[2]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 3 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[3]&amp;quot;&amp;quot;&amp;quot;&amp;quot; 4 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IODEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> When level 1 this disables the PMOS xtors of the output stages making them open-drain type.&amp;quot; it can be used for I2C type of peripherals. 5 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I2MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 2mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 6 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I4MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 4mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 7 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I8MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 8mA output stage. Note: any drive strength between 2mA and 14mA can be obtained with combination of 2mA 4mA and 8mA.&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 8 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPUEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull up (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 9 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPDEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull down (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 10 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IOE_N&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable value. level 0 enables the IDO to PAD path. Else PAD is tristated (except for the PU/PD which are independent).&amp;quot; &amp;quot;Value gets latched at rising edge of RET33&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 11 =>&amp;quot;&amp;quot;&amp;quot;&amp;quot; IOE_N_OV&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable overirde. when bit is set to logic '1' IOE_N (bit 4) value will control IO IOE_N signal else IOE_N is control via selected HW logic. strong PULL UP and PULL Down control is disabled for all IO's. both controls are tied to logic level '0'.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_24</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>GPIO_PAD_CONFIG_24</description>
          <fields>
            <field>
              <name>MEM_GPIO_PAD_CONFIG_24</name>
              <description>[11:0] GPIO 0 register: &amp;quot;Bit 0 - 3 is used for PAD IO mode selection. io_register={ &amp;quot;&amp;quot; 0 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[0]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 1 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[1]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 2 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[2]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 3 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[3]&amp;quot;&amp;quot;&amp;quot;&amp;quot; 4 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IODEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> When level 1 this disables the PMOS xtors of the output stages making them open-drain type.&amp;quot; it can be used for I2C type of peripherals. 5 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I2MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 2mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 6 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I4MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 4mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 7 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I8MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 8mA output stage. Note: any drive strength between 2mA and 14mA can be obtained with combination of 2mA 4mA and 8mA.&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 8 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPUEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull up (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 9 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPDEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull down (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 10 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IOE_N&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable value. level 0 enables the IDO to PAD path. Else PAD is tristated (except for the PU/PD which are independent).&amp;quot; &amp;quot;Value gets latched at rising edge of RET33&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 11 =>&amp;quot;&amp;quot;&amp;quot;&amp;quot; IOE_N_OV&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable overirde. when bit is set to logic '1' IOE_N (bit 4) value will control IO IOE_N signal else IOE_N is control via selected HW logic. strong PULL UP and PULL Down control is disabled for all IO's. both controls are tied to logic level '0'.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_25</name>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <description>GPIO_PAD_CONFIG_25</description>
          <fields>
            <field>
              <name>MEM_GPIO_PAD_CONFIG_25</name>
              <description>[11:0] GPIO 0 register: &amp;quot;Bit 0 - 3 is used for PAD IO mode selection. io_register={ &amp;quot;&amp;quot; 0 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[0]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 1 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[1]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 2 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[2]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 3 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[3]&amp;quot;&amp;quot;&amp;quot;&amp;quot; 4 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IODEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> When level 1 this disables the PMOS xtors of the output stages making them open-drain type.&amp;quot; it can be used for I2C type of peripherals. 5 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I2MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 2mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 6 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I4MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 4mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 7 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I8MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 8mA output stage. Note: any drive strength between 2mA and 14mA can be obtained with combination of 2mA 4mA and 8mA.&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 8 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPUEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull up (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 9 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPDEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull down (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 10 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IOE_N&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable value. level 0 enables the IDO to PAD path. Else PAD is tristated (except for the PU/PD which are independent).&amp;quot; &amp;quot;Value gets latched at rising edge of RET33&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 11 =>&amp;quot;&amp;quot;&amp;quot;&amp;quot; IOE_N_OV&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable overirde. when bit is set to logic '1' IOE_N (bit 4) value will control IO IOE_N signal else IOE_N is control via selected HW logic. strong PULL UP and PULL Down control is disabled for all IO's. both controls are tied to logic level '0'.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_26</name>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <description>GPIO_PAD_CONFIG_26</description>
          <fields>
            <field>
              <name>MEM_GPIO_PAD_CONFIG_26</name>
              <description>[11:0] GPIO 0 register: &amp;quot;Bit 0 - 3 is used for PAD IO mode selection. io_register={ &amp;quot;&amp;quot; 0 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[0]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 1 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[1]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 2 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[2]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 3 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[3]&amp;quot;&amp;quot;&amp;quot;&amp;quot; 4 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IODEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> When level 1 this disables the PMOS xtors of the output stages making them open-drain type.&amp;quot; it can be used for I2C type of peripherals. 5 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I2MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 2mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 6 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I4MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 4mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 7 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I8MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 8mA output stage. Note: any drive strength between 2mA and 14mA can be obtained with combination of 2mA 4mA and 8mA.&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 8 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPUEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull up (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 9 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPDEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull down (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 10 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IOE_N&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable value. level 0 enables the IDO to PAD path. Else PAD is tristated (except for the PU/PD which are independent).&amp;quot; &amp;quot;Value gets latched at rising edge of RET33&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 11 =>&amp;quot;&amp;quot;&amp;quot;&amp;quot; IOE_N_OV&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable overirde. when bit is set to logic '1' IOE_N (bit 4) value will control IO IOE_N signal else IOE_N is control via selected HW logic. strong PULL UP and PULL Down control is disabled for all IO's. both controls are tied to logic level '0'.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_27</name>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <description>GPIO_PAD_CONFIG_27</description>
          <fields>
            <field>
              <name>MEM_GPIO_PAD_CONFIG_27</name>
              <description>[11:0] GPIO 0 register: &amp;quot;Bit 0 - 3 is used for PAD IO mode selection. io_register={ &amp;quot;&amp;quot; 0 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[0]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 1 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[1]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 2 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[2]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 3 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[3]&amp;quot;&amp;quot;&amp;quot;&amp;quot; 4 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IODEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> When level 1 this disables the PMOS xtors of the output stages making them open-drain type.&amp;quot; it can be used for I2C type of peripherals. 5 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I2MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 2mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 6 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I4MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 4mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 7 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I8MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 8mA output stage. Note: any drive strength between 2mA and 14mA can be obtained with combination of 2mA 4mA and 8mA.&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 8 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPUEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull up (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 9 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPDEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull down (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 10 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IOE_N&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable value. level 0 enables the IDO to PAD path. Else PAD is tristated (except for the PU/PD which are independent).&amp;quot; &amp;quot;Value gets latched at rising edge of RET33&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 11 =>&amp;quot;&amp;quot;&amp;quot;&amp;quot; IOE_N_OV&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable overirde. when bit is set to logic '1' IOE_N (bit 4) value will control IO IOE_N signal else IOE_N is control via selected HW logic. strong PULL UP and PULL Down control is disabled for all IO's. both controls are tied to logic level '0'.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
