jbuonagurio/fanboard/svd/CC32xxSF.svd
        <register>
          <name>GPIO_PAD_CONFIG_37</name>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <description>GPIO_PAD_CONFIG_37</description>
          <fields>
            <field>
              <name>MEM_GPIO_PAD_CONFIG_37</name>
              <description>[5:0] GPIO 0 register: &amp;quot;Bit 0 - 3 is used for PAD IO mode selection. io_register={ &amp;quot;&amp;quot; 0 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[0]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 1 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[1]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 2 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[2]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 3 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[3]&amp;quot;&amp;quot;&amp;quot;&amp;quot; 4 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IOE_N&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable value. level 0 enables the IDO to PAD path. Else PAD is tristated (except for the PU/PD which are independent).&amp;quot; &amp;quot;Value gets latched at rising edge of RET33&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 5 =>&amp;quot;&amp;quot;&amp;quot;&amp;quot; IOE_N_OV&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable overirde. when bit is set to logic '1' IOE_N (bit 4) value will control IO IOE_N signal else IOE_N is control via selected HW logic. strong PULL UP and PULL Down control is disabled for all IO's. both controls are tied to logic level '0'. IODEN and I8MAEN is diesabled for all development IO's. These signals are tied to logic level '0'. common control is implemented for I2MAEN, I4MAEN, WKPU, WKPD control . refer dev_pad_cmn_config register bits.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_38</name>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <description>GPIO_PAD_CONFIG_38</description>
          <fields>
            <field>
              <name>MEM_GPIO_PAD_CONFIG_38</name>
              <description>[5:0] GPIO 0 register: &amp;quot;Bit 0 - 3 is used for PAD IO mode selection. io_register={ &amp;quot;&amp;quot; 0 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[0]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 1 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[1]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 2 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[2]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 3 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[3]&amp;quot;&amp;quot;&amp;quot;&amp;quot; 4 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IOE_N&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable value. level 0 enables the IDO to PAD path. Else PAD is tristated (except for the PU/PD which are independent).&amp;quot; &amp;quot;Value gets latched at rising edge of RET33&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 5 =>&amp;quot;&amp;quot;&amp;quot;&amp;quot; IOE_N_OV&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable overirde. when bit is set to logic '1' IOE_N (bit 4) value will control IO IOE_N signal else IOE_N is control via selected HW logic. strong PULL UP and PULL Down control is disabled for all IO's. both controls are tied to logic level '0'. IODEN and I8MAEN is diesabled for all development IO's. These signals are tied to logic level '0'. common control is implemented for I2MAEN, I4MAEN, WKPU, WKPD control . refer dev_pad_cmn_config register bits.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_39</name>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <description>GPIO_PAD_CONFIG_39</description>
          <fields>
            <field>
              <name>MEM_GPIO_PAD_CONFIG_39</name>
              <description>[5:0] GPIO 0 register: &amp;quot;Bit 0 - 3 is used for PAD IO mode selection. io_register={ &amp;quot;&amp;quot; 0 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[0]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 1 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[1]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 2 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[2]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 3 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[3]&amp;quot;&amp;quot;&amp;quot;&amp;quot; 4 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IOE_N&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable value. level 0 enables the IDO to PAD path. Else PAD is tristated (except for the PU/PD which are independent).&amp;quot; &amp;quot;Value gets latched at rising edge of RET33&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 5 =>&amp;quot;&amp;quot;&amp;quot;&amp;quot; IOE_N_OV&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable overirde. when bit is set to logic '1' IOE_N (bit 4) value will control IO IOE_N signal else IOE_N is control via selected HW logic. strong PULL UP and PULL Down control is disabled for all IO's. both controls are tied to logic level '0'. IODEN and I8MAEN is diesabled for all development IO's. These signals are tied to logic level '0'. common control is implemented for I2MAEN, I4MAEN, WKPU, WKPD control . refer dev_pad_cmn_config register bits.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_40</name>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <description>GPIO_PAD_CONFIG_40</description>
          <fields>
            <field>
              <name>MEM_GPIO_PAD_CONFIG_40</name>
              <description>[18:0] GPIO 0 register: &amp;quot;Bit 0 - 3 is used for PAD IO mode selection. io_register={ &amp;quot;&amp;quot; 0 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[0]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 1 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[1]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 2 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[2]&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot; 3 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;CONFMODE[3]&amp;quot;&amp;quot;&amp;quot;&amp;quot; 4 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IODEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> When level 1 this disables the PMOS xtors of the output stages making them open-drain type.&amp;quot; &amp;quot;For example in case of I2C Value gets latched at rising edge of RET33.&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 5 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I2MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 2mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 6 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I4MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 4mA output stage&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 7 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;I8MAEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> Level 1 enables the approx 8mA output stage. Note: any drive strength between 2mA and 14mA can be obtained with combination of 2mA 4mA and 8mA.&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 8 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPUEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull up (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 9 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IWKPDEN&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> 10uA pull down (weak strength)&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 10 => &amp;quot;&amp;quot;&amp;quot;&amp;quot;IOE_N&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable value. level 0 enables the IDO to PAD path. Else PAD is tristated (except for the PU/PD which are independent).&amp;quot; &amp;quot;Value gets latched at rising edge of RET33&amp;quot;&amp;quot;&amp;quot; &amp;quot;&amp;quot;&amp;quot; 11 =>&amp;quot;&amp;quot;&amp;quot;&amp;quot; IOE_N_OV&amp;quot;&amp;quot;&amp;quot;&amp;quot; --> output enable overirde. when bit is set to logic '1' IOE_N (bit 4) value will control IO IOE_N signal else IOE_N is control via selected HW logic. strong PULL UP and PULL Down control is disabled for all IO's. both controls are tied to logic level '0'.</description>
              <bitWidth>19</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPIO_PAD_CMN_CONFIG</name>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <description>This register provide control to GPIO_CC3XXV1 IO PAD. Common control signals to all bottom Die IO's are controlled via this.</description>
          <fields>
            <field>
              <name>MEM_PAD_HYSTVAL</name>
              <description>[4:3] 00: hysteriris = 10% of VDDS (difference between upper and lower threshold of the schmit trigger) 01: hysteriris = 20% of VDDS (difference between upper and lower threshold of the schmit trigger) 10: hysteriris = 30% of VDDS (difference between upper and lower threshold of the schmit trigger) 11: hysteriris = 40% of VDDS (difference between upper and lower threshold of the schmit trigger)&amp;quot; &amp;quot;&amp;quot;&amp;quot;</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>D2D_DEV_PAD_CMN_CONFIG</name>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <description>D2D_DEV_PAD_CMN_CONFIG</description>
          <fields>
            <field>
              <name>MEM_DEV_PAD_CMN_CONF</name>
              <description>[5:0] this register implements common IO control to all devement mode PADs; these PADs are DEV_PAD33 to DEV_PAD39. Bit [1:0] : Drive strength control. These 2 bits are connected to DEV PAD drive strength control. possible drive stregnths are 2MA, 4MA and 6 MA for the these IO's. bit 0: when set to logic value '1' enable 2MA drive strength for DEVPAD01 to 07 bit 1: when set to logic value '1' enable 4MA drive strength for DEVPAD01 to 07. bit[3:2] : WK PULL UP and PULL down control. These 2 bits provide IWKPUEN and IWKPDEN control for all DEV IO's. bit 2: when set to logic value '1' enable WKPU to DEVPAD01 to 07 bit 3: when set to logic value '1' enable WKPD to DEVPAD01 to 07. bit 4: WK PULL control for DEV_PKG_DETECT pin. when '1' pullup enabled else it is disable. bit 5: when set to logic value '1' enable 8MA drive strength for DEVPAD01 to 07.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>D2D_TOSTACK_PAD_CONF</name>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <description>D2D_TOSTACK_PAD_CONF</description>
          <fields>
            <field>
              <name>MEM_D2D_TOSTACK_PAD_CONF</name>
              <description>[28:0] OEN/OEN2X control. When 0 : Act as input buffer else output buffer with drive strength 2. this register control OEN2X pin of D2D TOSTACK PAD: OEN1X and OEN2X decoding is as follows: &amp;quot;when &amp;quot;&amp;quot;00&amp;quot;&amp;quot; :&amp;quot; &amp;quot;when &amp;quot;&amp;quot;01&amp;quot;&amp;quot; : dirve strength is '1' and output buffer enabled.&amp;quot; &amp;quot;when &amp;quot;&amp;quot;10&amp;quot;&amp;quot; : drive strength is 2 and output buffer is disabled.&amp;quot; &amp;quot;when &amp;quot;&amp;quot;11&amp;quot;&amp;quot; : dirve strength is '3' and output buffer enabled.&amp;quot;</description>
              <bitWidth>29</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>D2D_MISC_PAD_CONF</name>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <description>D2D_MISC_PAD_CONF</description>
          <fields>
            <field>
              <name>MEM_D2D_SPARE</name>
              <description>[2:0] D2D SPARE PAD OEN/OEN2X control. When 0: Act as input buffer else output buffer with drive strength 2.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SOP_CONF_OVERRIDE</name>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <description>SOP_CONF_OVERRIDE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC3XX_DEBUGSS_STATUS</name>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <description>CC3XX_DEBUGSS_STATUS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC3XX_DEBUGMUX_SEL</name>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <description>CC3XX_DEBUGMUX_SEL</description>
          <fields>
            <field>
              <name>MEM_CC3XX_DEBUGMUX_SEL</name>
              <description>[15:0] debug mux select register. Upper 8 bits are used for debug module selection. Lower 8 bit [7:0] used inside debug module for selecting module specific signals. Bits[15:8: when set x&amp;quot;00&amp;quot; : GPRCM debug bus. When &amp;quot;o1&amp;quot; : SDIO debug debug bus when x&amp;quot;02&amp;quot; : autonoumous SPI when x&amp;quot;03&amp;quot; : TOPIC when x&amp;quot;04&amp;quot;: memss when x&amp;quot;25&amp;quot;: mcu debug bus : APPS debug when x&amp;quot;45&amp;quot;: mcu debug bus : NWP debug when x&amp;quot;65&amp;quot;: mcu debug bus : AHB2VBUS debug when x&amp;quot;85&amp;quot;: mcu debug bus : VBUS2HAB debug when x&amp;quot;95&amp;quot;: mcu debug bus : RCM debug when x&amp;quot;A5&amp;quot;: mcu debug bus : crypto debug when x&amp;quot;06&amp;quot;: WLAN debug bus when x&amp;quot;07&amp;quot;: debugss bus when x&amp;quot;08&amp;quot;: ADC debug when x&amp;quot;09&amp;quot;: SDIO PHY debug bus then &amp;quot;others&amp;quot; : no debug is selected</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ALT_PC_VAL_NW</name>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <description>ALT_PC_VAL_NW</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ALT_PC_VAL_APPS</name>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <description>ALT_PC_VAL_APPS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SPARE_REG_4</name>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <description>SPARE_REG_4</description>
          <fields>
            <field>
              <name>MEM_SPARE_REG_4</name>
              <description>[31:1] HW register</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SPARE_REG_5</name>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <description>SPARE_REG_5</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SH_SPI_CS_MASK</name>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <description>SH_SPI_CS_MASK</description>
          <fields>
            <field>
              <name>MEM_SH_SPI_CS_MASK</name>
              <description>[3:0] ( chip select 0 is unmasked after reset. When 1 : CS is unmasked or else masked. Valid configurations are 1000, 0100, 0010 or 0001. Any other setting can lead to unpredictable behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC3XX_DEVICE_TYPE</name>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <description>CC3XX_DEVICE_TYPE</description>
          <fields>
            <field>
              <name>DEVICE_TYPE</name>
              <description>[4:0] CC3XX Device type information.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_TOPMUXCTRL_IFORCE</name>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <description>MEM_TOPMUXCTRL_IFORCE</description>
          <fields>
            <field>
              <name>MEM_TOPMUXCTRL_IFORCE1</name>
              <description>[7:4] [4] 1: switch between WLAN_I2C_SCL and TOP_GPIO_PORT4_I2C closes 0: switch opens [5] 1: switch between WLAN_I2C_SCL and TOP_VSENSE_PORT closes 0: switch opens [6] 1: switch between WLAN_I2C_SCL and WLAN_ANA_TP4 closes 0: switch opens [7] Reserved</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MEM_TOPMUXCTRL_IFORCE</name>
              <description>[3:0] [0] 1: switch between WLAN_I2C_SDA and TOP_GPIO_PORT3_I2C closes 0: switch opens [1] 1: switch between WLAN_I2C_SDA and TOP_IFORCE_PORT closes 0: switch opens [2] 1: switch between WLAN_I2C_SDA and WLAN_ANA_TP3 closes 0: switch opens [3] Reserved</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC3XX_DEV_PACKAGE_DETECT</name>
          <addressOffset>0x17C</addressOffset>
          <size>32</size>
          <description>CC3XX_DEV_PACKAGE_DETECT</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AUTONMS_SPICLK_SEL</name>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <description>AUTONMS_SPICLK_SEL</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC3XX_DEV_PADCONF</name>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <description>CC3XX_DEV_PADCONF</description>
          <fields>
            <field>
              <name>MEM_CC3XX_DEV_PADCONF</name>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SPARE_REG_8</name>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <description>SPARE_REG_8</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SPARE_REG_6</name>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <description>SPARE_REG_6</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SPARE_REG_7</name>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <description>SPARE_REG_7</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_WLAN_ORBIT</name>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <description>APPS_WLAN_ORBIT</description>
          <fields>
            <field>
              <name>MEM_ORBIT_SPARE</name>
              <description>[31:10] Spare bit</description>
              <bitWidth>22</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>MEM_ORBIT_TEST_ID</name>
              <description>[7:2] Implies the test case ID that needs to run.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APPS_WLAN_SCRATCH_PAD</name>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <description>APPS_WLAN_SCRATCH_PAD</description>
          <resetValue>0</resetValue>
        </register>
