jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <baseAddress>0x4402E800</baseAddress>
      <registers>
        <register>
          <name>CTRL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>ADC control register.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH0_GAIN</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Channel 0 gain setting</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH1_GAIN</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Channel 1 gain setting</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH2_GAIN</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>Channel 2 gain setting</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH3_GAIN</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Channel 3 gain setting</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH4_GAIN</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Channel 4 gain setting</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH5_GAIN</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Channel 5 gain setting</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH6_GAIN</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>Channel 6 gain setting</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH7_GAIN</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Channel 7 gain setting</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH0_IRQ_EN</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Channel 0 interrupt enable register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH1_IRQ_EN</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Channel 1 interrupt enable register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH2_IRQ_EN</name>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <description>Channel 2 interrupt enable register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH3_IRQ_EN</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Channel 3 interrupt enable register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH4_IRQ_EN</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Channel 4 interrupt enable register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH5_IRQ_EN</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Channel 5 interrupt enable register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH6_IRQ_EN</name>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <description>Channel 6 interrupt enable register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH7_IRQ_EN</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Channel 7 interrupt enable register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH0_IRQ_STATUS</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Channel 0 interrupt status register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH1_IRQ_STATUS</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Channel 1 interrupt status register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH2_IRQ_STATUS</name>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <description>CH2_IRQ_STATUS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH3_IRQ_STATUS</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>Channel 3 interrupt status register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH4_IRQ_STATUS</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>Channel 4 interrupt status register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH5_IRQ_STATUS</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>CH5_IRQ_STATUS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH6_IRQ_STATUS</name>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <description>Channel 6 interrupt status register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH7_IRQ_STATUS</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>Channel 7 interrupt status register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMA_MODE_EN</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>DMA mode enable register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TIMER_CONFIGURATION</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>ADC timer configuration register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TIMER_CURRENT_COUNT</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>ADC timer current count register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHANNEL0FIFODATA</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>CH0 FIFO DATA register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHANNEL1FIFODATA</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>CH1 FIFO DATA register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHANNEL2FIFODATA</name>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <description>CH2 FIFO DATA register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHANNEL3FIFODATA</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>CH3 FIFO DATA register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHANNEL4FIFODATA</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>CH4 FIFO DATA register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHANNEL5FIFODATA</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>CH5 FIFO DATA register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHANNEL6FIFODATA</name>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <description>CH6 FIFO DATA register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHANNEL7FIFODATA</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>CH7 FIFO DATA register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH0_FIFO_LVL</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>channel 0 FIFO Level register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH1_FIFO_LVL</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>Channel 1 interrupt status register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH2_FIFO_LVL</name>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <description>CH2_FIFO_LVL</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH3_FIFO_LVL</name>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <description>Channel 3 interrupt status register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH4_FIFO_LVL</name>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <description>Channel 4 interrupt status register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH5_FIFO_LVL</name>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <description>CH5_FIFO_LVL</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH6_FIFO_LVL</name>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <description>Channel 6 interrupt status register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH7_FIFO_LVL</name>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <description>Channel 7 interrupt status register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CH_ENABLE</name>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <description>CH_ENABLE</description>
          <resetValue>0</resetValue>
        </register>
