jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HIB1P2</name>
      <baseAddress>0x4402F000</baseAddress>
      <registers>
        <register>
          <name>SRAM_SKA_LDO_PARAMETERS0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>SRAM_SKA_LDO_PARAMETERS0</description>
          <fields>
            <field>
              <name>MEM_SLDO_EN_SC_ITRIM_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>MEM_SLDO_EN_IQ_TRIM_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>MEM_SLDO_VTRIM_LOWV</name>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>MEM_SLDO_SPARE_LOWV</name>
              <bitWidth>10</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>NA1</name>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRAM_SKA_LDO_PARAMETERS1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>SRAM_SKA_LDO_PARAMETERS1</description>
          <fields>
            <field>
              <name>MEM_SKALDO_CTRL_LOWV</name>
              <bitWidth>10</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>MEM_SKALDO_VTRIM_LOWV</name>
              <bitWidth>6</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>NA2</name>
              <bitWidth>11</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIG_DCDC_PARAMETERS0</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>DIG_DCDC_PARAMETERS0</description>
          <fields>
            <field>
              <name>MEM_DCDC_DIG_VTRIM_LOWV_OVERRIDE</name>
              <description>[21:16] Override value for DCDC_DIG_VTRIM : Applicable only when bit [27] of DIG_DCDC_PARAMETERS1 [0x000C] is set to 1.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_PFM_RIPPLE_TRIM_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_IQ_CTRL_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_NON_OV_CTRL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_SLP_DRV_DLY_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>NA3</name>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIG_DCDC_PARAMETERS1</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>DIG_DCDC_PARAMETERS1</description>
          <fields>
            <field>
              <name>NA4</name>
              <bitWidth>25</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIG_DCDC_PARAMETERS2</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>DIG_DCDC_PARAMETERS2</description>
          <fields>
            <field>
              <name>MEM_DCDC_DIG_PFET_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_NFET_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_PDRV_STAGGER_CTRL_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_NDRV_STAGGER_CTRL_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_PDRV_STR_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_NDRV_STR_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_TON_TRIM_LOWV</name>
              <bitWidth>8</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIG_DCDC_PARAMETERS3</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>DIG_DCDC_PARAMETERS3</description>
          <fields>
            <field>
              <name>MEM_DCDC_DIG_COT_CTRL_LOWV</name>
              <bitWidth>8</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_ILIM_TRIM_LOWV_OVERRIDE</name>
              <description>[20:13] Override value for DCDC_DIG_ILIM_TRIM : Applicable only when bit [25] of DIG_DCDC_PARAMETERS1 [0x000C] is set to 1</description>
              <bitWidth>8</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_ILIM_MASK_DLY_SEL_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_NCOMP_TRIM_LOWV</name>
              <bitWidth>5</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_NCOMP_MASK_DLY_SEL_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIG_DCDC_PARAMETERS4</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>DIG_DCDC_PARAMETERS4</description>
          <fields>
            <field>
              <name>NA7</name>
              <bitWidth>29</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIG_DCDC_PARAMETERS5</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>DIG_DCDC_PARAMETERS5</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIG_DCDC_PARAMETERS6</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>DIG_DCDC_PARAMETERS6</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ANA_DCDC_PARAMETERS0</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>ANA_DCDC_PARAMETERS0</description>
          <fields>
            <field>
              <name>MEM_DCDC_ANA_VTRIM_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_PFM_RIPPLE_TRIM_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_IQ_CTRL_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_NON_OV_CTRL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_SLP_DRV_DLY_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_PFET_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ANA_DCDC_PARAMETERS1</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>ANA_DCDC_PARAMETERS1</description>
          <fields>
            <field>
              <name>MEM_DCDC_ANA_NFET_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_PDRV_STAGGER_CTRL_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_NDRV_STAGGER_CTRL_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_PDRV_STR_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_NDRV_STR_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_RAMP_HGT_LOWV</name>
              <bitWidth>5</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_HI_CLAMP_TRIM_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_LO_CLAMP_TRIM_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>NA8</name>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ANA_DCDC_PARAMETERS16</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>ANA_DCDC_PARAMETERS16</description>
          <fields>
            <field>
              <name>MEM_DCDC_ANA_ILIM_TRIM_LOWV_OVERRIDE</name>
              <bitWidth>8</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_ILIM_MASK_DLY_SEL_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_NCOMP_TRIM_LOWV</name>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_ANA_NCOMP_MASK_DLY_SEL_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ANA_DCDC_PARAMETERS17</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>ANA_DCDC_PARAMETERS17</description>
          <fields>
            <field>
              <name>NA17</name>
              <bitWidth>30</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ANA_DCDC_PARAMETERS18</name>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <description>ANA_DCDC_PARAMETERS18</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ANA_DCDC_PARAMETERS19</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>ANA_DCDC_PARAMETERS19</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FLASH_DCDC_PARAMETERS0</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>FLASH_DCDC_PARAMETERS0</description>
          <fields>
            <field>
              <name>MEM_DCDC_FLASH_IQ_CTRL_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_NON_OV_CTRL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_P1FET_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_N1FET_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FLASH_DCDC_PARAMETERS1</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>FLASH_DCDC_PARAMETERS1</description>
          <fields>
            <field>
              <name>MEM_DCDC_FLASH_P2FET_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_N2FET_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_P1DRV_STR_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_N1DRV_STR_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_P2DRV_STR_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_N2DRV_STR_SEL_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_P1FET_NON_OV_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_N1FET_NON_OV_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_P2FET_NON_OV_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_N2FET_NON_OV_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FLASH_DCDC_PARAMETERS2</name>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <description>FLASH_DCDC_PARAMETERS2</description>
          <fields>
            <field>
              <name>MEM_DCDC_FLASH_P1FET_STAGGER_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_N1FET_STAGGER_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_P2FET_STAGGER_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_N2FET_STAGGER_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_NCOMP_TRIM_LOWV</name>
              <bitWidth>5</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_NCOMP_MASK_DLY_TRIM_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_ILIM_TRIM_LOWV_OVERRIDE</name>
              <bitWidth>8</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_ILIM_MASK_DLY_SEL_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FLASH_DCDC_PARAMETERS3</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>FLASH_DCDC_PARAMETERS3</description>
          <fields>
            <field>
              <name>MEM_DCDC_FLASH_RAMP_HGT_LOWV</name>
              <bitWidth>5</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_VCLAMPH_TRIM_LOWV</name>
              <bitWidth>3</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_VCLAMPL_TRIM_LOWV</name>
              <bitWidth>3</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_VTRIM_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_PFM_RIPPLE_TRIM_LOWV</name>
              <bitWidth>4</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_FLASH_SLP_DRV_DLY_SEL_LOWV</name>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>NA19</name>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FLASH_DCDC_PARAMETERS4</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>FLASH_DCDC_PARAMETERS4</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FLASH_DCDC_PARAMETERS5</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>FLASH_DCDC_PARAMETERS5</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FLASH_DCDC_PARAMETERS6</name>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <description>FLASH_DCDC_PARAMETERS6</description>
          <fields>
            <field>
              <name>NA20</name>
              <bitWidth>30</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PMBIST_PARAMETERS0</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>PMBIST_PARAMETERS0</description>
          <fields>
            <field>
              <name>MEM_PM_BIST_CTRL_LOWV</name>
              <bitWidth>20</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>NA21</name>
              <bitWidth>11</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PMBIST_PARAMETERS1</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>PMBIST_PARAMETERS1</description>
          <fields>
            <field>
              <name>MEM_PM_BIST_SPARE_LOWV</name>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>NA22</name>
              <bitWidth>15</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PMBIST_PARAMETERS2</name>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <description>PMBIST_PARAMETERS2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PMBIST_PARAMETERS3</name>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <description>PMBIST_PARAMETERS3</description>
          <fields>
            <field>
              <name>MEM_PMTEST_SPARE_LOWV</name>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MEM_PMTEST_LOAD_TRIM_LOWV</name>
              <bitWidth>3</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>NA23</name>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FLASH_DCDC_PARAMETERS8</name>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <description>FLASH_DCDC_PARAMETERS8</description>
          <fields>
            <field>
              <name>MEM_FLASH_HIGH_SUP_TRIM_LOWV</name>
              <bitWidth>5</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>MEM_FLASH_LOW_SUP_TRIM_LOWV</name>
              <bitWidth>5</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>NA24</name>
              <bitWidth>21</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ANA_DCDC_PARAMETERS_OVERRIDE</name>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <description>ANA_DCDC_PARAMETERS_OVERRIDE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FLASH_DCDC_PARAMETERS_OVERRIDE</name>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <description>FLASH_DCDC_PARAMETERS_OVERRIDE</description>
          <resetValue>0</resetValue>
        </register>
