jbuonagurio/fanboard/svd/CC32xxSF.svd
        <register>
          <name>DIG_DCDC_VTRIM_CFG</name>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <description>DIG_DCDC_VTRIM_CFG</description>
          <fields>
            <field>
              <name>MEM_DCDC_DIG_RUN_VTRIM</name>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_DSLP_VTRIM</name>
              <bitWidth>6</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_LPDS_VTRIM</name>
              <bitWidth>6</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SPARE_RW</name>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIG_DCDC_FSM_PARAMETERS</name>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <description>DIG_DCDC_FSM_PARAMETERS</description>
          <fields>
            <field>
              <name>MEM_DCDC_DIG_DSLP_ENTER_COT_TO_VTRIM</name>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_DSLP_ENTER_VTRIM_TO_SLEEP</name>
              <bitWidth>3</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_DSLP_EXIT_SLEEP_TO_VTRIM</name>
              <bitWidth>3</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_DSLP_EXIT_VTRIM_TO_COT</name>
              <bitWidth>3</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MEM_DCDC_DIG_DSLP_EXIT_COT_TO_RUN</name>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ANA_DCDC_FSM_PARAMETERS</name>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <description>ANA_DCDC_FSM_PARAMETERS</description>
          <fields>
            <field>
              <name>MEM_DCDC_ANA_DSLP_EXIT_SLEEP_TO_RUN</name>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRAM_SKA_LDO_FSM_PARAMETERS</name>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <description>SRAM_SKA_LDO_FSM_PARAMETERS</description>
          <fields>
            <field>
              <name>MEM_SKA_LDO_EN_TO_SRAM_LDO_DIS</name>
              <bitWidth>3</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MEM_SRAM_LDO_EN_TO_SKA_LDO_DIS</name>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BGAP_DUTY_CYCLING_EXIT_CFG</name>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <description>BGAP_DUTY_CYCLING_EXIT_CFG</description>
          <fields>
            <field>
              <name>MEM_BGAP_DUTY_CYCLING_EXIT_TIME</name>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CM_OSC_16M_CONFIG</name>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <description>CM_OSC_16M_CONFIG</description>
          <fields>
            <field>
              <name>MEM_CM_OSC_16M_TRIM</name>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>MEM_CM_OSC_16M_SPARE</name>
              <bitWidth>6</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MEM_CM_SLI_16M_TRIM</name>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SOP_SENSE_VALUE</name>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <description>SOP_SENSE_VALUE</description>
          <fields>
            <field>
              <name>SOP_SENSE_VALUE</name>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_RTC_TIMER_LSW_1P2</name>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <description>HIB_RTC_TIMER_LSW_1P2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_RTC_TIMER_MSW_1P2</name>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <description>HIB_RTC_TIMER_MSW_1P2</description>
          <fields>
            <field>
              <name>HIB_RTC_TIMER_MSW</name>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>BGAP_TRIM_OVERRIDES</name>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <description>BGAP_TRIM_OVERRIDES</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG0</name>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EFUSE_READ_REG1</name>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <description>EFUSE_READ_REG1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>POR_TEST_CTRL</name>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <description>POR_TEST_CTRL</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_TIMER_SYNC_CALIB_CFG0</name>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <description>HIB_TIMER_SYNC_CALIB_CFG0</description>
          <fields>
            <field>
              <name>MEM_CFG_CALIB_TIME</name>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_TIMER_SYNC_CALIB_CFG1</name>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <description>HIB_TIMER_SYNC_CALIB_CFG1</description>
          <fields>
            <field>
              <name>FAST_CALIB_COUNT</name>
              <bitWidth>20</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_TIMER_SYNC_CFG2</name>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <description>HIB_TIMER_SYNC_CFG2</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_TIMER_SYNC_TSF_ADJ_VAL</name>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <description>HIB_TIMER_SYNC_TSF_ADJ_VAL</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_TIMER_RTC_GTS_TIMESTAMP_LSW</name>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <description>HIB_TIMER_RTC_GTS_TIMESTAMP_LSW</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_TIMER_RTC_GTS_TIMESTAMP_MSW</name>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <description>HIB_TIMER_RTC_GTS_TIMESTAMP_MSW</description>
          <fields>
            <field>
              <name>RTC_GTS_TIMESTAMP_MSW</name>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_TIMER_RTC_WUP_TIMESTAMP_LSW</name>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <description>HIB_TIMER_RTC_WUP_TIMESTAMP_LSW</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_TIMER_RTC_WUP_TIMESTAMP_MSW</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>HIB_TIMER_RTC_WUP_TIMESTAMP_MSW</description>
          <fields>
            <field>
              <name>RTC_WUP_TIMESTAMP_MSW</name>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_TIMER_SYNC_WAKE_OFFSET_ERR</name>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <description>HIB_TIMER_SYNC_WAKE_OFFSET_ERR</description>
          <fields>
            <field>
              <name>WUP_OFFSET_ERROR</name>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_TIMER_SYNC_TSF_CURR_VAL_LSW</name>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <description>HIB_TIMER_SYNC_TSF_CURR_VAL_LSW</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_TIMER_SYNC_TSF_CURR_VAL_MSW</name>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <description>HIB_TIMER_SYNC_TSF_CURR_VAL_MSW</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CM_SPARE</name>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <description>CM_SPARE</description>
          <fields>
            <field>
              <name>CM_SPARE_OUT</name>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>MEM_CM_TEST_CTRL</name>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MEM_CM_SPARE</name>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PORPOL_SPARE</name>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <description>PORPOL_SPARE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_DIG_DCDC_CLK_CONFIG</name>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <description>MEM_DIG_DCDC_CLK_CONFIG</description>
          <fields>
            <field>
              <name>MEM_DIG_DCDC_CLK_PLLGEN_OFF_TIME</name>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MEM_DIG_DCDC_CLK_PLLGEN_ON_TIME</name>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_ANA_DCDC_CLK_CONFIG</name>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <description>MEM_ANA_DCDC_CLK_CONFIG</description>
          <fields>
            <field>
              <name>MEM_ANA_DCDC_CLK_PLLGEN_OFF_TIME</name>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MEM_ANA_DCDC_CLK_PLLGEN_ON_TIME</name>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_FLASH_DCDC_CLK_CONFIG</name>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <description>MEM_FLASH_DCDC_CLK_CONFIG</description>
          <fields>
            <field>
              <name>MEM_FLASH_DCDC_CLK_PLLGEN_OFF_TIME</name>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MEM_FLASH_DCDC_CLK_PLLGEN_ON_TIME</name>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_PA_DCDC_CLK_CONFIG</name>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <description>MEM_PA_DCDC_CLK_CONFIG</description>
          <fields>
            <field>
              <name>MEM_PA_DCDC_CLK_PLLGEN_OFF_TIME</name>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MEM_PA_DCDC_CLK_PLLGEN_ON_TIME</name>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_SLDO_VNWA_OVERRIDE</name>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <description>MEM_SLDO_VNWA_OVERRIDE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_BGAP_DUTY_CYCLING_ENABLE_OVERRIDE</name>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <description>MEM_BGAP_DUTY_CYCLING_ENABLE_OVERRIDE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_FSM_DEBUG</name>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <description>MEM_HIB_FSM_DEBUG</description>
          <fields>
            <field>
              <name>SRAM_PS</name>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ANA_DCDC_PS</name>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>DIG_DCDC_PS</name>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_SLDO_VNWA_SW_CTRL</name>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <description>MEM_SLDO_VNWA_SW_CTRL</description>
          <fields>
            <field>
              <name>MEM_SLDO_VNWA_SW_CTRL</name>
              <bitWidth>20</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_SLDO_WEAK_PROCESS</name>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <description>MEM_SLDO_WEAK_PROCESS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_PA_DCDC_OV_UV_STATUS</name>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <description>MEM_PA_DCDC_OV_UV_STATUS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_CM_TEST_MODE</name>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <description>MEM_CM_TEST_MODE</description>
          <resetValue>0</resetValue>
        </register>
