jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HIB3P3</name>
      <baseAddress>0x4402F800</baseAddress>
      <registers>
        <register>
          <name>MEM_HIB_REQ</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>MEM_HIB_REQ</description>
          <fields>
            <field>
              <name>NU1</name>
              <bitWidth>7</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_RTC_TIMER_ENABLE</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>MEM_HIB_RTC_TIMER_ENABLE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_RTC_TIMER_RESET</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>MEM_HIB_RTC_TIMER_RESET</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_RTC_TIMER_READ</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>MEM_HIB_RTC_TIMER_READ</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_RTC_TIMER_LSW</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>MEM_HIB_RTC_TIMER_LSW</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_RTC_TIMER_MSW</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>MEM_HIB_RTC_TIMER_MSW</description>
          <fields>
            <field>
              <name>HIB_RTC_TIMER_MSW</name>
              <description>[15:0] Upper 32b value of the latched RTC-Timer.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_RTC_WAKE_EN</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>MEM_HIB_RTC_WAKE_EN</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_RTC_WAKE_LSW_CONF</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>MEM_HIB_RTC_WAKE_LSW_CONF</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_RTC_WAKE_MSW_CONF</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>MEM_HIB_RTC_WAKE_MSW_CONF</description>
          <fields>
            <field>
              <name>MEM_HIB_RTC_WAKE_MSW_CONF</name>
              <description>[15:0] Configuration for RTC-Timer Wakeup (Upper 16b word)</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_INT_OSC_CONF</name>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <description>MEM_INT_OSC_CONF</description>
          <fields>
            <field>
              <name>MEM_CM_INTOSC_32K_SPARE</name>
              <bitWidth>6</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>MEM_CM_INTOSC_32K_TRIM</name>
              <bitWidth>6</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_XTAL_OSC_CONF</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>MEM_XTAL_OSC_CONF</description>
          <fields>
            <field>
              <name>MEM_CM_XTAL_TRIM</name>
              <bitWidth>6</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MEM_CM_SLI_32K_TRIM</name>
              <bitWidth>3</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>MEM_CM_FREF_32K_SLICER_ITRIM</name>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MEM_CM_EN_INPUT_SENSE</name>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_BGAP_PARAMETERS0</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>MEM_BGAP_PARAMETERS0</description>
          <fields>
            <field>
              <name>MEM_VBOK4BG_COMP_TRIM</name>
              <bitWidth>3</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>MEM_BGAP_SPARE</name>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_BGAP_PARAMETERS1</name>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <description>MEM_BGAP_PARAMETERS1</description>
          <fields>
            <field>
              <name>MEM_BGAP_ACT_IREF_ITRIM</name>
              <bitWidth>5</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_DETECTION_STATUS</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>MEM_HIB_DETECTION_STATUS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_MISC_CONTROLS</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>MEM_HIB_MISC_CONTROLS</description>
          <fields>
            <field>
              <name>MEM_HIB_POK_POR_COMP_TRIM</name>
              <bitWidth>3</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_CONFIG</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>MEM_HIB_CONFIG</description>
          <fields>
            <field>
              <name>TOP_MUX_CTRL_SOP_SPIO</name>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_RTC_IRQ_ENABLE</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>MEM_HIB_RTC_IRQ_ENABLE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_RTC_IRQ_LSW_CONF</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>MEM_HIB_RTC_IRQ_LSW_CONF</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_RTC_IRQ_MSW_CONF</name>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <description>MEM_HIB_RTC_IRQ_MSW_CONF</description>
          <fields>
            <field>
              <name>HIB_RTC_IRQ_MSW_CONF</name>
              <description>[15:0] Configuration for MSW of thr RTC-Timestamp at which the interrupt need to be generated</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_UART_CONF</name>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <description>MEM_HIB_UART_CONF</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_GPIO_WAKE_EN</name>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <description>MEM_GPIO_WAKE_EN</description>
          <fields>
            <field>
              <name>MEM_GPIO_WAKE_EN</name>
              <description>[7:0] 1 - Enable the GPIO-Autonomous mode wakeup during Hibernate mode ; This is an auto-clear bit, once programmed to 1, it will latched into an internal register which remain asserted until the Hib-wakeup is initiated.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_GPIO_WAKE_CONF</name>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <description>MEM_GPIO_WAKE_CONF</description>
          <fields>
            <field>
              <name>MEM_GPIO_WAKE_CONF</name>
              <description>[15:0] Configuration to say whether the GPIO wakeup has to happen on Level0 or falling-edge for the given group. 00?  Level0 01?  Level1 10?- Fall-edge 11?- Rise-edge [1:0]  Conf for GPIO0 [3:2]  Conf for GPIO1 [5:4]  Conf for GPIO2 [7:6]  Conf for GPIO3 [9:8]  Conf for GPIO4 [11:10]  Conf for GPIO5 [13:12]  Conf for GPIO6</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_PAD_OEN_RET33_CONF</name>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <description>MEM_PAD_OEN_RET33_CONF</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_UART_RTS_OEN_RET33_CONF</name>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <description>MEM_UART_RTS_OEN_RET33_CONF</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_JTAG_CONF</name>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <description>MEM_JTAG_CONF</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_REG0</name>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <description>MEM_HIB_REG0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_REG1</name>
          <addressOffset>0x41C</addressOffset>
          <size>32</size>
          <description>MEM_HIB_REG1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_REG2</name>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <description>MEM_HIB_REG2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_REG3</name>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <description>MEM_HIB_REG3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_SEQUENCER_CFG0</name>
          <addressOffset>0x45C</addressOffset>
          <size>32</size>
          <description>MEM_HIB_SEQUENCER_CFG0</description>
          <fields>
            <field>
              <name>MEM_BDC_EV0_TO_EV1_TIME</name>
              <description>[31:16] Configuration for the number of slow-clks between de-assertion of EN_BG_3P3V to assertion of EN_BG_3P3V</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MEM_BDC_EV3_TO_EV4_TIME</name>
              <description>[14:13] Configuration for the number of slow-clks between assertion of EN_COMP_3P3V and assertion of EN_COMP_LATCH_3P3V</description>
              <bitWidth>2</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>MEM_BDC_EV2_TO_EV3_TIME</name>
              <description>[12:11] Configuration for the number of slow-clks between assertion of (EN_CAP_SW_3P3V,EN_COMP_REF) and assertion of (EN_COMP_3P3V)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MEM_BDC_EV1_TO_EV2_TIME</name>
              <description>[10:9] Configuration for the number of slow-clks between assertion of (EN_BG_3P3V) and assertion of (EN_CAP_SW_3P3V, EN_COMP_REF_3P3V)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_SEQUENCER_CFG1</name>
          <addressOffset>0x460</addressOffset>
          <size>32</size>
          <description>MEM_HIB_SEQUENCER_CFG1</description>
          <fields>
            <field>
              <name>MEM_BDC_EV5_TO_EV6_TIME</name>
              <description>[15:14] Configuration for number of slow-clks between de-assertion of EN_COMP_LATCH and assertion of</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>MEM_BDC_TO_ACTIVE_EV1_TO_EV2_TIME</name>
              <description>[13:12] Configuration for number of slow-clks between assertion of EN_COMP_REF to assertion of EN_COMP during HIB-Exit</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>MEM_BDC_TO_ACTIVE_EV0_TO_EV1_TIME</name>
              <description>[11:10] TBD</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>MEM_BDC_TO_ACTIVE_EV0_TO_ACTIVE</name>
              <description>[9:8] Configuration in number of slow-clks between assertion of (EN_BGAP_3P3V, EN_CAP_SW_3P3V, EN_ACT_IREF_3P3V, EN_COMP_REF) to assertion of EN_COMP_3P3V</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MEM_ACTIVE_TO_BDC_EV1_TO_BDC_EV0_TIME</name>
              <description>[7:6] Configuration in number of slow-clks between de-assertion of (EN_COMP_3P3V, EN_COMP_REF_3P3V, EN_ACT_IREF_3P3V, EN_CAP_SW_3P3V) to deassertion of EN_BGAP_3P3V.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>NU1</name>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_MISC_CONFIG</name>
          <addressOffset>0x464</addressOffset>
          <size>32</size>
          <description>MEM_HIB_MISC_CONFIG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_WAKE_STATUS</name>
          <addressOffset>0x468</addressOffset>
          <size>32</size>
          <description>MEM_HIB_WAKE_STATUS</description>
          <fields>
            <field>
              <name>HIB_WAKE_SRC</name>
              <description>[4:1] &amp;quot;0100&amp;quot; - GPIO ; &amp;quot;0010&amp;quot; - RTC ; &amp;quot;0001&amp;quot; - UART Others - Reserved</description>
              <bitWidth>4</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_LPDS_GPIO_SEL</name>
          <addressOffset>0x46C</addressOffset>
          <size>32</size>
          <description>MEM_HIB_LPDS_GPIO_SEL</description>
          <fields>
            <field>
              <name>HIB_LPDS_GPIO_SEL</name>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MEM_HIB_SEQUENCER_CFG2</name>
          <addressOffset>0x470</addressOffset>
          <size>32</size>
          <description>MEM_HIB_SEQUENCER_CFG2</description>
          <fields>
            <field>
              <name>MEM_ACTIVE_TO_BDC_EV0_TO_ACTIVE_TO_BDC_EV1_TIME</name>
              <description>[10:9] Deassertion of EN_COMP_LATCH_3P3 to deassertion of (EN_COMP_3P3, EN_COMP_REF_3P3, EN_ACT_IREF_3P3, EN_CAP_SW_3P3)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>MEM_BDC_EV4_TO_EV5_TIME</name>
              <description>[8:6] Assertion of EN_COMP_LATCH_3P3 to deassertion of EN_COMP_LATCH_3P3</description>
              <bitWidth>3</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>MEM_BDC_EV6_TO_EV7_TIME</name>
              <description>[5:4] Deassertion of (EN_CAP_SW_3P3, EN_COMP_REF_3P3, EN_COMP_3P3, EN_COMP_OUT_LATCH_3P3) to deassertion of EN_BGAP_3P3</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MEM_BDC_TO_ACTIVE_EV1_TO_EV2_TIME</name>
              <description>[3:2] Assertion of EN_COMP_3P3 to assertion of EN_COMPOUT_LATCH_3P3</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MEM_HIB_TO_ACTIVE_EV2_TO_EV3_TIME</name>
              <description>[1:0] Assertion of EN_COMP_3P3 to assertion of EN_COMPOUT_LATCH_3P3</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIBANA_SPARE_LOWV</name>
          <addressOffset>0x474</addressOffset>
          <size>32</size>
          <description>HIBANA_SPARE_LOWV</description>
          <fields>
            <field>
              <name>MEM_HIBANA_SPARE1</name>
              <bitWidth>10</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>MEM_HIBANA_SPARE0</name>
              <bitWidth>17</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_TMUX_CTRL</name>
          <addressOffset>0x478</addressOffset>
          <size>32</size>
          <description>HIB_TMUX_CTRL</description>
          <fields>
            <field>
              <name>MEM_HD_TMUX_CNTRL</name>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_1P2_1P8_LDO_TRIM</name>
          <addressOffset>0x47C</addressOffset>
          <size>32</size>
          <description>HIB_1P2_1P8_LDO_TRIM</description>
          <fields>
            <field>
              <name>MEM_HD_1P2_LDO_VTRIM</name>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MEM_HD_1P8_LDO_VTRIM</name>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_COMP_TRIM</name>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <description>HIB_COMP_TRIM</description>
          <fields>
            <field>
              <name>MEM_HD_COMP_TRIM</name>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_EN_TS</name>
          <addressOffset>0x484</addressOffset>
          <size>32</size>
          <description>HIB_EN_TS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_1P8V_DET_EN</name>
          <addressOffset>0x488</addressOffset>
          <size>32</size>
          <description>HIB_1P8V_DET_EN</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_VBAT_MON_EN</name>
          <addressOffset>0x48C</addressOffset>
          <size>32</size>
          <description>HIB_VBAT_MON_EN</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_NHIB_ENABLE</name>
          <addressOffset>0x490</addressOffset>
          <size>32</size>
          <description>HIB_NHIB_ENABLE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HIB_UART_RTS_SW_ENABLE</name>
          <addressOffset>0x494</addressOffset>
          <size>32</size>
          <description>HIB_UART_RTS_SW_ENABLE</description>
          <resetValue>0</resetValue>
        </register>
