jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DTHE</name>
      <baseAddress>0x44030000</baseAddress>
      <registers>
        <register>
          <name>SHA_IM</name>
          <addressOffset>0x810</addressOffset>
          <size>32</size>
          <description>SHA_IM</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SHA_RIS</name>
          <addressOffset>0x814</addressOffset>
          <size>32</size>
          <description>SHA_RIS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SHA_MIS</name>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <description>SHA_MIS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SHA_IC</name>
          <addressOffset>0x81C</addressOffset>
          <size>32</size>
          <description>SHA_IC</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AES_IM</name>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <description>AES_IM</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AES_RIS</name>
          <addressOffset>0x824</addressOffset>
          <size>32</size>
          <description>AES_RIS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AES_MIS</name>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <description>AES_MIS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AES_IC</name>
          <addressOffset>0x82C</addressOffset>
          <size>32</size>
          <description>AES_IC</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DES_IM</name>
          <addressOffset>0x830</addressOffset>
          <size>32</size>
          <description>DES_IM</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DES_RIS</name>
          <addressOffset>0x834</addressOffset>
          <size>32</size>
          <description>DES_RIS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DES_MIS</name>
          <addressOffset>0x838</addressOffset>
          <size>32</size>
          <description>DES_MIS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DES_IC</name>
          <addressOffset>0x83C</addressOffset>
          <size>32</size>
          <description>DES_IC</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EIP_CGCFG</name>
          <addressOffset>0xA00</addressOffset>
          <size>32</size>
          <description>EIP_CGCFG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EIP_CGREQ</name>
          <addressOffset>0xA04</addressOffset>
          <size>32</size>
          <description>EIP_CGREQ</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC_CTRL</name>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <description>CRC_CTRL</description>
          <fields>
            <field>
              <name>INIT</name>
              <description>[14:13] Initialize the CRC 00  use SEED register context as starting value 10  all zero? 11  all one? This is self clearing. With first write to data register this value clears to zero and remain zero for rest of the operation unless written again</description>
              <bitWidth>2</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>ENDIAN</name>
              <description>[5:4] Endian control [0]  swap byte in half-word [1]  swap half word</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>TYPE</name>
              <description>[3:0] Type of operation 0000  polynomial 0x8005 0001  polynomial 0x1021 0010  polynomial 0x4C11DB7 0011  polynomial 0x1EDC6F41 1000  TCP checksum TYPE in DTHE_S_CRC_CTRL &amp; DTHE_S_CRC_CTRL should be exclusive</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC_SEED</name>
          <addressOffset>0xC10</addressOffset>
          <size>32</size>
          <description>CRC_SEED</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC_DIN</name>
          <addressOffset>0xC14</addressOffset>
          <size>32</size>
          <description>CRC_DIN</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CRC_RSLT_PP</name>
          <addressOffset>0xC18</addressOffset>
          <size>32</size>
          <description>CRC_RSLT_PP</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RAND_KEY0</name>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <description>RAND_KEY0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RAND_KEY1</name>
          <addressOffset>0xF04</addressOffset>
          <size>32</size>
          <description>RAND_KEY1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RAND_KEY2</name>
          <addressOffset>0xF08</addressOffset>
          <size>32</size>
          <description>RAND_KEY2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RAND_KEY3</name>
          <addressOffset>0xF0C</addressOffset>
          <size>32</size>
          <description>RAND_KEY3</description>
          <resetValue>0</resetValue>
        </register>
