jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SHAMD5</name>
      <baseAddress>0x44035000</baseAddress>
      <registers>
        <register>
          <name>ODIGEST_A</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>WRITE: Outer Digest [127:96] for MD5 [159:128] for SHA-1 [255:224] for SHA-2 / HMAC Key [31:0] for HMAC key proc READ: Outer Digest [127:96] for MD5 [159:128] for SHA-1 [255:224] for SHA-2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ODIGEST_B</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>WRITE: Outer Digest [95:64] for MD5 [127:96] for SHA-1 [223:192] for SHA-2 / HMAC Key [63:32] for HMAC key proc READ: Outer Digest [95:64] for MD5 [127:96] for SHA-1 [223:192] for SHA-2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ODIGEST_C</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>WRITE: Outer Digest [63:32] for MD5 [95:64] for SHA-1 [191:160] for SHA-2 / HMAC Key [95:64] for HMAC key proc READ: Outer Digest [63:32] for MD5 [95:64] for SHA-1 [191:160] for SHA-2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ODIGEST_D</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>WRITE: Outer Digest [31:0] for MD5 [63:31] for SHA-1 [159:128] for SHA-2 / HMAC Key [127:96] for HMAC key proc READ: Outer Digest [31:0] for MD5 [63:32] for SHA-1 [159:128] for SHA-2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ODIGEST_E</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>WRITE: Outer Digest [31:0] for SHA-1 [127:96] for SHA-2 / HMAC Key [159:128] for HMAC key proc READ: Outer Digest [31:0] for SHA-1 [127:96] for SHA-2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ODIGEST_F</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>WRITE: Outer Digest [95:64] for SHA-2 / HMAC Key [191:160] for HMAC key proc READ: Outer Digest [95:64] for SHA-2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ODIGEST_G</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>WRITE: Outer Digest [63:32] for SHA-2 / HMAC Key [223:192] for HMAC key proc READ: Outer Digest [63:32] for SHA-2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ODIGEST_H</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>WRITE: Outer Digest [31:0] for SHA-2 / HMAC Key [255:224] for HMAC key proc READ: Outer Digest [31:0] for SHA-2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IDIGEST_A</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>WRITE: Inner / Initial Digest [127:96] for MD5 [159:128] for SHA-1 [255:224] for SHA-2 / HMAC Key [287:256] for HMAC key proc READ: Intermediate / Inner Digest [127:96] for MD5 [159:128] for SHA-1 [255:224] for SHA-2 / Result Digest/MAC [127:96] for MD5 [159:128] for SHA-1 [223:192] for SHA-2 224 [255:224] for SHA-2 256</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IDIGEST_B</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>WRITE: Inner / Initial Digest [95:64] for MD5 [127:96] for SHA-1 [223:192] for SHA-2 / HMAC Key [319:288] for HMAC key proc READ: Intermediate / Inner Digest [95:64] for MD5 [127:96] for SHA-1 [223:192] for SHA-2 / Result Digest/MAC [95:64] for MD5 [127:96] for SHA-1 [191:160] for SHA-2 224 [223:192] for SHA-2 256</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IDIGEST_C</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>WRITE: Inner / Initial Digest [63:32] for MD5 [95:64] for SHA-1 [191:160] for SHA- 2 / HMAC Key [351:320] for HMAC key proc READ: Intermediate / Inner Digest [63:32] for MD5 [95:64] for SHA-1 [191:160] for SHA-2 / Result Digest/MAC [63:32] for MD5 [95:64] for SHA-1 [159:128] for SHA-2 224 [191:160] for SHA-2 256</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IDIGEST_D</name>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <description>WRITE: Inner / Initial Digest [31:0] for MD5 [63:32] for SHA-1 [159:128] for SHA-2 / HMAC Key [383:352] for HMAC key proc READ: Intermediate / Inner Digest [31:0] for MD5 [63:32] for SHA-1 [159:128] for SHA-2 / Result Digest/MAC [31:0] for MD5 [63:32] for SHA-1 [127:96] for SHA-2 224 [159:128] for SHA-2 256</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IDIGEST_E</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>WRITE: Inner / Initial Digest [31:0] for SHA-1 [127:96] for SHA-2 / HMAC Key [415:384] for HMAC key proc READ: Intermediate / Inner Digest [31:0] for SHA-1 [127:96] for SHA-2 / Result Digest/MAC [31:0] for SHA-1 [95:64] for SHA-2 224 [127:96] for SHA-2 256</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IDIGEST_F</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>WRITE: Inner / Initial Digest [95:64] for SHA-2 / HMAC Key [447:416] for HMAC key proc READ: Intermediate / Inner Digest [95:64] for SHA-2 / Result Digest/MAC [63:32] for SHA-2 224 [95:64] for SHA-2 256</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IDIGEST_G</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>WRITE: Inner / Initial Digest [63:32] for SHA-2 / HMAC Key [479:448] for HMAC key proc READ: Intermediate / Inner Digest [63:32] for SHA-2 / Result Digest/MAC [31:0] for SHA-2 224 [63:32] for SHA-2 256</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IDIGEST_H</name>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <description>WRITE: Inner / Initial Digest [31:0] for SHA-2 / HMAC Key [511:480] for HMAC key proc READ: Intermediate / Inner Digest [31:0] for SHA-2 / Result Digest/MAC [31:0] for SHA-2 256</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIGEST_COUNT</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>WRITE: Initial Digest Count ([31:6] only [5:0] assumed 0) READ: Result / IntermediateDigest Count The initial digest byte count for hash/HMAC continue operations (HMAC Key Processing = 0 and Use Algorithm Constants = 0) on the Secure World must be written to this register prior to starting the operation by writing to S_HASH_MODE. When either HMAC Key Processing is 1 or Use Algorithm Constants is 1 this register does not need to be written it will be overwritten with 64 (1 hash block of key XOR ipad) or 0 respectively automatically. When starting a HMAC operation from pre-computes (HMAC Key Processing is 0) then the value 64 must be written here to compensate for the appended key XOR ipad block. Note that the value written should always be a 64 byte multiple the lower 6 bits written are ignored. The updated digest byte count (initial digest byte count + bytes processed) can be read from this register when the status register indicates that the operation is done or suspended due to a context switch request or when a Secure World context out DMA is requested. In Advanced DMA mode when not suspended with a partial result reading the SHAMD5_DIGEST_COUNT register triggers the Hash/HMAC Engine to start the next context input DMA. Therefore reading the SHAMD5_DIGEST_COUNT register should always be the last context-read action if not suspended with a partial result (i.e. PartHashReady interrupt not pending).</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MODE</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Register SHAMD5_MODE</description>
          <fields>
            <field>
              <name>ALGO</name>
              <description>[2:1] These bits select the hash algorithm to be used for processing: 0x0 md5_128 algorithm 0x1 sha1_160 algorithm 0x2 sha2_224 algorithm 0x3 sha2_256 algorithm</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LENGTH</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>WRITE: Block Length / Remaining Byte Count (bytes) READ: Remaining Byte Count. The value programmed MUST be a 64-byte multiple if Close Hash is set to 0. This register is also the trigger to start processing: once this register is written the core will commence requesting input data via DMA or IRQ (if programmed length > 0) and start processing. The remaining byte count for the active operation can be read from this register when the interrupt status register indicates that the operation is suspended due to a context switch request.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA0_IN</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>Data input message 0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA1_IN</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>Data input message 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA2_IN</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>Data input message 2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA3_IN</name>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <description>Data input message 3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA4_IN</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>Data input message 4</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA5_IN</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>Data input message 5</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA6_IN</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>Data input message 6</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA7_IN</name>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <description>Data input message 7</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA8_IN</name>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <description>Data input message 8</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA9_IN</name>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <description>Data input message 9</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA10_IN</name>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <description>Data input message 10</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA11_IN</name>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <description>Data input message 11</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA12_IN</name>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <description>Data input message 12</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA13_IN</name>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <description>Data input message 13</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA14_IN</name>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <description>Data input message 14</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA15_IN</name>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <description>Data input message 15</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REVISION</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>Register SHAMD5_REV</description>
          <fields>
            <field>
              <name>SCHEME</name>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>FUNC</name>
              <description>[27:16] Function indicates a software compatible module family. If there is no level of software compatibility a new Func number (and hence REVISION) should be assigned.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>R_RTL</name>
              <description>[15:11] RTL Version (R) maintained by IP design owner. RTL follows a numbering such as X.Y.R.Z which are explained in this table. R changes ONLY when: (1) PDS uploads occur which may have been due to spec changes (2) Bug fixes occur (3) Resets to '0' when X or Y changes. Design team has an internal 'Z' (customer invisible) number which increments on every drop that happens due to DV and RTL updates. Z resets to 0 when R increments.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>X_MAJOR</name>
              <description>[10:8] Major Revision (X) maintained by IP specification owner. X changes ONLY when: (1) There is a major feature addition. An example would be adding Master Mode to Utopia Level2. The Func field (or Class/Type in old PID format) will remain the same. X does NOT change due to: (1) Bug fixes (2) Change in feature parameters.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CUSTOM</name>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>Y_MINOR</name>
              <description>[5:0] Minor Revision (Y) maintained by IP specification owner. Y changes ONLY when: (1) Features are scaled (up or down). Flexibility exists in that this feature scalability may either be represented in the Y change or a specific register in the IP that indicates which features are exactly available. (2) When feature creeps from Is-Not list to Is list. But this may not be the case once it sees silicon; in which case X will change. Y does NOT change due to: (1) Bug fixes (2) Typos or clarifications (3) major functional/feature change/addition/deletion. Instead these changes may be reflected via R S X as applicable. Spec owner maintains a customer-invisible number 'S' which changes due to: (1) Typos/clarifications (2) Bug documentation. Note that this bug is not due to a spec change but due to implementation. Nevertheless the spec tracks the IP bugs. An RTL release (say for silicon PG1.1) that occurs due to bug fix should document the corresponding spec number (X.Y.S) in its release notes.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSCONFIG</name>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <description>Register SHAMD5_SYSCONFIG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSSTATUS</name>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <description>Register SHAMD5_SYSSTATUS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IRQSTATUS</name>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <description>Register SHAMD5_IRQSTATUS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IRQENABLE</name>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <description>Register SHAMD5_IRQENABLE. The SHAMD5_IRQENABLE register contains an enable bit for each unique interrupt for the public side. An interrupt is enabled when both the global enable in SHAMD5_SYSCONFIG (PIT_en) and the bit in this register are both set to 1. An interrupt that is enabled is propagated to the SINTREQUEST_P output. Please note that the dedicated partial hash output (SINTREQUEST_PART_P) is not affected by this register it is only affected by the global enable SHAMD5_SYSCONFIG (PIT_en).</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_A</name>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_A</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_B</name>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_B</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_C</name>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_C</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_D</name>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_D</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_E</name>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_E</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_F</name>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_F</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_G</name>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_G</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_H</name>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_H</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_I</name>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_I</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_J</name>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_J</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_K</name>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_K</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_L</name>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_L</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_M</name>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_M</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_N</name>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_N</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_O</name>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_O</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_ODIGEST_P</name>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <description>HASH512_ODIGEST_P</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_A</name>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_A</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_B</name>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_B</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_C</name>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_C</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_D</name>
          <addressOffset>0x24C</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_D</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_E</name>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_E</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_F</name>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_F</description>
          <resetValue>0</resetValue>
        </register>
