jbuonagurio/fanboard/svd/CC32xxSF.svd
        <register>
          <name>HASH512_IDIGEST_G</name>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_G</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_H</name>
          <addressOffset>0x25C</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_H</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_I</name>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_I</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_J</name>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_J</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_K</name>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_K</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_L</name>
          <addressOffset>0x26C</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_L</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_M</name>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_M</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_N</name>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_N</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_O</name>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_O</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_IDIGEST_P</name>
          <addressOffset>0x27C</addressOffset>
          <size>32</size>
          <description>HASH512_IDIGEST_P</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_DIGEST_COUNT</name>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <description>HASH512_DIGEST_COUNT</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_MODE</name>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <description>HASH512_MODE</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH512_LENGTH</name>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <description>HASH512_LENGTH</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AES</name>
      <baseAddress>0x44037000</baseAddress>
      <registers>
        <register>
          <name>KEY2_6</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>XTS second key / CBC-MAC third key</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY2_7</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>XTS second key (MSW for 256-bit key) / CBC-MAC third key (MSW)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY2_4</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>XTS / CCM second key / CBC-MAC third key (LSW)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY2_5</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>XTS second key (MSW for 192-bit key) / CBC-MAC third key</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY2_2</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>XTS / CCM / CBC-MAC second key / Hash Key input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY2_3</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>XTS second key (MSW for 128-bit key) + CCM/CBC-MAC second key (MSW) / Hash Key input (MSW)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY2_0</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>XTS / CCM / CBC-MAC second key (LSW) / Hash Key input (LSW)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY2_1</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>XTS / CCM / CBC-MAC second key / Hash Key input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY1_6</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Key (LSW for 256-bit key)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY1_7</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Key (MSW for 256-bit key)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY1_4</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Key (LSW for 192-bit key)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY1_5</name>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <description>Key (MSW for 192-bit key)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY1_2</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Key</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY1_3</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Key (MSW for 128-bit key)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY1_0</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Key (LSW for 128-bit key)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY1_1</name>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <description>Key</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IV_IN_0</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Initialization Vector input (LSW)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IV_IN_1</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Initialization vector input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IV_IN_2</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Initialization vector input</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IV_IN_3</name>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <description>Initialization Vector input (MSW)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTRL</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>register determines the mode of operation of the AES Engine</description>
          <fields>
            <field>
              <name>CCM</name>
              <description>[24:22] Defines M? that indicated the length of the authentication field for CCM operations; the authentication field length equals two times (the value of CCM-M plus one). Note that the AES Engine always returns a 128-bit authentication field@@ of which the M least significant bytes are valid. All values are supported.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>CCM_L</name>
              <description>[21:19] Defines L? that indicated the width of the length field for CCM operations; the length field in bytes equals the value of CMM-L plus one. Supported values for L are (programmed value): 2 (1)@@ 4 (3) and 8 (7).</description>
              <bitWidth>3</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>GCM</name>
              <description>[17:16] AES-GCM mode is selected.this is a combined mode@@ using the Galois field multiplier GF(2^128) for authentication and AES-CTR mode for encryption@@ the bits specify the GCM mode. 0x0 No operation 0x1 GHASH with H loaded and Y0-encrypted forced to zero 0x2 GHASH with H loaded and Y0-encrypted calculated internally 0x3 Autonomous GHASH (both H and Y0-encrypted calculated internally)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>XTS</name>
              <description>[12:11] AES-XTS operation is selected; the bits specify the XTS mode.01 = Previous/intermediate tweak value and j loaded (value is loaded via IV@@ j is loaded via the AAD length register) 0x0 No operation 0x1 Previous/intermediate tweak value and j loaded (value is loaded via IV@@ j is loaded via the AAD length register) 0x2 Key2@@ i and j loaded (i is loaded via IV@@ j is loaded via the AAD length register) 0x3 Key2 and i loaded@@ j=0 (i is loaded via IV)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CTR_WIDTH</name>
              <description>[8:7] Specifies the counter width for AES-CTR mode 0x0 Counter is 32 bits 0x1 Counter is 64 bits 0x2 Counter is 128 bits 0x3 Counter is 192 bits</description>
              <bitWidth>2</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>KEY_SIZE</name>
              <description>[4:3] key size 0x0 reserved 0x1 Key is 128 bits. 0x2 Key is 192 bits 0x3 Key is 256</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>C_LENGTH_0</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>Crypto data length registers (LSW and MSW) store the cryptographic data length in bytes for all modes. Once processing with this context is started@@ this length decrements to zero. Data lengths up to (2^61  1) bytes are allowed. For GCM@@ any value up to 2^36 - 32 bytes can be used. This is because a 32-bit counter mode is used; the maximum number of 128-bit blocks is 2^32  2@@ resulting in a maximum number of bytes of 2^36 - 32. A write to this register triggers the engine to start using this context. This is valid for all modes except GCM and CCM. Note that for the combined modes@@ this length does not include the authentication only data; the authentication length is specified in the AES_AUTH_LENGTH register below. All modes must have a length > 0. For the combined modes@@ it is allowed to have one of the lengths equal to zero. For the basic encryption modes (ECB/CBC/CTR/ICM/CFB128) it is allowed to program zero to the length field; in that case the length is assumed infinite. All data must be byte (8-bit) aligned; bit aligned data streams are not supported by the AES Engine. For a Host read operation@@ these registers return all-zeroes.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>C_LENGTH_1</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>Crypto data length registers (LSW and MSW) store the cryptographic data length in bytes for all modes. Once processing with this context is started@@ this length decrements to zero. Data lengths up to (2^61  1) bytes are allowed. For GCM@@ any value up to 2^36 - 32 bytes can be used. This is because a 32-bit counter mode is used; the maximum number of 128-bit blocks is 2^32  2@@ resulting in a maximum number of bytes of 2^36 - 32. A write to this register triggers the engine to start using this context. This is valid for all modes except GCM and CCM. Note that for the combined modes@@ this length does not include the authentication only data; the authentication length is specified in the AES_AUTH_LENGTH register below. All modes must have a length > 0. For the combined modes@@ it is allowed to have one of the lengths equal to zero. For the basic encryption modes (ECB/CBC/CTR/ICM/CFB128) it is allowed to program zero to the length field; in that case the length is assumed infinite. All data must be byte (8-bit) aligned; bit aligned data streams are not supported by the AES Engine. For a Host read operation@@ these registers return all-zeroes.</description>
          <fields>
            <field>
              <name>LENGTH</name>
              <description>[28:0] Data length (MSW) length registers (LSW and MSW) store the cryptographic data length in bytes for all modes. Once processing with this context is started@@ this length decrements to zero. Data lengths up to (2^61  1) bytes are allowed. For GCM@@ any value up to 2^36 - 32 bytes can be used. This is because a 32-bit counter mode is used; the maximum number of 128-bit blocks is 2^32  2@@ resulting in a maximum number of bytes of 2^36 - 32. A write to this register triggers the engine to start using this context. This is valid for all modes except GCM and CCM. Note that for the combined modes@@ this length does not include the authentication only data; the authentication length is specified in the AES_AUTH_LENGTH register below. All modes must have a length > 0. For the combined modes@@ it is allowed to have one of the lengths equal to zero. For the basic encryption modes (ECB/CBC/CTR/ICM/CFB128) it is allowed to program zero to the length field; in that case the length is assumed infinite. All data must be byte (8-bit) aligned; bit aligned data streams are not supported by the AES Engine. For a Host read operation@@ these registers return all-zeroes.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AUTH_LENGTH</name>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <description>AAD data length. The authentication length register store the authentication data length in bytes for combined modes only (GCM or CCM) Supported AAD-lengths for CCM are from 0 to (2^16 - 2^8) bytes. For GCM any value up to (2^32 - 1) bytes can be used. Once processing with this context is started@@ this length decrements to zero. A write to this register triggers the engine to start using this context for GCM and CCM. For XTS this register is optionally used to load j. Loading of j is only required if j != 0. j is a 28-bit value and must be written to bits [31-4] of this register. j represents the sequential number of the 128-bit block inside the data unit. For the first block in a unit@@ this value is zero. It is not required to provide a j for each new data block within a unit. Note that it is possible to start with a j unequal to zero; refer to Table 4 for more details. For a Host read operation@@ these registers return all-zeroes.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA_IN_0</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>Data register to read and write plaintext/ciphertext (MSW)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA_IN_1</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>Data register to read and write plaintext/ciphertext</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA_IN_2</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>Data register to read and write plaintext/ciphertext</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA_IN_3</name>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <description>Data register to read and write plaintext/ciphertext (LSW)</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAG_OUT_0</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>TAG_OUT_0</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAG_OUT_1</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>TAG_OUT_1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAG_OUT_2</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>TAG_OUT_2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAG_OUT_3</name>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <description>TAG_OUT_3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REVISION</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>Register AES_REVISION</description>
          <fields>
            <field>
              <name>SCHEME</name>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>FUNC</name>
              <description>[27:16] Function indicates a software compatible module family. If there is no level of software compatibility a new Func number (and hence REVISION) should be assigned.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>R_RTL</name>
              <description>[15:11] RTL Version (R)@@ maintained by IP design owner. RTL follows a numbering such as X.Y.R.Z which are explained in this table. R changes ONLY when: (1) PDS uploads occur which may have been due to spec changes (2) Bug fixes occur (3) Resets to '0' when X or Y changes. Design team has an internal 'Z' (customer invisible) number which increments on every drop that happens due to DV and RTL updates. Z resets to 0 when R increments.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>X_MAJOR</name>
              <description>[10:8] Major Revision (X)@@ maintained by IP specification owner. X changes ONLY when: (1) There is a major feature addition. An example would be adding Master Mode to Utopia Level2. The Func field (or Class/Type in old PID format) will remain the same. X does NOT change due to: (1) Bug fixes (2) Change in feature parameters.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CUSTOM</name>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>Y_MINOR</name>
              <description>[5:0] Minor Revision (Y)@@ maintained by IP specification owner. Y changes ONLY when: (1) Features are scaled (up or down). Flexibility exists in that this feature scalability may either be represented in the Y change or a specific register in the IP that indicates which features are exactly available. (2) When feature creeps from Is-Not list to Is list. But this may not be the case once it sees silicon; in which case X will change. Y does NOT change due to: (1) Bug fixes (2) Typos or clarifications (3) major functional/feature change/addition/deletion. Instead these changes may be reflected via R@@ S@@ X as applicable. Spec owner maintains a customer-invisible number 'S' which changes due to: (1) Typos/clarifications (2) Bug documentation. Note that this bug is not due to a spec change but due to implementation. Nevertheless@@ the spec tracks the IP bugs. An RTL release (say for silicon PG1.1) that occurs due to bug fix should document the corresponding spec number (X.Y.S) in its release notes.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSCONFIG</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>Register AES_SYSCONFIG.This register configures the DMA signals and controls the IDLE and reset logic</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSSTATUS</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>SYSSTATUS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IRQSTATUS</name>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <description>This register indicates the interrupt status. If one of the interrupt bits is set the interrupt output will be asserted</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IRQENABLE</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>This register contains an enable bit for each unique interrupt generated by the module. It matches the layout of AES_IRQSTATUS register. An interrupt is enabled when the bit in this register is set to 1. An interrupt that is enabled is propagated to the SINTREQUEST_x output. All interrupts need to be enabled explicitly by writing this register. ****************************************************************************</description>
          <resetValue>0</resetValue>
        </register>
