jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DES</name>
      <baseAddress>0x44039000</baseAddress>
      <registers>
        <register>
          <name>KEY3_L</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>KEY3 (LSW) for 192-bit key</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY3_H</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>KEY3 (MSW) for 192-bit key</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY2_L</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>KEY2 (LSW) for 192-bit key</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY2_H</name>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <description>KEY2 (MSW) for 192-bit key</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY1_L</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>KEY1 (LSW) for 128-bit key/192-bit key</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>KEY1_H</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>KEY1 (LSW) for 128-bit key/192-bit key</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IV_L</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Initialization vector LSW</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IV_H</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>Initialization vector MSW</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTRL</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>CTRL</description>
          <fields>
            <field>
              <name>MODE</name>
              <description>[5:4] Select CBC ECB or CFB mode 0x0 ecb mode 0x1 cbc mode 0x2 cfb mode 0x3 reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LENGTH</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Indicates the cryptographic data length in bytes for all modes. Once processing is started with this context this length decrements to zero. Data lengths up to (2^32  1) bytes are allowed. A write to this register triggers the engine to start using this context. For a Host read operation these registers return all-zeroes.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA_L</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Data register(LSW) to read/write encrypted/decrypted data.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DATA_H</name>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <description>Data register(MSW) to read/write encrypted/decrypted data.</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>REVISION</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>REVISION</description>
          <fields>
            <field>
              <name>SCHEME</name>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>FUNC</name>
              <description>[27:16] Function indicates a software compatible module family. If there is no level of software compatibility a new Func number (and hence REVISION) should be assigned.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>R_RTL</name>
              <description>[15:11] RTL Version (R) maintained by IP design owner. RTL follows a numbering such as X.Y.R.Z which are explained in this table. R changes ONLY when: (1) PDS uploads occur which may have been due to spec changes (2) Bug fixes occur (3) Resets to '0' when X or Y changes. Design team has an internal 'Z' (customer invisible) number which increments on every drop that happens due to DV and RTL updates. Z resets to 0 when R increments.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>X_MAJOR</name>
              <description>[10:8] Major Revision (X) maintained by IP specification owner. X changes ONLY when: (1) There is a major feature addition. An example would be adding Master Mode to Utopia Level2. The Func field (or Class/Type in old PID format) will remain the same. X does NOT change due to: (1) Bug fixes (2) Change in feature parameters.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CUSTOM</name>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>Y_MINOR</name>
              <description>[5:0] Minor Revision (Y) maintained by IP specification owner. Y changes ONLY when: (1) Features are scaled (up or down). Flexibility exists in that this feature scalability may either be represented in the Y change or a specific register in the IP that indicates which features are exactly available. (2) When feature creeps from Is-Not list to Is list. But this may not be the case once it sees silicon; in which case X will change. Y does NOT change due to: (1) Bug fixes (2) Typos or clarifications (3) major functional/feature change/addition/deletion. Instead these changes may be reflected via R S X as applicable. Spec owner maintains a customer-invisible number 'S' which changes due to: (1) Typos/clarifications (2) Bug documentation. Note that this bug is not due to a spec change but due to implementation. Nevertheless the spec tracks the IP bugs. An RTL release (say for silicon PG1.1) that occurs due to bug fix should document the corresponding spec number (X.Y.S) in its release notes.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSCONFIG</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>SYSCONFIG</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYSSTATUS</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>SYSSTATUS</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IRQSTATUS</name>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <description>This register indicates the interrupt status. If one of the interrupt bits is set the interrupt output will be asserted</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IRQENABLE</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>This register contains an enable bit for each unique interrupt generated by the module. It matches the layout of DES_IRQSTATUS register. An interrupt is enabled when the bit in this register is set to 1 ****************************************************************************</description>
          <resetValue>0</resetValue>
        </register>
