jbuonagurio/fanboard/svd/CC32xxSF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <baseAddress>0xE000E000</baseAddress>
      <registers>
        <register>
          <name>INT_TYPE</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Interrupt Controller Type Reg</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ACTLR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Auxiliary Control</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ST_CTRL</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>SysTick Control and Status Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ST_RELOAD</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>SysTick Reload Value Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ST_CURRENT</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>SysTick Current Value Register</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ST_CAL</name>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <description>SysTick Calibration Value Reg</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EN0</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>Interrupt 0-31 Set Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EN1</name>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <description>Interrupt 32-54 Set Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EN2</name>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <description>Interrupt 64-95 Set Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EN3</name>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <description>Interrupt 96-127 Set Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EN4</name>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <description>Interrupt 128-131 Set Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EN5</name>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <description>Interrupt 160-191 Set Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIS0</name>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <description>Interrupt 0-31 Clear Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIS1</name>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <description>Interrupt 32-54 Clear Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIS2</name>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <description>Interrupt 64-95 Clear Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIS3</name>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <description>Interrupt 96-127 Clear Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIS4</name>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <description>Interrupt 128-131 Clear Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DIS5</name>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <description>Interrupt 160-191 Clear Enable</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PEND0</name>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <description>Interrupt 0-31 Set Pending</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PEND1</name>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <description>Interrupt 32-54 Set Pending</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PEND2</name>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <description>Interrupt 64-95 Set Pending</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PEND3</name>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <description>Interrupt 96-127 Set Pending</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PEND4</name>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <description>Interrupt 128-131 Set Pending</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PEND5</name>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <description>Interrupt 160-191 Set Pending</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UNPEND0</name>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <description>Interrupt 0-31 Clear Pending</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UNPEND1</name>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <description>Interrupt 32-54 Clear Pending</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UNPEND2</name>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <description>Interrupt 64-95 Clear Pending</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UNPEND3</name>
          <addressOffset>0x28C</addressOffset>
          <size>32</size>
          <description>Interrupt 96-127 Clear Pending</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UNPEND4</name>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <description>Interrupt 128-131 Clear Pending</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UNPEND5</name>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <description>Interrupt 160-191 Clear Pending</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ACTIVE0</name>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <description>Interrupt 0-31 Active Bit</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ACTIVE1</name>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <description>Interrupt 32-54 Active Bit</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ACTIVE2</name>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <description>Interrupt 64-95 Active Bit</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ACTIVE3</name>
          <addressOffset>0x30C</addressOffset>
          <size>32</size>
          <description>Interrupt 96-127 Active Bit</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ACTIVE4</name>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <description>Interrupt 128-131 Active Bit</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ACTIVE5</name>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <description>Interrupt 160-191 Active Bit</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI0</name>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <description>Interrupt 0-3 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI1</name>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <description>Interrupt 4-7 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI2</name>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <description>Interrupt 8-11 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI3</name>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <description>Interrupt 12-15 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI4</name>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <description>Interrupt 16-19 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI5</name>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <description>Interrupt 20-23 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI6</name>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <description>Interrupt 24-27 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI7</name>
          <addressOffset>0x41C</addressOffset>
          <size>32</size>
          <description>Interrupt 28-31 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI8</name>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <description>Interrupt 32-35 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI9</name>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <description>Interrupt 36-39 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI10</name>
          <addressOffset>0x428</addressOffset>
          <size>32</size>
          <description>Interrupt 40-43 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI11</name>
          <addressOffset>0x42C</addressOffset>
          <size>32</size>
          <description>Interrupt 44-47 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI12</name>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <description>Interrupt 48-51 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI13</name>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <description>Interrupt 52-53 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI14</name>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <description>Interrupt 56-59 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI15</name>
          <addressOffset>0x43C</addressOffset>
          <size>32</size>
          <description>Interrupt 60-63 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI16</name>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <description>Interrupt 64-67 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI17</name>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <description>Interrupt 68-71 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI18</name>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <description>Interrupt 72-75 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI19</name>
          <addressOffset>0x44C</addressOffset>
          <size>32</size>
          <description>Interrupt 76-79 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI20</name>
          <addressOffset>0x450</addressOffset>
          <size>32</size>
          <description>Interrupt 80-83 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI21</name>
          <addressOffset>0x454</addressOffset>
          <size>32</size>
          <description>Interrupt 84-87 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI22</name>
          <addressOffset>0x458</addressOffset>
          <size>32</size>
          <description>Interrupt 88-91 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI23</name>
          <addressOffset>0x45C</addressOffset>
          <size>32</size>
          <description>Interrupt 92-95 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI24</name>
          <addressOffset>0x460</addressOffset>
          <size>32</size>
          <description>Interrupt 96-99 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI25</name>
          <addressOffset>0x464</addressOffset>
          <size>32</size>
          <description>Interrupt 100-103 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI26</name>
          <addressOffset>0x468</addressOffset>
          <size>32</size>
          <description>Interrupt 104-107 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI27</name>
          <addressOffset>0x46C</addressOffset>
          <size>32</size>
          <description>Interrupt 108-111 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI28</name>
          <addressOffset>0x470</addressOffset>
          <size>32</size>
          <description>Interrupt 112-115 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI29</name>
          <addressOffset>0x474</addressOffset>
          <size>32</size>
          <description>Interrupt 116-119 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI30</name>
          <addressOffset>0x478</addressOffset>
          <size>32</size>
          <description>Interrupt 120-123 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI31</name>
          <addressOffset>0x47C</addressOffset>
          <size>32</size>
          <description>Interrupt 124-127 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI32</name>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <description>Interrupt 128-131 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI33</name>
          <addressOffset>0x484</addressOffset>
          <size>32</size>
          <description>Interrupt 132-135 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI34</name>
          <addressOffset>0x488</addressOffset>
          <size>32</size>
          <description>Interrupt 136-139 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI35</name>
          <addressOffset>0x48C</addressOffset>
          <size>32</size>
          <description>Interrupt 140-143 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI36</name>
          <addressOffset>0x490</addressOffset>
          <size>32</size>
          <description>Interrupt 144-147 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI37</name>
          <addressOffset>0x494</addressOffset>
          <size>32</size>
          <description>Interrupt 148-151 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI38</name>
          <addressOffset>0x498</addressOffset>
          <size>32</size>
          <description>Interrupt 152-155 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI39</name>
          <addressOffset>0x49C</addressOffset>
          <size>32</size>
          <description>Interrupt 156-159 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI40</name>
          <addressOffset>0x4A0</addressOffset>
          <size>32</size>
          <description>Interrupt 160-163 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI41</name>
          <addressOffset>0x4A4</addressOffset>
          <size>32</size>
          <description>Interrupt 164-167 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI42</name>
          <addressOffset>0x4A8</addressOffset>
          <size>32</size>
          <description>Interrupt 168-171 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI43</name>
          <addressOffset>0x4AC</addressOffset>
          <size>32</size>
          <description>Interrupt 172-175 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI44</name>
          <addressOffset>0x4B0</addressOffset>
          <size>32</size>
          <description>Interrupt 176-179 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI45</name>
          <addressOffset>0x4B4</addressOffset>
          <size>32</size>
          <description>Interrupt 180-183 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI46</name>
          <addressOffset>0x4B8</addressOffset>
          <size>32</size>
          <description>Interrupt 184-187 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI47</name>
          <addressOffset>0x4BC</addressOffset>
          <size>32</size>
          <description>Interrupt 188-191 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PRI48</name>
          <addressOffset>0x4C0</addressOffset>
          <size>32</size>
          <description>Interrupt 192-195 Priority</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CPUID</name>
          <addressOffset>0xD00</addressOffset>
          <size>32</size>
          <description>CPU ID Base</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>INT_CTRL</name>
          <addressOffset>0xD04</addressOffset>
          <size>32</size>
          <description>Interrupt Control and State</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>VTABLE</name>
          <addressOffset>0xD08</addressOffset>
          <size>32</size>
          <description>Vector Table Offset</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>APINT</name>
          <addressOffset>0xD0C</addressOffset>
          <size>32</size>
          <description>Application Interrupt and Reset Control</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYS_CTRL</name>
          <addressOffset>0xD10</addressOffset>
          <size>32</size>
          <description>System Control</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CFG_CTRL</name>
          <addressOffset>0xD14</addressOffset>
          <size>32</size>
          <description>Configuration and Control</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYS_PRI1</name>
          <addressOffset>0xD18</addressOffset>
          <size>32</size>
          <description>System Handler Priority 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYS_PRI2</name>
          <addressOffset>0xD1C</addressOffset>
          <size>32</size>
          <description>System Handler Priority 2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYS_PRI3</name>
          <addressOffset>0xD20</addressOffset>
          <size>32</size>
          <description>System Handler Priority 3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYS_HND_CTRL</name>
          <addressOffset>0xD24</addressOffset>
          <size>32</size>
          <description>System Handler Control and State</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FAULT_STAT</name>
          <addressOffset>0xD28</addressOffset>
          <size>32</size>
          <description>Configurable Fault Status</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HFAULT_STAT</name>
          <addressOffset>0xD2C</addressOffset>
          <size>32</size>
          <description>Hard Fault Status</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DEBUG_STAT</name>
          <addressOffset>0xD30</addressOffset>
          <size>32</size>
          <description>Debug Status Register</description>
          <resetValue>0</resetValue>
        </register>
