jbuonagurio/fanboard/svd/CC32xxSF.svd
        <register>
          <name>MM_ADDR</name>
          <addressOffset>0xD34</addressOffset>
          <size>32</size>
          <description>Memory Management Fault Address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FAULT_ADDR</name>
          <addressOffset>0xD38</addressOffset>
          <size>32</size>
          <description>Bus Fault Address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPU_TYPE</name>
          <addressOffset>0xD90</addressOffset>
          <size>32</size>
          <description>MPU Type</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPU_CTRL</name>
          <addressOffset>0xD94</addressOffset>
          <size>32</size>
          <description>MPU Control</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPU_NUMBER</name>
          <addressOffset>0xD98</addressOffset>
          <size>32</size>
          <description>MPU Region Number</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPU_BASE</name>
          <addressOffset>0xD9C</addressOffset>
          <size>32</size>
          <description>MPU Region Base Address</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPU_ATTR</name>
          <addressOffset>0xDA0</addressOffset>
          <size>32</size>
          <description>MPU Region Attribute and Size</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPU_BASE1</name>
          <addressOffset>0xDA4</addressOffset>
          <size>32</size>
          <description>MPU Region Base Address Alias 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPU_ATTR1</name>
          <addressOffset>0xDA8</addressOffset>
          <size>32</size>
          <description>MPU Region Attribute and Size Alias 1</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPU_BASE2</name>
          <addressOffset>0xDAC</addressOffset>
          <size>32</size>
          <description>MPU Region Base Address Alias 2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPU_ATTR2</name>
          <addressOffset>0xDB0</addressOffset>
          <size>32</size>
          <description>MPU Region Attribute and Size Alias 2</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPU_BASE3</name>
          <addressOffset>0xDB4</addressOffset>
          <size>32</size>
          <description>MPU Region Base Address Alias 3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MPU_ATTR3</name>
          <addressOffset>0xDB8</addressOffset>
          <size>32</size>
          <description>MPU Region Attribute and Size Alias 3</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DBG_CTRL</name>
          <addressOffset>0xDF0</addressOffset>
          <size>32</size>
          <description>Debug Control and Status Reg</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DBG_XFER</name>
          <addressOffset>0xDF4</addressOffset>
          <size>32</size>
          <description>Debug Core Reg. Transfer Select</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DBG_DATA</name>
          <addressOffset>0xDF8</addressOffset>
          <size>32</size>
          <description>Debug Core Register Data</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DBG_INT</name>
          <addressOffset>0xDFC</addressOffset>
          <size>32</size>
          <description>Debug Reset Interrupt Control</description>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SW_TRIG</name>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <description>Software Trigger Interrupt ***************************************************************************</description>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>